{"metadata":{"topics":[],"person_names":[],"vars":{"Party":{"Dendreon Corporation":"[[Party 1]]"}},"organization_names":["company group life insurance plan"],"agreement_id":"552f9fa6f11f896ab9b117874a7fe1aa4a4f2ce509ade9965bccb6fb1e57ac91","terms":["** ([___]**","** As compensation for Employee’s performance of **","** Base Salary (the “***","** Employee agrees that, during the term of employment with the Company and for a period of [___]**","** Employee may voluntarily resign position with the Company without Good Reason at any time on thirty (30) days’ advance written notice. In the event Employee’s resignation is without Good Reason, Employee will be entitled to receive, on Employee’s first regular payday following the Termination Date, a lump sum payment equivalent to the Accrued Benefits. All other Company obligations to Employee pursuant to this Agreement other than Employee’s accrued benefits under the Company’s benefit and welfare plans and [his/her]**","** Employee shall be eligible to earn **","** Employee shall perform such duties as are customary for the position of **","** Employee’s employment will terminate automatically upon death of Employee. In the event of Employee’s death, the Accrued Benefits shall be paid, on Employee’s first regular payday following the Termination Date, to the beneficiary designated in writing by Employee (“***","** In the event that Employee becomes physically or mentally disabled such that he/she is unable to perform **","** The Company hereby employs Employee as [TITLE]**","** The Company may terminate Employee’s employment at any time for Cause. For purposes of this Agreement, “***","** The term “***","** Within thirty (30) days after the end of each calendar year, if the Company and Employee meet specified targets agreed upon in advance by the Board of Directors of the Company (the “***","** and any additional duties that **","** dollars ($**","** duties for a period of three (3) consecutive months as determined by a medical professional (“***","** duties under this Agreement, the Company shall pay Employee a base salary (“***","** may reasonably prescribe from time to time. Employee shall devote Employee’s full business time and efforts to the performance of Employee’s assigned duties for the Company, provided, however, that Employee may devote reasonable periods of time to (a) serving on the board of directors of other corporations subject to the prior approval of the [CEO OR, IN THE CASE OF THE CEO, THE BOARD]**","** percent (**","** sole discretion. Employee must be currently employed by the Company as of the date of payment of any Annual Bonus in order to be entitled to such payment. If the Company and Employee do not fully meet such targets, the Company may pay Employee a bonus of such amount as the [BOARD IN THE CASE OF SECTION 16 OFFICERS OR THE BOARD OR ITS DESIGNEE IN THE CASE OF VICE PRESIDENTS]**","** termination of employment (the “*","**%) of **","**(WASHINGTON STATE)**","**) per calendar year, payable in accordance with the normal payroll practices of the Company, less required deductions for state and federal withholding tax, social security and all other required employment taxes and payroll deductions. For purposes of Section 6 hereof, Employee’s Base Salary shall be the current Base Salary as of the date of **","***”","***” as used in this Agreement means any individual or entity that is directly or indirectly engaged in the development and/or commercialization in the United States of one or more ex vivo cellular immunotherapies for the therapeutic treatment of cancer, which ex vivo cellular immunotherapies generate twenty percent ([[Percentage 5: Number]]%) or more of either the annual gross revenue or worldwide operating expense of such Competitor in the United States. The term “*","***” is defined as: (i) Employee’s willful and continued failure to substantially perform [his/her]**","***”) as determined by **","***”) or, if no such Beneficiary is designated, to Employee’s estate. In addition, (i) commencing on the Termination Date, the Company will continue Employee’s Base Salary until the earlier of six months from the Termination Date or the commencement of death benefits under any existing Company Group Life Insurance Plan, (ii) within sixty (60) days following the Termination Date, the Company shall pay any unpaid Annual Bonus with respect to the calendar year ended prior to the termination of Employee’s employment and a pro rata Annual Bonus (based upon [his/her]**","***”), Employee shall be entitled to receive a target bonus of **","***”), the Company may terminate Employee’s employment, unless otherwise prohibited by law. In the event of termination due to Disability, Employee shall be paid, on Employee’s first regular payday following the Termination Date, a lump sum payment equivalent to the Accrued Benefits. In addition, (i) the Company will pay Employee a cash lump sum in an amount equal to half of Employee’s Base Salary; (ii) the Company shall pay any unpaid Annual Bonus with respect to the calendar year ended prior to the termination of Employee’s employment and a pro rata Annual Bonus (based upon [his/her]**","***”), which shall initially equal **","**, in **","**Adjustment of Payments and Benefits****","**Agreement Not to Compete****","**Arbitration****","**Base Salary**","**Benefits and Insurance****","**Board Action****","**Business Expenses****","**Compensation****","**Compliance with Section 409A of the Code****","**Death**","**Definition of Competitor**","**Disability**","**Duties****","**EXECUTIVE EMPLOYMENT AGREEMENT**","**Employee’s Execution of Release and Timing of Payments****","**Employment**","**Entire Agreement****","**Equity Grants.**","**General Provisions****","**Governing Law and Venue****","**Incentive Compensation**","**Injunctive Relief****","**Interpretation; Construction****","**Legal Fees and Expenses**","**No Employment with, or Connection to, Competitor**","**Nonsolicitation of Company Employees and Customers****","**Notices****","**Performance and Compensation Review****","**Position**","**Reasonableness of Restrictions****","**Release**","**Resignation by Employee Without Good Reason**","**Resignation of Employee for Good Reason****","**Separation of Employee’s Employment****","**Severability****","**Successors and Assigns****","**Survival****","**Term****","**Termination Upon Death or Disability****","**Termination Without Cause; Change of Control****","**Termination for Cause by the Company**","**Time of Payments**","**Vacation**","**Waiver****","**Withholding**","**Work Location****","**[EMPLOYEE]**","**[NAME]**","**[___]**","**[______]**","**[his/her]**","“***13G Filer***”","“***Accrued Benefits***”","“***Agreement***”","“***Annual Bonus***”","“***Base Salary***”","“***Beneficiary***”","“***Board***”","“***COBRA***”","“***Change of Control Protection Period***”","“***Company***”","“***Disability***”","“***Effective Date***”","“***Employee***”","“***Excess Parachute Payment***","“***Exchange Act***”","“***Good Reason***”","“***Incumbent Directors***”","“***Insolvency Proceeding***”","“***Non-Control Acquisition***”","“***Person***”","“***Proxy Contest***”","“***Release***”","“***Severance***","“***Voting Securities***”","“***disposition***”","“***reorganization***”","“***transaction***”","“**Change of Control**”","“*Termination Date***”","“Confidentiality; Agreement Not to Compete”","“General Provisions”","“Legal Fees and Expenses”","“Nonqualified Deferred Compensation”","“Separation of Employee’s Employment”"]}}