{"metadata": {"organization_names": [], "person_names_verified": ["charles j. gray"], "organization_names_verified": [], "vars": {"Party": {"Teradyne, Inc.": "[[Party 1]]"}}, "entities_rejected": ["m.g.l. c.214"], "person_names": [], "agreement_id": "52eb8beac745faa832462d75e0b6aac4195b241ad2f785ccc1801d57813d7854", "topics": [], "terms": ["**EXECUTIVE OFFICER CHANGE IN CONTROL AGREEMENT**", "**Period for Review and Consideration of Agreement:**", "**Waiver of Rights and Claims Under the Age Discrimination in Employment Act of 1967:**", "**[ , 2009]**", "**[REMAINDER OF PAGE INTENTIONALLY LEFT BLANK]**", "**in consideration for the payments and benefits described in the Amended and Restated Executive Officer Change in Control Agreement, which I am not otherwise entitled to receive, I specifically and voluntarily waive such rights and/or claims under the ADEA I might have against the Released Parties to the extent such rights and/or claims arose prior to the date this Release Agreement was executed;**", "**in entering into this Release Agreement I am not relying on any representation, promise or inducement made by the Company or its attorneys with the exception of those promises described in this document.**", "’ fees and costs), of every kind and nature which I ever had or now have against the Released Parties arising out of my employment with and/or termination or separation from the Company or relating to my relationship as an officer or in any other capacity for the Company, including, but not limited to, all employment discrimination claims under Title VII of the Civil Rights Act of 1964, 42 U.S.C. §2000e et seq., the Age Discrimination in Employment Act, 29 U.S.C. § 621 et seq., the Americans With Disabilities Act of 1990, 42 U.S.C., §12101 et seq., the Family and Medical Leave Act, 29 U.S.C. § 2601 et seq., and the Massachusetts Fair Employment Practices Act., M.G.L. c.151B, §1 et seq., all as amended; all claims arising out of the Fair Credit Reporting Act, 15 U.S.C. §1681 et seq., the Employee Retirement Income Security Act of 1974 (“ERISA”", "“Code”", "“Company”", "“Employee”", "“Salary Continuation Period”", "“Teradyne”", "“Term”"]}}