{"metadata": {"organization_names": [], "person_names_verified": [], "organization_names_verified": ["yucaipa corporate initiatives fund i, lp", "yucaipa american alliance fund i, lp", "yucaipa american alliance fund ii", "americold realty trust", "the fund indemnitors"], "topics": [], "entities_rejected": [], "person_names": [], "agreement_id": "eccfdca268eeb701cdab242a94e57567e99dec5d0b8df53f1268718e0a98a094", "vars": {}, "terms": ["**(collectively, the “Fund Indemnitors”). The Company hereby agrees (i) that it is the indemnitor of first resort for any claims made against Indemnitee by reason of his Company Status (*", "***[Description of Proceeding]***", "**.**", "**EXHIBIT A**", "**FORM OF UNDERTAKING TO REPAY EXPENSES ADVANCED**", "**FORM OF**", "**INDEMNIFICATION AGREEMENT**", "**Yucaipa Corporate Initiatives Fund I, LP)**", "**[Except as provided in paragraph (a) above, t][T]**", "**[Primacy of Indemnification;]**", "**[The Company hereby acknowledges that Indemnitee has certain rights to indemnification, advancement of expenses and/or insurance provided by The Yucaipa Companies and certain of its affiliates (including Yucaipa American Alliance Fund I, LP, Yucaipa American Alliance (Parallel) Fund I, L.P., Yucaipa American Alliance Fund II, L.P., Yucaipa American Alliance (Parallel) Fund II, L.P. and**", "*, its obligations to Indemnitee are primary and any obligation of the Fund Indemnitors to advance Expenses or to provide indemnification for the same Expenses or liabilities incurred by Indemnitee by reason of his Company Status are secondary), (ii) that it shall be required to advance the full amount of Expenses incurred by Indemnitee by reason of his Company Status and shall be liable for the full amount of all Expenses, judgments, penalties, fines and amounts paid in settlement to the extent legally permitted and as required by the terms of this Agreement and the Company’s declaration of trust or Bylaws (or any other agreement between the Company and Indemnitee), without regard to any rights Indemnitee may have against the Fund Indemnitors, and, (iii) that it irrevocably waives, relinquishes and releases the Fund Indemnitors from any and all claims against the Fund Indemnitors for contribution or subrogation in respect of any claims made against Indemnitee by reason of his Company Status. The Company further agrees that no advancement or payment by the Fund Indemnitors on behalf of Indemnitee with respect to any claim for which Indemnitee has sought indemnification from the Company pursuant to this Agreement shall affect the foregoing and the Fund Indemnitors shall have a right of contribution and/or be subrogated to the extent of such advancement or payment to all of the rights of recovery of Indemnitee against the Company as permitted by this Agreement. The Company and Indemnitee agree that the Fund Indemnitors are express third party beneficiaries of the terms of this Section 16(a).]**", "*[Include language in bold for trustees nominated by Yucaipa]*", "*nolo contendere*", "“Advanced Expenses”", "“Agreement”", "“Company”", "“Exchange Act”", "“Indemnification Agreement”", "“Indemnitee”", "“MGCL”", "“Proceeding”"]}}