{"metadata": {"organization_names": [], "person_names_verified": ["joe payne", "jon olin"], "organization_names_verified": ["israel discount bank limited", "amtec jet, inc.", "national westminster bank usa", "bhf bank", "c&s acquisitions corp.", "abx air inc", "air transport services group inc", "transport services group", "dhl express usa inc", "dpwn holdings usa inc", "ernst & young", "deutsche post ag", "cargo aircraft management", "abx air, inc.", "air transport services group", "dhl express", "dhl network operations", "dpwn holdings", "dhl network operations usa inc"], "topics": [], "entities_rejected": [], "person_names": [], "agreement_id": "ea7bff896f7309f81e7986645d5c152c8d591337e5ba0bfd5524e23e6e4026d7", "vars": {}, "terms": ["**(Numbers to be updated as of [[Date 7]])**", "***   This amount is subject to DHL Review in accordance with Sections 2.2 and 2.5 of the Agreement.**", "**Appendix A**", "**Appendix B**", "**Appendix C**", "**Appendix D**", "**Date of Instrument**", "**Exhibit A**", "**FAA Conveyance No.**", "**FAA Recording Date**", "**Form of Reconciliation Statement**", "**Instrument**", "**MUTUAL TERMINATION AGREEMENT AND RELEASE**", "**New Guaranty**", "**Part 1. Cost Recovery Adjustments Statement**", "**Part 2. Additional Termination Settlement Provisions**", "**Part 3. Additional Provisions under the S&R Agreement**", "**Part 4. Accounting Items from 2009 Subject to Additional Review**", "**Put Aircraft Encumbrances**", "**Wire Transfer Instructions**", "**Workers’ Compensation Calculation**", "*, *", "*, that in no event shall Network Operations be liable for (x) any such retroactive compensation payment in excess of $[*", "*See Attached.*", "*] by wire transfer of immediately available funds to the account(s) designated by ABX in Appendix C. Thereafter, on each of the first and second anniversaries of the date on which the New Agreements are executed, DHL will further pay ABX and/or one of its affiliates (as determined by ABX) an additional amount totaling $[*", "*] for salary costs (plus the directly related employer payroll taxes) associated with retroactive compensation payments to flight crewmember employees incurred by ABX in connection with the New Pilots CBA (as defined below), (ii) ABX has already accrued the retroactive compensation payments (and directly related employer payroll taxes) referred to in the foregoing clause (i), and (iii) the Final Reconciliation Statement shall include, to the extent that DHL has not already done so, reimbursement of ABX for such retroactive compensation payment (and directly related employer payroll taxes); *", "*] for the first 59 months and shall be further reduced by $[*", "*] in the aggregate) will be credited to each of ABX and DHL; and (C) [*", "*] related to the ABX workers’ compensation liability accrual under the Service Agreements. This payment, combined with the $[*", "*]% of the first $[*", "*]% of the next $[*", "*bona fide*", "*however*", "*i.e.*", "*provided*", "*provided, however,*", "’ compensation arrangements, severance arrangements or qualified or non-qualified pension plans), in each case that have been maintained, or contributed to, by ATSG or ABX since [[Date 2]], and any and all other liabilities of ATSG or ABX that relate to any such plan, program, policy, arrangement or agreement, including Actions involving (i) the funding or funded status (including any underfunding) of any such plan, document, benefit or arrangement or (ii) any breach, non-performance, action or failure to act under the Service Agreements or in connection therewith, in each case, which have been asserted against DHL or any of its Related Parties or which, whether currently known or unknown, suspected or unsuspected, foreseen or unforeseen, anticipated or unanticipated, ever could have been asserted or ever could be asserted against DHL or any of its Related Parties, in any capacity, relating to any Action from or after [[Date 2]] in connection with the foregoing (collectively, the “Released Benefit Claims” and, together with the Released General Claims, the “Released Claims”", "“ABX Indemnified Parties”", "“ABX”", "“ACMI Guaranty”", "“ATSG”", "“Accrued Vacation”", "“Agreement”", "“Airborne”", "“CAM”", "“CCPA”", "“DHL Express”, and, together with DPWN Holdings, Network Operations and their affiliates, “DHL”", "“DHL Indemnified Parties”", "“DPWN Holdings”", "“Effective Termination Time”", "“Final WC Claims Amount”", "“Final WC Reimbursement Amount”", "“Guarantor”", "“Guaranty Termination Time”", "“HLA Guaranty” and together with the ACMI Guaranty, the “Existing Guaranties”", "“ILN”", "“Independent Auditor”", "“Initial WC Reimbursement Amount”", "“Network Operations”", "“New Guaranty”", "“New Pilots CBA”", "“Objection Notice”", "“Objections”"]}}