{"metadata": {"organization_names": [], "person_names_verified": [], "organization_names_verified": ["computer associates", "gmac mortgage services", "the home marketing", "relocation service company", "weichert relocation resources", "ca, inc."], "vars": {}, "entities_rejected": [], "person_names": [], "agreement_id": "dea6e4746fe931e1e9a01d23ba60f757cb96528369163076572af0984617113c", "topics": [], "terms": ["**$[[USD Value 3: Number]]**", "***Best wishes to you and your family in your new location.***", "***Furthermore, we are committed to ensuring that our service partners meet our requirements for efficient, customer-oriented service delivery. These selected service partners will work with you throughout your move and will be available to answer any questions that you have.***", "***It is our shared responsibility to communicate openly and honestly and to cooperate with one another to ensure the highest level of motivation, morale and productivity during the relocation process.***", "***Our goal is to provide our mobile employees and their families with the tools and assistance to help them relocate in a timely and cost-effective manner.***", "***The objective of the home finding counseling you will receive is to help you find an affordable home as quickly as possible, and to settle into a new location with the least amount of inconvenience and cost.***", "***You will be asked to confirm receipt of this policy to ensure effective communication.***", "**ALL FEES ON SECOND MORTGAGES ARE EXCLUDED AND ARE NOT COVERED**", "**APPROVED REAL ESTATE FIRMS / BROKERS**", "**Authorized Services**", "**BVO Eligibility**", "**Buyer Incentive**", "**CA, INC. HOMEOWNERS RELOCATION POLICY FOR BANDS K, L and ZZ (SENIOR EXECUTIVES)**", "**CA, INC.**", "**CALCULATION AND PAYMENT**", "**Closing the Sale and Receiving Your Equity**", "**DO NOT SIGN ANY SALES AGREEMENT OR ACCEPT ANY DOWN PAYMENT OR DEPOSIT WITHOUT FIRST SPEAKING TO YOUR COUNSELOR.**", "**Disclosure**", "**ELIGIBILITY**", "**Final Move Expenses**", "**FlashPoint**", "**Gross-Up**", "**HOMEOWNERS RELOCATION POLICY FOR BANDS K, L AND ZZ (SENIOR EXECUTIVES)**", "**HUMAN RESOURCES RESPONSIBILITIES**", "**Home Sale Bonus**", "**INTRODUCTION**", "**If you choose a lender outside the preferred vendor list, the aforementioned fees are excluded from being reimbursed.**", "**If you choose to use a lender other than WRRI or GMAC, you may request a cash advance of your estimated closing costs,**", "**Insuring Your Household Goods**", "**LUMP SUM COMPONENTS \u0097 The following components are included in the lump sum payment for which you are eligible:**", "**LUMP SUM PAYMENTS**", "**Listing Exclusion Clause**", "**Loss On Sale**", "**MISCELLANEOUS ALLOWANCE**", "**MOVE ELIGIBILITY**", "**MOVING TO YOUR NEW LOCATION**", "**Mortgage Programs**", "**Moving Your Household Goods**", "**Moving Your Vehicles**", "**NEW HOME PURCHASE ASSISTANCE/MORTGAGE PROGRAMS**", "**NEW HOME PURCHASE**", "**NEW RESIDENCE**", "**Pre-Approval**", "**RELOCATION ADDENDUM**", "**RELOCATION SERVICE COMPANY**", "**Relocation Expense**", "**SELLING YOUR HOME ON YOUR OWN**", "**SELLING YOUR HOME \u0097 Home Marketing Assistance and the Buyer Value Option (BVO) Program**", "**STANDARDS FOR COMPANY-APPROVED BROKERS**", "**TAX INFORMATION**", "**Tax Calculation**", "**The Broker Selection Process**", "**The Company does not reimburse tips to movers.**", "**The Company will not pay for the following services:**", "**The Company will pay for the following services:**", "**The Home Marketing Process**", "**The Process**", "**WORKING SOLUTIONS \u0097 Work/Life & Referral Service**", "**Weichert Relocation Resources, Inc. (WRRI)**", "**When You Receive an Offer**", "**YOUR RESPONSIBILITIES**", "**You are eligible for the relocation benefits for up to 12 months from your effective date of transfer. It is recommended that you submit relocation-related expense reports within 90 days of the date incurred, if applicable.**", "**You will be responsible for all income taxes associated with the reimbursement of these costs, which can be a substantial amount. Therefore, you are strongly encouraged to participate in the BVO program if at all possible.**", "**Your eligibility to receive relocation benefits is subject to the terms and conditions of CA’s Relocation Policy and is conditioned upon your signing the Moving and Expense Repayment Agreement.**", "**are not**", "**do not**", "**marketing and corporate information provided by Weichert Relocation Resources, Inc. (“WRRI”) to the listing broker, such broker agrees to pay WRRI a mutually agreed referral fee. The listing broker authorizes the closing agent (WRRI’s title company or attorney) to deduct the referral fee from the commission monies due at the closing and to pay same to WRRI directly.”**", "**“In consideration of the placement of the referral, and/or the**", "**“It is understood and agreed that whether or not an offer is presented by a ready, willing and able buyer, no commission or compensation shall be earned by or due and payable to broker until the sale of the Property has been consummated between the owner and buyer, the deed delivered to the buyer and the purchase price delivered to the owner. The owner(s) reserves the right to sell this Property to CA, Inc. (“Computer Associates”) or to a home sale assistance company acting on its behalf. Upon execution by CA or the home sale assistance company and the owner(s) of a Contract of Sale with respect to the Property, this Listing Agreement shall immediately terminate with no obligation on owners’ part or on the part of CA or the home sale assistance company either to pay a commission or to continue this listing.”**", "“Computer Associates”", "“WRRI”"]}}