{"metadata": {"organization_names": [], "person_names_verified": ["fred waikuen", "fred waikuen cheung", "senshan yang", "waikuen cheung"], "organization_names_verified": ["guangzhou konzern medicine co., ltd.", "china medicine corporation"], "vars": {}, "entities_rejected": [], "person_names": [], "agreement_id": "e93ebaa76644165a95ee12c0b75c82cc77ca6150711c7e77d0391eeebfbea3f5", "topics": [], "terms": ["** As compensation for your services, you shall be paid an initial base annual salary at a gross rate of US$[[USD Value 1: Number]] The portion of such annual salary equal to RMB180,000 shall be payable by Guangzhou Konzern Medicine Co., Ltd. (“Konzern”), and the remainder by China Medicine Corporation. The annual compensation specified in this subsection (a), together with any modifications in such compensation that the Company may make from time to time, is referred to in this Agreement as “Base Salary**", "** For the term of your employment under this Agreement (your “Employment**”", "** I agree that during the periods of time during which I am restricted in taking certain actions by the terms of this Agreement (the “Restriction Period**”", "** I have attached hereto, as Exhibit A**", "** I represent that my performance of all the terms of this Agreement does not and will not breach any agreement I have entered into, or will enter into, with any third party, including without limitation any agreement to keep in confidence proprietary information or materials acquired by me in confidence or in trust prior to or during the Relationship. I will not disclose to the Company or use any inventions, confidential or non-public proprietary information or material belonging to any previous client, employer or any other party. I will not induce the Company to use any inventions, confidential or non-public proprietary information, or material belonging to any previous client, employer or any other party. I acknowledge and agree that I have listed on Exhibit A**", "** I understand that “**", "** I understand that “Confidential Information**”", "** If you and the Company extend your assignment beyond 1-year, you will be eligible to be considered for an annual incentive bonus each calendar year, beginning in the second year, during the term of your employment under this Agreement based upon the achievement of certain objective or subjective criteria established by the Company’s Board of Directors (the “Board**”", "** If, during the term of this Agreement, the Company terminates your Employment for any reason other than Cause, death or Permanent Disability, then, in addition to the amounts payable in accordance with Section 5(b), the Company shall pay you severance pay at a rate equal to your Base Salary in effect at the time of termination of your Employment for a period of 3 month(s) following the termination of your Employment (the “Continuation Period**”", "** In the event of the termination of the Relationship, I agree to sign and deliver the “**", "** Subject to the approval of the Board, the Company shall issue to you one hundred twenty thousand (120,000) shares of the Company's common stock (the “Stock**”", "** The effective date of this Agreement shall be [[Date 1]] (the “Effective Date**”", "** This Agreement shall be binding upon any successor (whether direct or indirect and whether by purchase, lease, merger, consolidation, liquidation or otherwise) to all or substantially all of the Company’s business and/or assets. For all purposes under this Agreement, the term “Company**”", "** This Agreement shall be interpreted in accordance with the laws of Hong Kong without giving effect to provisions governing the choice of law. If any provision of this Agreement becomes or is deemed invalid, illegal or unenforceable in any applicable jurisdiction by reason of the scope, extent or duration of its coverage, then such provision shall be deemed amended to the minimum extent necessary to conform to applicable law so as to be valid and enforceable or, if such provision cannot be so amended without materially altering the intention of the parties, then such provision shall be stricken and the remainder of this Agreement shall continue in full force and effect. If any provision of this Agreement is rendered illegal by any present or future statute, law, ordinance or regulation (collectively, the “Law**”", "** This Agreement will apply to my employment relationship with the Company. If that relationship ends and the Company, within a year thereafter, either reemploys me or engages me as a consultant, I agree that this Agreement will also apply to such later employment or consulting relationship, unless the Company and I otherwise agree in writing. Any such employment or consulting relationship between the Company and me, whether commenced prior to, upon or after the date of this Agreement, is referred to herein as the “Relationship**", "** Your acceptance of this offer and commencement of employment with the Company is contingent upon the execution, and delivery to an officer of the Company, of the Company’s Confidential Information and Invention Assignment Agreement, a copy of which is enclosed for your review and execution (the “Confidentiality Agreement**”", "**AND ORIGINAL WORKS OF AUTHORSHIP**", "**ATTACHMENT A**", "**Advice of Counsel****", "**Assignment of Company Inventions****", "**At-Will Relationship****", "**Attachment A**", "**Business Expenses****", "**CHINA MEDICINE CORPORATION**", "**CONFIDENTIAL INFORMATION AND**", "**Cash and Incentive Compensation****", "**Choice of Law and Severability**", "**Company Property; Returning Company Documents****", "**Company’s Successors**", "**Confidential Information**", "**Confidential Information****", "**Confidentiality Agreement**", "**Counterparts****", "**Definition of “Cause**", "**Definition of “Permanent Disability**", "**Duties and Scope of Employment****", "**Duties****", "**EMPLOYEE:**", "**EMPLOYMENT AGREEMENT**", "**EXCLUDED UNDER SECTION 4(a)**", "**EXHIBIT A**", "**EXHIBIT B**", "**Employees, Consultants****", "**Employment at Will****", "**Entire Agreement****", "**Exception to Assignments****", "**Facilitation of Agreement****", "**General Provisions****", "**General Release****", "**Governing Law****", "**INVENTION ASSIGNMENT AGREEMENT**", "**Incentive Bonuses**", "**Indemnification****", "**Inventions Retained and Licensed**", "**Inventions**", "**Issuance of Stock**", "**LIST OF PRIOR INVENTIONS**", "**Maintenance of Records****", "**Miscellaneous Provisions****", "**Modifications and Waivers****", "**No Assignment****", "**No Conflicting Obligations****", "**No Conflicts**", "**Notice to Third Parties**", "**Notice****", "**Obligations to the Company****", "**Other Parties****", "**Other Rights****", "**Ownership of Inventions****", "**Patent and Copyright Rights****", "**Position**", "**Pre-Employment Conditions****", "**Protection of Information****", "**Relationship**", "**Remedies****", "**Representations and Covenants****", "**Restrictions**", "**Right to Work****", "**Rights Upon Termination****", "**Salary**", "**Severability****", "**Severance Pay**", "**Solicitation of Employees, Consultants and Other Parties****", "**Stock**", "**Successors and Assigns****", "**Successors****", "**TERMINATION CERTIFICATION**", "**THE COMPANY:**", "**Term**", "**Termination Benefits****", "**Termination Certification**", "**Termination****", "**Third Party Information****", "**Use or Incorporation of Inventions****", "**Vacation/PTO and Employee Benefits****", "**Verification of Information****", "**Vesting**", "**Voluntary Execution****", "**Whole Agreement****", "**Withholding Taxes****", "**Your Successors****", "**” attached hereto as Exhibit B**", "**” means discoveries, developments, concepts, designs, ideas, know how, improvements, inventions, trade secrets and/or original works of authorship, whether or not patentable, copyrightable or otherwise legally protectable. I understand this includes, but is not limited to, any new product, machine, article of manufacture, biological material, method, procedure, process, technique, use, equipment, device, apparatus, system, compound, formulation, composition of matter, design or configuration of any kind, or any improvement thereon. I understand that “Company Inventions**”", "“**Agreement**”", "“**Cause**”", "“**Company**”", "“**Period**", "“**Start Date**”", "“Board**”", "“CFO”", "“Confidentiality Agreement**”", "“Continuation Period**”", "“Effective Date**”", "“Employment**”", "“Konzern”", "“Restriction Period**”", "“Stock**”", "”** For all purposes under this Agreement, “Permanent Disability**”"]}}