{"metadata": {"organization_names": [], "person_names_verified": [], "organization_names_verified": ["medi-physics inc", "medi-physics, inc.", "medi-physics, inc", "bms’s marketing and technical services", "bms, na", "bms and na", "bms to na", "bristol-myers squibb pharma company"], "vars": {"Party": {"Medi-Physics Inc., doing business as Amersham Health": "[[Party 1]]"}}, "entities_rejected": [], "person_names": [], "agreement_id": "e5aae442a086f4f3565f284059d2f9fd588733c4f4e22297100da584536a0eee", "topics": [], "terms": ["** (****", "** **", "** and ****", "** during the term of this Agreement, each ****", "** hour period outlined above, in the event that NA is required to find an alternate source of Product, BMS shall pay the difference between BMS’s price under this Agreement and the price NA is required to pay to obtain such Product, up to a limit of ****", "****", "**** (****", "**** are defined as those entities in which NA has at least a ****", "**** of NA’s requirements for Products and NA agrees to purchase ****", "**** source for supply of Mo-99, and that BMS is required to purchase ****", "****%. However, after ****", "****) hours delay, NA shall not be required to accept such Product and may make arrangements with BMS to return unopened Product for ****", "****, solely for unit dose preparation in ****", "****. Gallium Citrate Ga-67 Injection products shall be made available ****", "****. In the event BMS is unable to deliver all product requirements on a given day, BMS will allocate product to Nycomed in proportion to Nycomed’s share of total demand. In the event that delivery of a Product is delayed more than ****", "****BMS facility, Billerica, MA each ****", "**, to include the ****", "**AN UNREDACTED VERSION OF THIS DOCUMENT HAS ALSO BEEN PROVIDED TO THE SECURITIES AND EXCHANGE COMMISSION.**", "**BMS facility, Billerica, MA each day of manufacture. Days of manufacture of Tc-99m generators are currently **", "**CONFIDENTIAL TREATMENT REQUESTED**", "**INFORMATION FOR WHICH CONFIDENTIAL TREATMENT HAS BEEN REQUESTED IS OMITTED AND NOTED WITH “****”", "*,*", "*Force Majeure*", "“Agreement”", "“Annual Forecast”", "“BMS”", "“Disclosing Party”", "“FDA”", "“NA”", "“Product Information”", "“Products”", "“Proprietary Information”", "“Purchase Order”", "“Receiving Party”", "“Trademarks”", "“negotiation period”"]}}