{"metadata": {"organization_names": [], "person_names_verified": [], "organization_names_verified": ["alliant techsystems inc", "alliant techsystems inc."], "vars": {}, "entities_rejected": [], "person_names": ["lee hecht harrison"], "agreement_id": "70e47bc368d034f59ea586a848bde454858f81c645a6ecfe23b2c1f9f3b9c6e1", "topics": [], "terms": ["**ALLIANT TECHSYSTEMS INC. INCOME SECURITY PLAN**", "**ALLIANT TECHSYSTEMS INC.**", "**AND**", "**As Amended and Restated Effective [[Date 1]]**", "**CONTENTS**", "**Exhibit A**", "**GENERAL RELEASE OF CLAIMS**", "**INCOME SECURITY PLAN**", "**SEPARATION AGREEMENT**", "**Understanding and Acknowledgement****", "**[Form Agreement for Executive Severance Plan]**", "*Post Employment Restrictions.*", "*Severance Benefits. In exchange for the promises of this agreement, and after the applicable revocation period has ended, ATK will provide [employee name] with the severance benefits contained in the Executive Severance Plan and with any additional benefits identified in this Paragraph 2 (together referred to as “Severance Benefits”), provided that [employee name] has not revoked this General Release during the rescission period outlined in Paragraph 8 below.*", "*Termination of Employment.*", "*This General Release includes any rights or claims arising under any state human rights or fair employment practices act, or any other federal, state or local statute, ordinance, regulation or order regarding conditions of employment, compensation for employment, termination of employment, or discrimination or harassment in employment on the basis of age, gender, race, religion, disability, national origin, sexual orientation, or any other protected characteristic, and the common law of any state.*", "*[Employee name] agrees that this General Release extends to all claims, demands or causes of action which he/she may have against ATK which arose prior to [employee name]’s execution of this Agreement based upon statutory or common law claims for breach of contract, breach of employee handbooks or other policies, breach of promises, fraud, wrongful discharge,*", "*defamation, emotional distress, whistleblower claims, negligence, assault, battery, or any other theory, whether legal or equitable.*", "*understands that ATK does not decide whether a person is eligible for unemployment compensation benefits, or the amount of the benefit.*", "“ADA”", "“ADEA”", "“Agreement” or “General Release”", "“Company”", "“Company” or “ATK”", "“Corporate Transaction”", "“Date of Termination”", "“EEOC”", "“EIP”", "“ERISA”", "“Effective Date”", "“FMLA”", "“Incumbent Board”", "“NLRA”", "“Noncompetition Restricted Period”", "“Nonsolicitation Restricted Period”", "“OSHA”", "“OWBPA”", "“Parties”", "“Plan”", "“Release”", "“Selected Tier 2 Participants”", "“Severance Benefits”", "“Tax Advisor”", "“Title VII”", "“Total Payments”", "“Trust”", "“WARN”", "“[employee name]”", "“in lieu of” pay). [employee name]’s “in lieu of” pay will be subject to all applicable withholdings and will be taxable as payroll wages at the supplemental wage withholding rate. No 401(k) deductions will be taken from [employee name]’s “in lieu of” pay nor is it pensionable earnings (for example, it is not “Earnings” or “Recognized Compensation”"]}}