{"metadata": {"organization_names": [], "person_names_verified": ["caroline peyton", "dennnis j. allingham", "james hall", "dennis j. allingham", "larry hiebert", "tim palmer"], "organization_names_verified": ["wells fargo & company", "m&i bank", "landec corporation", "m&i marshall & ilsley bank", "landec ag", "lifecore biomedical, inc.", "cal ex trading company", "the lifecore biomedical, inc.", "telecopier signatory", "warburg pincus"], "vars": {"Party": {"Lifecore Biomedical, LLC": "[[Party 1]]", "Wells Fargo Bank": "[[Party 2]]"}}, "entities_rejected": [], "person_names": ["lyman boulevard"], "agreement_id": "e31bf97851a51cebb41aa29a4bd3fcd803580938f92f86c527d6cc255a1f4ad5", "topics": [], "terms": ["***Governing Law***", "***Submission to Jurisdiction***", "***Waiver of Jury Trial***", "**Amount and Terms of the Term Loan**", "**Application of Payments**", "**Conditions of Lending**", "**Covenants**", "**Credit Agreement**", "**Daily Three Month LIBOR Rate**", "**Default Interest**", "**Definitions**", "**Determine**", "**Each of Borrower and Bank, to the fullest extent permitted by applicable law, hereby irrevocably waives all right to a trail by jury in any action, proceeding, counterclaim or other litigation in any way arising out of or relating to this Agreement, any other of the Loan Documents or any of the transactions or events referenced herein or therein or contemplated hereby or thereby, whether with respect to contract claims, tort claims or otherwise. This waiver shall apply to any subsequent amendments, renewals, supplements or modifications to this Agreement or any other of the Loan Documents. A copy of this Section 8.17 may be filed with any court as written evidence of the waiver of the right to trial by jury and the consent to trial by court.**", "**Events of Default, Rights and Remedies**", "**Governing Law**", "**Interest**", "**LIBOR**", "**Miscellaneous**", "**Obligations Joint and Several**", "**Payment of Interest**", "**Prepayment**", "**Recitals**", "**Remedies**", "**Repayment**", "**Representations and Warranties**", "**Security Interest; Guaranties**", "**Selection of Interest Rate Options**", "**Subject to Section 8.17: (i) any legal action or proceeding with respect to this Agreement or any other Loan Document may be brought solely in the courts of the state of California or of the United States for the Northern District of California, and, by execution and delivery hereof, each of Borrower and Bank consents, for itself and in respect of its property, to the jurisdiction of those courts; (ii) each of Borrower and Bank irrevocably waives any objection, including any objection to the laying of venue or based on the grounds of forum non conveniens, which it may now or hereafter have to the bringing of any action or proceeding in such jurisdiction in respect of this agreement or any document related hereto. Each of Borrower and Bank waives personal service of any summons, complaint or other process, which may be made by any other means permitted by California law.**", "**Submission to Jurisdiction**", "**Subtract**", "**Table of Contents**", "**Table of Exhibits and Schedules**", "**Taxes and Regulatory Costs**", "**This Agreement and the other loan documents (except as otherwise specified therein), and the rights and duties of the parties hereto, shall be construed and determined in accordance with the internal laws of the State of California****", "**Waiver of Jury Trial**", "**excluding, however**", "’ acceptances are fully insured by the Federal Deposit Insurance Corporation) (each of the foregoing, collectively, “Cash Equivalents”", "“AAA”", "“Agreement”", "“Bank”", "“Borrower”", "“Collateral Account”", "“Commitment”, and the term loan made pursuant thereto being referred to herein as the “Loan”", "“Default Interest”", "“Guaranty” and collectively the “Guaranties”", "“Indemnitees”", "“Licensed Intellectual Property”", "“Note”", "“Off-the-shelf Software”", "“Owned Intellectual Property”", "“Security Interest”"]}}