{"metadata": {"organization_names": [], "person_names_verified": ["arthur hsieh", "luna hansen"], "organization_names_verified": ["hansen indemnitees", "silicon valley bank", "luna technologies inc", "hansen to luna innovations inc.", "luna products", "luna innovations inc.", "intuitive surgical, inc.", "hansen inc.", "luna technologies"], "topics": [], "entities_rejected": [], "person_names": ["hansen and", "hansen luna", "luna indemnitees"], "agreement_id": "364e1232636c419a86de39cde01d08d771a16cbeb1378455accd665ed38d4d51", "vars": {"Party": {"Hansen Medical": "[[Party 1]]"}}, "terms": ["** For a period of [**", "** Hansen shall own all patent rights to any New Inventions that Hansen and Luna jointly develop, make, conceive or reduce to practice (i.e., an employee or consultant of each of Hansen and Luna is an “inventor” thereof under applicable patent law) (to the extent any patent application is filed thereon, together with any patents issuing thereon and other patent rights arising therefrom or claiming priority thereto, a “Joint Patent**”", "** Luna shall own all patent rights to any New Inventions that Luna solely develops, makes, conceives or reduces to practice (i.e., no employee or consultant of Hansen is an “inventor” thereof under applicable patent law). Luna shall have the sole right to file any patent application on any such New Invention and to control the prosecution and enforcement thereof, subject to the provisions below. The Parties acknowledge that any such New Inventions are subject to the applicable terms and conditions of the License Agreement and the Intuitive-Luna License, to the extent applicable to such New Inventions (including Sections 5.1 and 5.2 of the License Agreement, but without limiting the additional terms and conditions regarding patent prosecution and enforcement below, and including in any event the inclusion of such New Inventions and Intellectual Property Rights therein or thereto within the Licensed IP licensed to Hansen under the License Agreement). Luna shall promptly notify Hansen in writing of any such New Inventions within thirty (30) days of documenting same. Upon Hansen’s reasonable request, Hansen shall have the right to review and provide input on all patent filings and responses regarding the New Inventions prior to their filing or submission with any applicable patent office. Prior to dropping prosecution of any claim within any patent applications on any New Inventions, Luna shall notify Hansen thereof and Hansen, at is option, shall have the right to continue the prosecution of such claim and Luna shall provide Hansen reasonable cooperation and assistance in connection therewith. Hansen shall have the sole and exclusive right to enforce any patents on New Inventions with respect to any infringement or alleged infringement thereof in the [****", "** [****", "****", "****. [****", "****] Field and the [**", "****] and fails to cure such breach in accordance with this Agreement within sixty (60) days after receipt of the initial notification by Hansen of such breach or such longer period of time as provided in this Agreement; and (c) [****", "****] anniversary of the Effective Date and continuing thereafter, [****", "****] days after an arbitrator is selected (or appointed, as the case may be), each Party will deliver to both the arbitrator and the other Party a memorandum (the “**", "****] days after first providing to Luna Hansen’s proposed modifications to the Development Plan and/or the Development Milestones in accordance with the foregoing, Hansen may formally propose a final modified Development Plan and/or modified Development Milestones by providing a copy thereof to Luna. Luna shall thereupon have [****", "****] days from the date Luna delivers Luna Product to the delivery location specified in the applicable purchase order. Hansen shall have [****", "****] days of this Section being invoked, the Parties shall request that [****", "****] years after the Effective Date, in the event that (i) Hansen elects to [****", "****]. The Luna Product Deposit Materials shall be released to Hansen in the event any of the following occurs (but not in any other case): (i) refusal of Luna to perform continued development, maintenance, upgrading and support of the software within the Luna Product Deposit Materials under Luna’s standard rates and under other reasonable and customary terms (it being understood that Luna has no obligation to do so hereunder outside of the Development Program) or failure of Luna to provide such services after agreeing to do so (following notice and an opportunity to cure such failure within [**", "**.**", "**10.4.1 Choice of Law****", "**10.4.2 Bankruptcy Court Jurisdiction****", "**10.4.3 Exceptions to Bankruptcy Court Jurisdiction****", "**10.4.4 Alternative Dispute Resolution****", "**10.4.5 Consent to Jurisdiction****", "**10.4.6 Resolving Conflicts****", "**10.4.7 Miscellaneous****", "**2.2.1**", "**2.2.2**", "**2.2.3**", "**2.2.4**", "**2.4.1**", "**2.4.2**", "**2.4.3**", "**2.4.4**", "**2.5.1**", "**2.5.2**", "**2.5.3**", "**3.3.1 Commercial Supply Agreement**", "**3.3.2 Commercial Transfer Price**", "**3.3.3 Quality Agreement****", "**3.3.4 Advance Requirements Forecasts****", "**3.3.5**", "**3.3.6 Other Provisions**", "**3.8.1**", "**3.8.2 Non-Robotic Medical Field Outside Orthopedics, Endoluminal or Vascular**", "**4.1.1**", "**4.1.2 Invoicing and Payment**", "**4.1.3**", "**4.1.4**", "**5.2.1 Hansen Inventions****", "**5.2.2 Joint Inventions**", "**5.2.3 Luna Inventions**", "**5.2.4 Patent Ownership**", "**5.2.5**", "**5.2.6 Retained Rights****", "**6.1.1**", "**6.1.2**", "**6.2.1**", "**6.2.2**", "**6.2.3**", "**6.2.4**", "**6.2.5**", "**AGREEMENT**", "**AMENDMENT NO. 1 TO**", "**AMENDMENT NO. 2 TO**", "**AMENDMENT**", "**CONFIDENTIAL TREATMENT REQUESTED**", "**DEVELOPMENT AND SUPPLY AGREEMENT**", "**Development Milestones**", "**Development Plan**", "**Exhibit A**", "**Exhibit B**", "**Fields****", "**IN WITNESS WHEREOF**", "**LUNA INNOVATIONS INCORPORATED**", "**LUNA TECHNOLOGIES, INC.**", "**NOW, THEREFORE**", "**RECITALS**", "**WHEREAS**", "**[******", "**] (or such other escrow company, if any) for the establishment and maintenance of such escrow arrangement shall be borne and paid by Hansen, except that Luna shall pay any annual escrow maintenance fees of [****", "**] (or, if [****", "**] **", "**] Fees**”", "**] Field**”", "**] Milestones**”", "**] Price**”", "**] Product**”", "**] day period specified above, the Parties shall discuss in good faith for a period of at least [****", "**] day period, Hansen shall have the right at any time after such [****", "**] days after first providing to Hansen Luna’s proposed modifications to the Development Plan and/or the Development Milestones in accordance with the foregoing, Luna may formally propose a final modified Development Plan and/or modified Development Milestones by providing a copy thereof to Hansen. Hansen shall thereupon have [**", "**] days after such agreement is entered into. In the event the Parties fail to execute such escrow agreement within [****", "**] days following the Effective Date, the Parties shall negotiate and enter into an escrow agreement between the Parties and [****", "**] days, then either Party may initiate resolution of the matter in accordance with the following expedited dispute resolution process (which shall be the exclusive dispute resolution process for any such dispute, except for, to the extent applicable, the dispute process described in the Amended Plan). Upon either Party’s request at such point, the Parties shall submit such dispute to arbitration proceedings under the Comprehensive Arbitration Rules and Procedures of [****", "**] for Hansen and [**", "**], Luna shall not have the right to terminate this Agreement unless and until it is finally determined, in accordance with Section 2.6 (or the other applicable dispute resolution provisions of this Agreement) that Hansen is obligated to [**", "**], and (iii) a delivery location. Upon receipt of any such conforming purchase order, Luna shall manufacture and supply Luna Product in accordance therewith. Any term in such purchase order that is inconsistent with this Agreement shall not be binding upon Luna; otherwise Luna shall send a confirmation to Hansen within [****", "**”) in support of its position with respect to the dispute (including any data or information in support thereof). Within [**", "*, no. 07-088551, in the Superior Court of the State of California, County of Santa Clara relating to certain disputes arising out of those certain Terms and Conditions of Sale and Service executed by Hansen on [[Date 1: Date]] and Luna on [[Date 2: Date]] and that certain Mutual Nondisclosure Agreement between Hansen and Luna dated [[Date 3: Date]] (the “**", "*Signature Page to Follow*", "’ fees and witness fees) (collectively, “**Losses**”", "’ or agents’", "’s option) include the right for Hansen to be included as a third party beneficiary to such agreement. All such proposed third party manufacturers and agreements shall be subject to Hansen’s review and prior written consent before Luna may use, or validly conclude an agreement engaging, any third party manufacturer for Luna Products, and Luna acknowledges that Hansen may reasonably condition or withhold its consent thereto on a case-by-case basis. This Section 3.1 shall not prevent Luna from including components in Luna Products purchased from third parties, subject to Section 5.3. The Parties shall appoint project managers for purposes of the manufacture and supply arrangements set forth in this Article 3 with similar roles and authorities as the Project Managers described in Section 2.3 with respect to the Development Program. For the avoidance of doubt, the manufacture and supply provisions in this Article 3 shall also include Luna Products that Hansen desires to order for its Subsidiaries and permitted sublicensees, and the provisions above and below in this Article 3 shall be interpreted to allow for the purchasing of Luna Products from Luna by or for such Subsidiaries and sublicensees, as may be directed by Hansen from time to time. Except to the extent expressly provided for in Section 3.3.5 and 3.8, nothing in this Agreement shall be construed (a) as imposing any requirement on Hansen (or its designees) to order or purchase Products or any other products in any quantity from Luna or (b) to limit Hansen’s (or its designees’", "“**Additional Performance Period**”", "“**Affiliates**”", "“**Agreement**”", "“**Amended Plan**”", "“**Amendment**”", "“**Applicable Laws**”", "“**Bankruptcy Court**”", "“**Blockage Period**”", "“**Budget Cap**”", "“**Chapter 11 Case**”", "“**Commercial Supply Agreement**”", "“**Commercial Transfer Price**”", "“**Confidential Information**”", "“**Confirmation Order**”", "“**Deferred Payment**”", "“**Development Plan**”", "“**Development Program**”", "“**Development Transfer Price” means [****", "“**Discloser**”", "“**Effective Date**”", "“**End Product**”", "“**Fiber Optic Shape Sensing/Localization Technology**”", "“**Hansen Indemnitees**”", "“**Hansen Licensed IP**”", "“**Hansen**”", "“**Holdback Amount**”", "“**Indemnifying Party**”", "“**Intellectual Property Rights**”", "“**Interrogator**”", "“**Intuitive-Luna License**”", "“**Joint Patents**”", "“**License Agreement**”", "“**Licensed IP**”", "“**Licensed Patent**”", "“**Litigation**”", "“**Losses**”", "“**Luna Indemnitees**”", "“**Luna Product Deposit Materials**”", "“**Luna Product**”", "“**Luna**”", "“**New Inventions**”", "“**Parties**”", "“**Party**”", "“**Product**”", "“**Project Manager**”", "“**Promissory Note**”", "“**Recipient**”", "“**Section 365(n) Contract**”", "“**Sensor**”", "“**Settlement Agreement**”", "“**Settlement Documents**”", "“**Specifications**”", "“**Subordination Agreement**”", "“**Subsidiaries**”", "“**Support Memorandum**”", "“**Technology Deposit Materials**”", "“**Technology**”", "“**Third Party Claim**”", "“**Third Party Technology**”"]}}