{"metadata": {"organization_names": [], "person_names_verified": [], "organization_names_verified": ["qlt ophthalmics inc.", "qlt ophthalmics inc", "qlt ophthalmics, inc.", "amerisourcebergen specialty group", "besse medical", "abbott laboratories", "qlt inc.", "qlt ophthalmics"], "vars": {"Party": {"Hamilton Court": "[[Party 1]]", "ASD Specialty Healthcare, Inc.": "[[Party 2]]"}}, "entities_rejected": [], "person_names": [], "agreement_id": "27d8981d3a1c2af2a7ae230b3148d41ca8146a795988196a826cc47fa096b3ce", "topics": [], "terms": ["**    **", "** (the “**", "** ***", "** Agreement attached hereto as Exhibit E (the “**", "** Agreement by and between **", "** Agreement) such that Non-Federal and Federal Contract Price Customers receive the Contract Price set forth in this Agreement. Due to the quality of data received and the limitations inherent in QLT’s systems, however, QLT cannot guarantee that all such Chargeback information will be applied against this Agreement. Without limiting the foregoing, in the event that **", "** Agreement, and QLT shall **", "** Damage or Loss claims will be **", "** after a party receives notice of such termination from the terminating party, QLT may promptly **", "** after a party receives notice of such termination from the terminating party, QLT shall promptly **", "** amounts set forth in this Section 5 with respect to Product shipped under QLT’s PAP pursuant to Section 4.11 of this Agreement to the same extent QLT pays the **", "** and complete the report within **", "** and not more than **", "** and shall be subject to change without notice **", "** and will be **", "** as **", "** as demonstrated by **", "** available to any other customer or customer segment or group. Moreover, QLT takes exception to and rejects any purported requirement in any document furnished to QLT by Distributor that **", "** contained in the **", "** described in this Agreement (including but not limited to, **", "** described in this Agreement constitute **", "** in a manner **", "** must occur within **", "** of incoming calls in **", "** of receipt of the invoice covering such charges. In the absence of any such notice of dispute, all invoices will be deemed to be correct and due in full per the payment terms above. A late fee of **", "** of such independent accountant **", "** of the Term (as such term is defined in Section 21 below)) as a result of any **", "** of the date of the invoice and shall be payable by electronic funds transfer. Distributor shall be entitled to a **", "** of the end **", "** on normal and customary orders shipped via regular methods directly to Distributor’s designated warehouse. Notwithstanding the foregoing, where the Distributor **", "** or any other **", "** or otherwise affected by **", "** or that **", "** providing the services described in this Section 5 **", "** regarding an adverse event or complaint about the product. The **", "** rolling forecast of projected purchases of the Product and Kits on or before the **", "** set forth in this Section 5. Payment of undisputed amounts shall be due within **", "** that Distributor must submit to QLT **", "** the Chargeback will be processed **", "** time period, provided that Distributor can substantiate its claim for resubmission. QLT shall pay all submitted Chargebacks that are applied against this Agreement as provided in this Section 4.6 within **", "** to QLT in order to trend sales and to facilitate processes such as sales incentives and commissions to QLT Sales representatives. Distributor will provide **", "** to the destination specified by Distributor from whichever warehouse is the shipping origin selected by QLT. In all cases, title to Products and Kits purchased by Distributor and risk of loss and damages to Products shipped by QLT will pass to Distributor upon **", "** to the extent necessary so that **", "** unless **", "** unless required by federal law or regulation to **", "** were negotiated in good faith and at arms’ length. Distributor agrees that it **", "** will be charged to and borne by **", "** with respect to **", "** within the database **", "***", "**, QLT agrees that it will **", "**, in assisting it to determine whether or not a Customer meets the requirements of this Agreement. No entity shall be added as an Approved Customer unless and until QLT so notifies Distributor. QLT may revoke its acceptance of any Customer by notifying Distributor. If QLT approves the addition of a Customer, any Contract Price for such new Approved Customer will become effective no later than **", "**, that is **", "**, then Distributor may, within sixty (60) days of receipt of such notice, **", "**. A late fee of **", "**. All **", "**. Distributor shall retain documentation of **", "**. Distributor will provide a full and detailed written report within **", "**. Furthermore, nothing herein shall prevent Distributor or its affiliates from **", "**. However, except as expressly provided in this Section 2.3, any **", "**. If Distributor so notifies QLT of any **", "**. If the parties do not agree upon **", "**. It is agreed and understood that if **", "**. No such **", "**. Notwithstanding Section 4.8, the practitioner receiving the Product pursuant to the PAP shall be considered an “Approved Customer” hereunder solely for purposes of the PAP, **", "**. Once QLT has **", "**. QLT acknowledges that the Products are **", "**. QLT shall give Distributor timely **", "**. QLT will not **", "**. QLT’s primary contact to Distributor for this Agreement shall be **", "**. Such customer may include specialty pharmacies and other entities approved by QLT from time to time. The **", "**. Such submission shall be made on a **", "**. The **", "**. The services provided by Distributor will include **", "**. The services provided by Distributor with respect to QLT’s PAP shall include **", "**. Within **", "**15.1.1**", "**15.1.2**", "**15.1.3**", "**15.1.4**", "**15.1.5**", "**15.1.6**", "**15.2.1**", "**15.2.2**", "**15.2.3**", "**15.2.4**", "**15.2.5**", "**15.2.6**", "**15.2.7 EXCEPT AS PROVIDED ABOVE OR IN THE [*", "**18.3.1**", "**18.3.2**", "**18.3.3**", "**21.5.1**", "**21.5.2**", "**4.1.1**", "**4.1.2**", "**4.1.3**", "**4.7.1**", "**5.1.1**", "**5.1.2**", "**5.1.3**", "**5.1.4**", "**5.1.5**", "**5.1.6**", "**; provided however, that Distributor may resubmit disputed Chargeback to QLT within **", "**All Non Federal Contract Price Customers are entitled to receive the following Contract Price discount referenced in Table A-1 below.**", "**Approved Customers**", "**Contract Prices**", "**D/B/A BESSE MEDICAL**", "**DISTRIBUTION SERVICES AGREEMENT**", "**Discounts**", "**EXHIBIT A**", "**EXHIBIT B**", "**EXHIBIT C**", "**EXHIBIT D**", "**EXHIBIT E**", "**Exhibit F**", "**QLT OPHTHALMICS, INC.**", "**QLT Ophthalmics, Inc. Returns Policy Effective 1/1/2010**", "**QLT Ophthalmics, Inc.**", "**QLT may change, at any time, the [*", "**[*", "*] insurance for in transit damages to or losses of Products and Kits shipped hereunder (each a “**", "*] shall be responsible for all Chargebacks and returns of Product arising from sales to Non-Federal or Federal Contract Price Customers in accordance with Sections 4.6 and 9, **", "*] shall mean the **", "*]**", "*]**”", "*]. If in any **", "’ fees) and liabilities or losses (“Claims”", "“**[*]** Agreement”", "“**[*]** Damage or Loss”", "“**[*]**”", "“Agreement”", "“Discoverable Defects”", "“Distributor”", "“EXCEL”", "“Effective Date”", "“Excel”", "“Government Agency”", "“HIPAA”", "“Hidden Defects”", "“Indemnified Claims”", "“Indemnified Person”", "“Indemnifying Person”", "“NDA”", "“PAP Provider”", "“PAP”", "“PO”", "“Product”", "“QLT”", "“SEC”", "“SOP”", "“Term”", "“Visudyne Program Manager”"]}}