{"metadata": {"organization_names": [], "person_names_verified": ["adam heller", "david fay", "scott kauffman", "jason l. baird"], "organization_names_verified": ["geeknet inc.", "geeknet", "geeknet, inc."], "topics": [], "entities_rejected": [], "person_names": ["townshend estate"], "agreement_id": "ac32683741c93897956a799c8c039f830ea54e07a63e1b93dbf3e378a0acfe23", "vars": {"Party": {"JASON BAIRD": "[[Party 1]]"}}, "terms": ["***EXECUTIVE IS WAIVING EXECUTIVE’S RIGHT TO A JURY TRIAL***", "**-**", "**Accelerated Vesting**", "**Acceptance**", "**Accordingly, except as provided by the Act and this Agreement, neither Executive nor the Company will be permitted to pursue court action regarding claims that are subject to arbitration**", "**Additional Requirements**", "**Administrative Relief**", "**Amendment to the [[Date 1]] Offer Letter (“Amendment”)**", "**Amendment**", "**Annual Base Salary**", "**Arbitration**", "**Arbitration.**", "**At Will Employment**", "**At-Will Employment**", "**Base Salary**", "**Benefit Plans**", "**Cause**", "**Change of Control**", "**Choice of Law**", "**Compensation**", "**Constructive Termination**", "**Continued Employee Benefits**", "**Counterparts**", "**Definition of Terms**", "**Disability**", "**Discretionary Bonus**", "**Discretionary Bonus:**", "**Dispute Resolution**", "**Disputes that Executive agrees to arbitrate, and thereby agrees to waive any right to a trial by jury, include any statutory claims under local, state, or federal law**", "**Duties and Scope of Employment**", "**EMPLOYMENT AGREEMENT**", "**Effectiveness of Offer**", "**Employee Benefits**", "**Entire Agreement**", "**Equity**", "**Exclusive Remedy**", "**Executive’s Successors**", "**Expenses**", "**GEEKNET, INC.**", "**Geeknet, Inc.**", "**General**", "**Headings**", "**Limitation on Payments**", "**Miscellaneous Provisions**", "**No Duty to Mitigate**", "**Notice of Termination**", "**Notice**", "**Obligations**", "**Other Benefits**", "**Position and Duties**", "**Post-Termination Exercise Period**", "**Procedure**", "**Remedy**", "**Section 409A Limit**", "**Section 409A**", "**Separation and Release of Claims Agreement**", "**Severability**", "**Severance Benefits**", "**Severance Payment**", "**Stock Option Plan**", "**Successors**", "**Termination for Cause**", "**Termination for other than Cause, Death or Disability Prior to a Change of Control or after Twelve Months Following a Change of Control**", "**Termination for other than Cause, Death or Disability or Constructive Termination Within Twelve Months Following a Change of Control**", "**The Company’s Successors**", "**Timeline:**", "**Timing of Severance Payments**", "**Vacation**", "**Voluntary Nature of Agreement**", "**Voluntary Resignation; Termination due to Death or Disability**", "**Waiver**", "**Withholding**", "**[[Date 1]]**", "’s eligible dependents), or (ii) providing coverage under a separate plan or plans providing coverage that is sufficient to provide Executive and Executive’s eligible dependents with equivalent coverage that is reasonably available to Executive and/or Executive’s eligible dependents.    (b) **Cause**. “Cause” is defined as a determination by the Company of any of the following: (i) any material act of personal dishonesty involving Executive in connection with Executive’s material responsibilities as an employee of the Company which results in harm to the Company; (ii) Executive’s conviction of, or plea of guilty or nolo contendere to, a felony; (iii) a willful act by Executive which constitutes gross misconduct and which is injurious to the Company; (iv) continued violations by Executive of Executive’s obligations as an employee of the Company which are demonstrably willful and deliberate on Executive’s part after there has been delivered to Executive a written demand for performance from the Company which describes the basis for the Company's belief that Executive has not substantially performed Executive’s duties (unless such violation by its nature cannot be cured, in which case notice and an opportunity to cure shall not be required); or (v) Executive’s arrest for any crime involving fraud, embezzlement or any other act of moral turpitude.      (c) **Change of Control**. “Change of Control” means the occurrence of any of the following events:    (i) the acquisition by any one person, or more than one person acting as a group (for these purposes, persons will be considered to be acting as a group if they are owners of a corporation that enters into a merger, consolidation, purchase or acquisition of stock, or similar business transaction with the Company), (“Person”", "’s termination for Cause), and (iii) Executive will not be entitled to receive severance or other benefits except for those benefits (if any) which do not concern acceleration of Award vesting or severance pay based on termination of employment as may then be established under other Company policies or programs, if any.    (g) **Exclusive Remedy**. In the event of a termination of Executive’s employment with the Company (or any parent or subsidiary of the Company), the provisions of this Section 7 are intended to be and are exclusive and in lieu of any other rights or remedies to which Executive or the Company may otherwise be entitled, whether at law, tort or contract, in equity, or under this Agreement. Executive will be entitled to no severance or other benefits upon termination of employment with respect to acceleration of Award vesting or severance pay other than those benefits expressly set forth in this Section 7.      (h) **Section 409A**.   (i) Notwithstanding anything to the contrary in this Agreement, if Executive is a “specified employee” within the meaning of Section 409A at the time of Executive’s termination, then, if required, the severance and benefits payable to Executive pursuant to this Agreement (other than due to death), if any, and any other severance payments or separation benefits which may be considered deferred compensation under Section 409A (together, the “Deferred Compensation Separation Benefits”", "’s termination) and (B) Executive’s quarterly bonus under the Company’s Named Executive Officer Bonus Policy and Plan for the entire quarter in which such termination occurred based on the achievement of the performance goals under such plan and the quarterly bonus that would have otherwise been earned.    (ii) **Post-Termination Exercise Period**. Executive’s outstanding Awards will remain exercisable for at least ninety (90) days following the date of such termination or such longer period as prescribed in the respective stock plan and agreement for each Award. Notwithstanding the foregoing, in no event may the Award be exercised after its expiration date as provided in the respective agreement for each Award.      (iii) **Continued Employee Benefits**. Executive will receive Company-paid coverage for a period of three (3) months for the cost of continuation coverage for Executive and Executive’s eligible dependents under the Company’s Benefit Plans.    (b) **Termination for other than Cause, Death or Disability or Constructive Termination Within Twelve Months Following a Change of Control**. If within twelve (12) months following a Change of Control, (i) the Company (or any parent or subsidiary of the Company) terminates Executive’s employment other than for Cause, death or Disability, or (ii) upon Executive’s Constructive Termination with the Company (or any parent or subsidiary of the Company), then, subject to Section 7(c) below, Executive will receive the following severance from the Company:    (i) **Severance Payment**. Executive will receive: (A) continuing payments of severance pay (less applicable withholding taxes) for a period of six (6) months from the date of such termination equal to the pro-rata portion of Executive’s Base Salary (as in effect immediately prior to Executive’s termination) and (B) Executive’s quarterly bonus under the Company’s Named Executive Officer Bonus Policy and Plan for the entire quarter in which such termination occurred based on the achievement of performance goals under such plan and the quarterly bonus that would have otherwise been earned.    (ii) **Accelerated Vesting**. If Executive holds unvested Awards, then the unvested portion of each Award that would normally vest over the six (6) months following termination will immediately vest and become exercisable. The Awards will remain exercisable, to the extent applicable, following the termination for the period prescribed in the respective stock plan and agreement for each Award.    (iii) **Post-Termination Exercise Period**. Executive’s outstanding Awards will remain exercisable for at least ninety (90) days following the date of such termination or such longer period as prescribed in the respective stock plan and agreement for each Award. Notwithstanding the foregoing, in no event may the Award be exercised after its expiration date as provided in the respective agreement for each Award.    (iv) **Continued Employee Benefits**. Executive will receive Company-paid coverage for a period of six (6) months for the cost of continuation coverage for Executive and Executive’s eligible dependents under the Company’s Benefit Plans.    (c) **Separation and Release of Claims Agreement**. The receipt of any severance payments or benefits pursuant to this Agreement is subject to the Executive signing and not revoking a separation and release of claims agreement in a form reasonably acceptable to the Company (the “Release”", "“Act”", "“Agreement”", "“Amendment”", "“Awards”", "“Base Salary”", "“CEO”", "“COBRA”", "“Code”", "“Company”", "“Effective Date”", "“Executive”", "“Firm”", "“JAMS Rules”", "“JAMS”", "“Offer Letter”", "“Option”", "“Release Deadline”", "“Voting Securities”"]}}