{"metadata": {"organization_names": [], "person_names_verified": ["cheston j. larson"], "organization_names_verified": ["orexigen therapeutics inc", "patheon inc", "patheon pharmaceuticals inc", "patheon pharmaceuticals inc.", "latham & watkins", "orexigen therapeutics, inc.", "patheon inc.", "patheon pharmaceuticals", "patheon"], "vars": {}, "entities_rejected": [], "person_names": [], "agreement_id": "2955de3fa0a030a632ae633447497ae517195921152d6a126c2d8f7b39bc0421", "topics": [], "terms": ["* *", "* **", "**      \\centered **", "**(“Client Property”**", "***", "***] Business Days after a party requests under Section 12.2 that an expert be appointed to resolve a Technical Dispute, the parties will jointly appoint a mutually acceptable expert with experience and expertise in the subject matter of the dispute. If the parties are unable to so agree within the [*", "***] Business Days from receipt of the notice of dispute, a single representative having full power and authority to solve the dispute. The representatives will meet as necessary in order to resolve the dispute. If the representatives fail to resolve the matter within [*", "***] before the scheduled production date, Client will deliver the Active Materials to the Manufacturing Site DDP (Incoterms 2000) sufficient for Patheon to manufacture the desired quantities of Product on the requested delivery date. If the Active Materials are not received [*", "***] contemplated in the most recent forecast given by Client under Section 5.1(a). Patheon may make other purchases of Components to meet Manufacturing Services requirements for longer periods if agreed to in writing by the parties. The Client will give Patheon written authorization to order Components for any launch quantities of Product requested by Client which will be considered a Firm Order when accepted by Patheon. If Components ordered by Patheon under Firm Orders or this Section 5.3 are not included in finished Products manufactured for Client within [*", "***] day of [*", "***] days after [*", "***] days of the date of confirmed facsimile or email transmission of the invoice. In the event that Client disputes any amounts under any invoice, such dispute will be resolved in accordance with Section 6.1 (with respect to non-conformance of Products) or otherwise under Article 12. Pending resolution of such dispute, Client will be obligated to pay any amounts under such invoice that are not in dispute. Upon resolution of any such dispute in favor of Patheon, the Client will pay all remaining amounts owing under such invoice within the later of (i) [*", "***] efforts to mitigate the effects of the claim; (c) reasonably cooperate with the Indemnitor in the defense of the claim; and (d) permit the Indemnitor to control the defense and settlement of the claim, with counsel reasonably satisfactory to the Indemnitee, all at the Indemnitor’s cost and expense. If the Indemnitor assumes the defense of the claim, the Indemnitee may participate in such defense with the Indemnitee’s own counsel who will be retained, at the Indemnitee’s sole cost and expense; provided, however, that neither the Indemnitor nor the Indemnitee will consent to the entry of any judgment or enter into any settlement with respect to the claim without the prior written consent of the other party, which consent will not be unreasonably withheld or delayed. If the Indemnitee withholds consent in respect of a judgment or settlement involving only the payment of money by the Indemnitor and which would not involve any stipulation or admission of liability or result in the Indemnitee becoming subject to injunctive relief or other relief, the Indemnitor will have the right, upon written notice to the Indemnitee within [*", "***] efforts to replace such Recalled or returned Products with conforming Products within [*", "***] efforts, at its own expense, to remove from Patheon site(s), within [*", "***] following the date of Product expiry, or longer if required by law, at which time Client will be contacted concerning the delivery and destruction of the documents and/or samples of Products; provided that Patheon has first given Client [*", "***] for each occurrence for personal injury or property damage liability; and (ii) $[*", "**ACCESS.**", "**ACTIVE MATERIAL YIELD.**", "**ACTIVE MATERIALS**", "**ACTIVE MATERIALS.**", "**ADDITIONAL PRODUCT.**", "**ADJUSTMENTS DUE TO TECHNICAL CHANGES.**", "**ASSIGNMENT.**", "**AUDIT.**", "**AUTHORITY.**", "**Access.**", "**Active Material Yield.**", "**Active Materials.**", "**Additional Product.**", "**Adjustments Due to Technical Changes.**", "**Appointment of Expert**", "**Appointment**", "**Assignment.**", "**Audit.**", "**Authority.**", "**BOOKS AND RECORDS.**", "**Books and Records.**", "**CLIENT TERMINATION.**", "**CLIENT WARRANTIES.**", "**CLIENT.**", "**CLIENT’S OBLIGATIONS**", "**CO-OPERATION**", "**COMMERCIAL DISPUTES.**", "**CONFIDENTIAL TREATMENT.**", "**CONFIDENTIALITY**", "**CONFIDENTIALITY.**", "**CONSEQUENTIAL DAMAGES.**", "**CONVERSION FEES AND COMPONENT COSTS**", "**CURRENCY.**", "**Capital Requirements**", "**Casualty Losses**", "**Client Termination**", "**Client Warranties.**", "**Client.**", "**Commercial Disputes.**", "**Confidential Treatment.**", "**Confidentiality.**", "**Conflicts of Interest**", "**Consequential Damages.**", "**Credit for Shortfall**", "**Currency.**", "**DEBARRED PERSONS.**", "**DEFINITIONS.**", "**DISPOSITION OF DEFECTIVE OR RECALLED PRODUCTS.**", "**DISPUTE RESOLUTION**", "**Debarred Persons.**", "**Definitions.**", "**Delays**", "**Disposition of Defective or Recalled Products****", "**ENTIRE AGREEMENT.**", "**EXCEPT AS SET FORTH IN THIS SECTION 9, NEITHER PARTY MAKES ANY WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, BY FACT OR LAW, OTHER THAN THOSE EXPRESSLY SET FORTH IN THIS AGREEMENT. PATHEON MAKES NO WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR WARRANTY OF MERCHANTABILITY FOR THE PRODUCTS.**", "**EXECUTION IN COUNTERPARTS.**", "**Entire Agreement.**", "**Execution in Counterparts.**", "**FDA FILINGS.**", "**FDA Filings.**", "**FIRST YEAR PRICING.**", "**FORCE MAJEURE.**", "**First Year Pricing.**", "**Force Majeure.**", "**GOVERNING LAW.**", "**GOVERNMENTAL AGENCIES.**", "**Governing Law.**", "**Governmental Agencies.**", "**HEALTHCARE PROVIDER OR PATIENT QUESTIONS AND COMPLAINTS; ADVERSE EVENT REPORTING**", "**Healthcare Provider or Patient Questions and Complaints; Adverse Event Reporting**", "**INDEMNIFICATION PROCEDURE**", "**INDEPENDENT CONTRACTORS.**", "**INITIAL TERM.**", "**INSURANCE.**", "**INTELLECTUAL PROPERTY.**", "**INTERPRETATION**", "**INVENTIONS.**", "**INVOICES AND PAYMENT.**", "**Indemnification Procedure**", "**Independent Contractors.**", "**Initial Term.**", "**Insurance.**", "**Intellectual Property.**", "**Inventions.**", "**Invoices and Payment.**", "**LIMITATION OF LIABILITY.**", "**Limitation of Liability.**", "**MANUFACTURING SERVICES AGREEMENT**", "**MANUFACTURING SERVICES.**", "**MINIMUM ORDERS.**", "**MISCELLANEOUS**", "**MONTHLY ACTIVE MATERIALS INVENTORY REPORT**", "**Manufacturing Services Agreement**", "**Manufacturing Services.**", "**Maximum Credit**", "**Minimum Orders.**", "**NO THIRD PARTY BENEFIT OR RIGHT.**", "**NO WAIVER.**", "**NO WARRANTY.**", "**NOTICES.**", "**No Material Breach**", "**No Third Party Benefit or Right.**", "**No Waiver.**", "**No Warranty.**", "**Notices.**", "**OBLIGATIONS ON TERMINATION.**", "**OF ACTUAL ANNUAL YIELD**", "**ON TIME DELIVERY.**", "**ORDERS AND FORECASTS.**", "**ORDERS, SHIPMENT, INVOICING, PAYMENT**", "**OREXIGEN THERAPEUTICS, INC.**", "**OTHER TERMS.**", "**Obligations on Termination.**", "**Orders and Forecasts.**", "**Other Terms.**", "**PATHEON INC.**", "**PATHEON INC.,**", "**PATHEON PHARMACEUTICALS INC**", "**PATHEON PHARMACEUTICALS INC.**", "**PATHEON WARRANTIES.**", "**PATHEON.**", "**PATHEON’S MANUFACTURING SERVICES**", "**PATHEON’S RESPONSIBILITY FOR DEFECTIVE AND RECALLED PRODUCTS.**", "**PAYMENT.**", "**PERMITS.**", "**PRICE ADJUSTMENTS \u0096 CURRENT YEAR PRICING.**", "**PRICE ADJUSTMENTS \u0096 SUBSEQUENT YEARS’ PRICING.**", "**PRODUCT CLAIMS AND RECALLS**", "**PRODUCT CLAIMS.**", "**PRODUCT DISCONTINUATION.**", "**PRODUCT LIST AND SPECIFICATIONS**", "**PRODUCT RECALLS AND RETURNS.**", "**Patheon Warranties.**", "**Patheon.**", "**Patheon’s Responsibility for Defective and Recalled Products.**", "**Payment.**", "**Performance of Manufacturing Services**", "**Permits.**", "**Price Adjustments \u0096 Current Year Pricing.**", "**Price Adjustments \u0096 Subsequent Years’ Pricing.**", "**Procedure**", "**Product Claims.**", "**Product Discontinuation.**", "**Product Pricing**", "**Product Recalls and Returns.**", "**QUARTERLY REVIEW.**", "**Quarterly Review.**", "**REASONABLE ALLOCATION OF RISK.**", "**RECORDS AND ACCOUNTING BY PATHEON.**", "**REGULATORY INSPECTIONS.**", "**RELIANCE BY PATHEON.**", "**REMEDIES AND INDEMNITIES**", "**REPORT OF ANNUAL ACTIVE MATERIALS INVENTORY RECONCILIATION AND CALCULATION**", "**REPORTS.**", "**REPRESENTATIONS, WARRANTIES AND COVENANTS**", "**Reasonable Allocation of Risk.**", "**Records and Accounting by Patheon.**", "**Regulatory Inspections.**", "**Reliance by Patheon.**", "**Reporting**", "**Reports.**", "**SCHEDULE A**", "**SCHEDULE B**", "**SCHEDULE C**", "**SCHEDULE D**", "**SCHEDULE E**", "**SCHEDULE F**", "**SCHEDULE G**", "**SCHEDULE H (Reserved)**", "**SCHEDULES.**", "**SECTIONS AND HEADINGS.**", "**SEVERABILITY.**", "**SHIPMENTS.**", "**SINGULAR TERMS.**", "**SOLE REMEDY.**", "**Schedules.**", "**Sections and Headings.**", "**Severability.**", "**Shipments.**", "**Shortfall Calculation**", "**Singular Terms.**", "**Sole Remedy.**", "**TECHNICAL DISPUTE RESOLUTION**", "**TECHNICAL DISPUTE RESOLUTION.**", "**TERM AND TERMINATION**", "**TERMINATION FOR CAUSE.**", "**THIS MANUFACTURING SERVICES AGREEMENT**", "**Table of Contents**", "**Technical Dispute Resolution.**", "**Termination for Cause.**", "**USE OF CLIENT NAME.**", "**Use of Client Name.**", "**[*", "**[***", "**[[Date 1: Date]]**", "**“Product”**", "**“Successive Term(s)”**", "**“Territory”**", "**” for the Product at the Manufacturing Site during the Year. [*", "**” or “**", "**”) to Patheon (a “**", "**”) to purchase and, when accepted by Patheon, for Patheon to manufacture and deliver the agreed quantity of the Products on a date specified in the Firm Order. Firm Orders submitted to Patheon will specify Client’s Manufacturing Services purchase order number, quantities by Product type, monthly delivery schedule, and any other elements necessary to ensure the timely manufacture and shipment of the Products. The quantities of Products ordered in those written orders will be firm and binding on Client. Firm Orders submitted by Client pursuant to this Section 5.1(b) must be accepted by Patheon via a written order acknowledgement within six Business days of receipt of said Firm Order, and will be automatically firm and binding on Patheon up to quantities not more than [*", "**”). Except for a termination under Sections 8.3 (a), (b) or (c), if there is a Client Termination for the [*", "**”). The aggrieved party’s right to terminate this Agreement under this Section 8.3(a) may only be exercised for a period of [*", "*.*", "*]      [*", "*]  [*", "*] (the “**", "*] (unless a material inaccuracy was found in a prior audit). The auditor will be required to sign a confidentiality agreement for the benefit of, and in a form reasonably acceptable to, Patheon. Any undisputed amounts that are determined to be due and owing by one party to the other party following such audit will be paid within [*", "*] Business Days after a written request from either party to the other, meet in good faith to resolve any Technical Dispute. If, despite this meeting, the parties are unable to resolve a Technical Dispute within a reasonable time, and in any event within [*", "*] Business Days following the completion, termination, or expiration of the Agreement Client will pay Patheon $[*", "*] Product prior to the expiration of the Initial Term, Client shall pay to Patheon (i) $[*", "*] Products as set forth above are separate and independent and will result in Client Termination Payments for each Product. The Client Termination Payment shall be due to Patheon no later than [*", "*] after the end of each Year, Patheon will prepare an annual reconciliation of Active Materials on the reconciliation report form set forth in Schedule I including the calculation of the “**", "*] after the scheduled date of delivery, or if Patheon otherwise anticipates or notifies Client that it will be unable to make delivery of all or a portion of the ordered Products within [*", "*] and [*", "*] auditors. Client may request additional cGMP-type audits, additional audit days, or the participation of additional auditors subject to payment to Patheon of a fee of $[*", "*] basis during the [*", "*] batches, or [*", "*] cGMP-type audit, lasting no more than [*", "*] calendar days) thereafter, and with copies of any Authority-issued inspection observation reports (including, without limitation, Form 483s and equivalent forms from other regulatory bodies) and Authority correspondence, purged only of confidential information that is unrelated to the Products. Patheon will also notify Client of receipt of any other form 483’s or warning letters or any other significant regulatory action which Patheon’s quality assurance group determines could impact the regulatory status of the Products. Patheon and Client will cooperate in resolving any concerns with any Authority, and the Client may review Patheon’s responses to any such reports and communications, and Patheon will in its reasonable discretion incorporate into such responses any comments received from the Client. Patheon will also inform the Client of any action taken by any Authority against Patheon or any of its officers or employees which may be reasonably expected to adversely affect the Products or Patheon’s ability to supply the Products hereunder within [*", "*] day after delivery or discovery, as applicable. Except as set out in Section 6.3, Patheon will have no liability for any deviations for which it has not received notice within the applicable [*", "*] day of [*", "*] days after Client’s receipt thereof. Should Client fail to give Patheon the Deficiency Notice within the applicable [*", "*] days following receipt of a written notice of the breach that reasonably identifies the breach and expressly states that it is a notice under this Section 8.3(a) (a “**", "*] days prior to filing with any Regulatory Authority any documentation which is or is equivalent to the FDA’s Chemistry and Manufacturing Controls (“**", "*] days to advise Client by notice in writing that it disagrees with the contents of the Deficiency Notice. If Client and Patheon fail to agree within [*", "*] following the Effective Date, Client will give Patheon a non-binding 12 month forecast of the volume of Product that Client expects to order for commercial purposes in the first 12 months of commercial manufacture of the Product. This forecast will then be updated by Client on or before the [*", "*] minimum ($[*", "*] months prior to the due date for the product on the Firm Order, the Client will issue a firm written order in the form of a purchase order or otherwise (“**", "*] months to the Client at [*", "*] of (i) $[*", "*] of Patheon’s settlement of the Casualty Loss with its insurance carriers. Patheon’s liability for a Casualty Loss will not exceed $[*", "*] of any proposed or announced inspections, and as soon as possible (but in any case within [*", "*] of each Year, Patheon will give Client a statement setting forth the calculation for the [*", "*] of its Tablet Product requirements for [***", "*] of naltrexone HCL and/or greater than or equal to [*", "*] of purchase or, in the case of finished Product, within [*", "*] or (iii) $[*", "*] pallet minimum charge per [*", "*] per pallet per [*", "*] per pallet, per [*", "*] prior written notice (a “**", "*] successful commercial production batches of Product and has produced commercial production batches for at least [*", "*] than [*", "*] to maintain AAY levels for each Product above the applicable Target Yield. If the Actual Annual Yield falls more than [*", "*] will not [*", "*]% for [*", "*]% of Patheon’s revenues received pursuant to this Agreement, up to a maximum amount of $[*", "*]% of the Price of the quantities of Product not delivered by Patheon under the Firm Order on the Delivery Date (i.e., [*", "*]% of the cost for that Component upon which the most recent fee quote was based, Patheon will use [*", "*]% of the cost for that Component upon which the most recent fee quote was based; or (ii) the aggregate cost for all Components required to manufacture a Product increases by [*", "*]%. The most recent 12**", "*]**", "*], (ii) $[*", "*], [*", "*], based upon the [*", "*], for any reason whatsoever, including, without limitation, any liability arising under Article 6 hereof or resulting from any and all breaches of its representations, warranties, or any other obligations under this Agreement will not exceed [*", "*], known as the **“", "*], or (iii) $[*", "*], the Client Termination Payment shall be (i) $[*", "*], the [*", "*]. For greater certainty, [*", "*]. For the avoidance of doubt, Client Terminations of the [*", "*]. If Client [*", "*]. Patheon will use [*", "*]. Such audit will be conducted upon at least [*", "“**AAY**”", "“**API**”", "“**Act**”", "“**Active Materials Credit Value**”", "“**Active Materials**”", "“**Active Pharmaceutical Ingredients**”", "“**Actual Annual Yield**”", "“**Adverse Experience**”", "“**Affiliate**”", "“**Agreement**”", "“**Annual Product Review Report**”", "“**Annual Report**”", "“**Annual Volume**”", "“**Applicable Laws**”", "“**Authority**”", "“**Bill Back Items**”", "“**Breach Notice**”", "“**Bulk Tablet(s)**”", "“**Business Day**”", "“**CMC**”", "“**Casualty Loss**”", "“**Client Intellectual Property**”", "“**Client Property**”", "“**Client Termination Payment**”", "“**Client Termination**”", "“**Client**”", "“**Commencement Date**”", "“**Components**”", "“**Confidential Information**”", "“**Confidentiality Agreement**”", "“**Defective Product Credit Amount**”", "“**Deficiencies**”", "“**Deficiency Notice**”", "“**Effective Date**”", "“**Exclusivity Obligation**”", "“**FDA**”", "“**Firm Order**”", "“**Firm Orders**”", "“**Force Majeure Event**”", "“**Indemnitee**”", "“**Indemnitor**”", "“**Initial Manufacturing Period**”", "“**Initial Term**”", "“**Intellectual Property**”", "“**Invention**”", "“**Inventory**”", "“**Late Delivery**”", "“**Laws**”", "“**Manufacturing Services**”", "“**Manufacturing Site**”", "“**Materials**”", "“**Maximum Credit Value**”", "“**Notice Effective Date**”", "“**Patheon Competitor**”", "“**Patheon Intellectual Property**”", "“**Patheon**”", "“**Price**”", "“**Product Claims**”", "“**Product(s)**”", "“**Quality Agreement**”", "“**RFID**”", "“**Recall**”", "“**Recalled Product Credit Amount**”", "“**Regulatory Authority**”", "“**Shelf Life**”", "“**Shortfall**”", "“**Specifications**”", "“**Successive Term**”", "“**Tablet Product(s)**”", "“**Target Yield Determination Batches**”", "“**Target Yield**”", "“**Technical Dispute**”", "“**Termination Notice**”", "“**Territory**”", "“**Third Party Rights**”", "“**Year**”", "“**cGMPs**”", "“**herein**”", "“**hereof**”", "“**hereunder**”", "“**this Agreement**”", "“Agreement”", "“SEC”"]}}