{"metadata": {"organization_names": [], "person_names_verified": [], "organization_names_verified": ["international long distance service", "cmrs", "^^toll-free services", "travel talk services", "toll free services", "long distance msa", "interactive communications international", "interactive communications international, inc.", "qpay, inc.", "metropcs", "international long distance services", "metropcs wireless, inc.", "u.s. south communications, inc."], "topics": [], "entities_rejected": [], "person_names": [], "agreement_id": "113516672292ff453464ea323303002ab738906b61f6317eb38f3976a86f7515", "vars": {}, "terms": ["*            By:      \\centered /s/ *", "*            Name:      \\centered *", "*            Title:      \\centered *", "*      By:      \\centered /s/ *", "*      Printed Name:      \\centered *", "*      Title:      \\centered *", "* *", "** MetroPCS shall pay US South for International Long Distance Service terminated by US South in each of the MetroPCS Destinations (as hereinafter defined) (for the avoidance of doubt, ***", "** and (b) are collectively referred to herein as the “***", "** below), excluding domestic long distance service minutes that are: (i) attributable to Extended Service calls and, for the avoidance of doubt, calls terminating in Guam, Hawaii and the U.S. Virgin Islands; (ii) Bill and Keep Traffic; (iii) minutes generated under MetroPCS’ agreements with ***", "** or (b): (d) MetroPCS shall notify the Supplier successor in writing of its intent to terminate pursuant to this Section 5.7 and will allow the successor ***", "** or 7.2, as applicable. During such discussions, the Indemnified Party shall give the Indemnifying Party reasonable access to all records, data and Personnel of the Indemnified Party as may be reasonably necessary to make such determination. If the parties are unable to agree on whether the Indemnifying Party is required to indemnify the Indemnified Party under the terms of **", "***", "***      ***", "***   ***", "*** (b) personal injury, including death, and damage to tangible property caused by the negligent or intentional acts of a party or its Personnel; (c) ***", "*** (each, an “***", "*** (in accordance with the terms set forth in ) any invoiced amounts ***", "*** (including in any Service Addendum or Statement of Work). In order to exercise the set-off rights granted under this Section, MetroPCS must provide written notice to Supplier (with notice being sent to the person specified in Section 3.1.2 at the address specified in such Section) at least ***", "*** (which, for the avoidance of doubt, shall only include calls that are actually delivered to US South’s network) segregated by MetroPCS Destination, and ***", "*** (with time being of the essence), to ***", "*** (with time being of the essence); or (B) if ***", "*** (“***", "*** ), provided that such ***", "*** ). Upon delivery to MetroPCS or receipt from MetroPCS of such notice, US South shall have the right ***", "*** **", "*** , MetroPCS may terminate the affected Services (without liability for such termination) and Supplier shall, ***", "*** , MetroPCS shall provide US South with prompt written notice if ***", "*** , NEITHER PARTY SHALL BE LIABLE FOR ANY DAMAGES FOR LOST PROFITS, LOST REVENUES, OR LOSS OF GOODWILL, OR FOR CONSEQUENTIAL, SPECIAL, INDIRECT, EXEMPLARY OR PUNITIVE DAMAGES, ARISING OUT OF OR RELATING TO THIS AGREEMENT (INCLUDING ANY SERVICE ADDENDUM OR STATEMENT OF WORK), REGARDLESS OF THE FORM IN WHICH ANY ACTION IS BROUGHT (*****", "*** , US South shall have the right to ***", "*** , US South will either ***", "*** , US South’s switch information and other relevant records that relate to the amounts charged by US South to MetroPCS under this SA-1 or to verify US South’s compliance with the terms set forth in Section 2.06. For purposes of Section 9.3.3 of the Terms and Conditions, US South shall be obligated to reimburse MetroPCS for ***", "*** , and for purposes of Section 9.3.3 of the Terms and Conditions, ***", "*** , and for purposes of clarification only, ***", "*** , and within the time period specified in Section 3.2.3, sending a written notice to Supplier (with notice being sent to the person specified in Section 3.1.2 at the address specified in such Section) that describes with reasonable particularity the nature of the dispute and the disputed amount. Within sixty (60) days following its receipt of MetroPCS’ dispute notice, Supplier shall notify MetroPCS in writing as to whether it agrees with the dispute, describing therein with reasonable particularity the reasons supporting any disagreement with the dispute. If and to the extent Supplier agrees with MetroPCS’ position respecting the dispute, MetroPCS shall not be required to pay the disputed amount. If and to the extent Supplier disagrees with MetroPCS’ position respecting the dispute, the parties promptly shall attempt to resolve the dispute in accordance with the terms set forth in . ***", "*** , but subject to Supplier’s obligations under **", "*** , if either MetroPCS or US South subsequently obtains information that ***", "*** , in which case the parties shall negotiate in good faith the ***", "*** , it being the understanding of the parties that roaming calls in ***", "*** , or MetroPCS shall ***", "*** , such party shall provide the other party with prompt written notice, which notice shall include ***", "*** , the Transition Period automatically shall end at the end of the ***", "*** , then MetroPCS may provide US South with written notice thereof (the “***", "*** , then, commencing in the next month, the Traffic Routing Commitment percentage shall be ***", "*** , there is no Third Party demand or threatened claim, suit or proceeding against Supplier alleging violation or infringement of a Third Party IP Right. Supplier will not have breached the terms of this Section if ***", "*** , to the called automated number identification terminating in: (a) the contiguous forty-eight (48) states (excluding, for the avoidance of doubt, Guam, Hawaii and the U.S. Virgin Islands); and (b) Alaska and Puerto Rico (“***", "*** . ***", "*** . If MetroPCS, its Affiliates and/or Designated Entities deliver Domestic Long Distance Service minutes ***", "*** . If, ***", "*** . Promptly following the conclusion of the Transition Period under the applicable Service Addendum, the parties shall ***", "*** . US South shall have: (A) ***", "*** . Upon ***", "*** . Upon the occurrence of any of the events described in the foregoing **", "*** . Within ***", "*** . Without limiting any other rights and remedies that may then be available to MetroPCS, Supplier’s failure to provide Services that ***", "*** : (i) properly charge MetroPCS the cost of Domestic Long Distance Service (including Extended Service), Toll Free Services and/or Travel Talk Services under this SA-1, but only if ***", "*** ; (2) ***", "*** ; (3) ***", "*** ; (4) *", "*** ; and (5) such supporting documentation as is reasonably requested by US South and necessary for US South to evaluate ***", "*** ; and (ii) ***", "*** ; or (g) ***", "*** ; or (ii) ***", "*** Chart ***", "*** MetroPCS shall not be obligated to ***", "*** MetroPCS, its Affiliates and/or Designated Entities ***", "*** MetroPCS, its Affiliates and/or Designated Entities to terminate domestic long distance service (excluding calls terminating in Alaska and Puerto Rico) ***", "*** Supplier to comply with its legal obligations relating to such breach; and (e) in addition to any other damages for which Supplier may be liable, ***", "*** a termination fee equal to ***", "*** after its receipt of MetroPCS’ written notice; provided, however, that for a period of ***", "*** after the end of the month ***", "*** after the parties agree to submit the dispute to mediation, and the duration of the mediation shall be limited to ***", "*** and ***", "*** and MetroPCS ***", "*** and in subsequent increments of ***", "*** and reasonably supporting documentation (such as ***", "*** as of the date on which MetroPCS delivers a Carrier Notice to US South ***", "*** as provided in such Service Addendum or Statement of Work, and Supplier shall be entitled to exercise any other legal and equitable remedies available to Supplier under this Agreement (including the applicable Service Addendum or Statement of Work) or applicable Law. If an audit reveals that Supplier improperly invoiced MetroPCS for Services, or breached its obligations to MetroPCS under a Service Addendum or Statement of Work in the manner described in the applicable Service Addendum or Statement of Work, then: (a) Supplier may be obligated to reimburse MetroPCS ***", "*** but US South charges MetroPCS ***", "*** controlling interest of which consists of any one or more persons referred to in the foregoing **", "*** days after the representatives have commenced negotiations, or ***", "*** days following any such notification, as provided herein, the Indemnified Party and Indemnifying Party shall investigate and discuss in good faith whether such claim is subject to indemnification under **", "*** days from receipt of a Carrier Notice to ***", "*** designated by the auditing party, and the individual representatives of such ***", "*** domestic long distance calls ***", "*** domestic long distance service minutes to carriers with which MetroPCS, its Affiliates and/or Designated Entities has a Bill and Keep Traffic relationship. For purposes of this SA-1, the defined term “***", "*** following MetroPCS’ receipt of Supplier’s invoice. Undisputed, overdue invoices shall bear interest at the rate of ***", "*** following a party’s written request, the parties shall meet, telephonically or otherwise, and discuss in good faith the terms and conditions under which such Pre-Existing Agreement may be included as part of this Agreement and/or the possible termination of such Pre-Existing Agreement. However, under no circumstances will either party or its Affiliates (or, in MetroPCS’ case, an Affiliate or Designated Entity) be under any obligation ***", "*** following exercise of such right ***", "*** following its receipt of a Set-Off Notice, Supplier shall notify MetroPCS in writing as to whether it agrees with or objects to the Set-Off Notice, and if Supplier objects to the Set-Off Notice, then Supplier shall specify in such notice with reasonable particularity the reason for its objections and include with such notice documentation reasonably supportive of its objections (“***", "*** following the SA-1 Effective Date, the SIP G.711 protocol; and (b) commencing ***", "*** following the SA-2 Effective Date, the SIP G.711 protocol; and (b) commencing ***", "*** following the date of its receipt of the applicable invoice to the extent that: (a) MetroPCS conducts a financial audit pursuant to Section 9.3 of the Terms and Conditions; and (b) such audit reveals that: (i) the Services to which the invoice relates were provided during the ***", "*** following the date of its receipt of the applicable invoice. If MetroPCS ***", "*** following the date on which it knows an Event of Default has occurred, and if the Event of Default is based upon an action or omission for which there is no corresponding notice and opportunity to cure, then the non-performing party must exercise its right of termination within ***", "*** following the date that the applicable Service was provided to the extent that: (a) Supplier conducts a financial audit pursuant to Section 9.3 of the Terms and Conditions; and (b) such audit reveals that: (i) such Services were provided during the ***", "*** following the date that the applicable Service was provided. Subject to the exception described below in this Section 3.2.2 relating to financial audits, Supplier may not, and Supplier waives its right to, invoice MetroPCS for any Services more than ***", "*** following the effective date of such Service Addendum, ***", "*** following the effective date of such Service Addendum, the dollar amount of the termination fees that would have been payable by MetroPCS ***", "*** following the effective date of termination. Notwithstanding any contrary terms that may be contained herein, if MetroPCS does not purchase from US South during the Transition Period ***", "*** following the effective date of termination. Notwithstanding any contrary terms that may be contained in this Section 8.03(a), if MetroPCS does not purchase from US South during the Transition Period ***", "*** following the effective date of termination; (ii) if this SA-1 is terminated by MetroPCS following a US South Event of Default, ***", "*** following the effective date of termination; (ii) if this SA-2 is terminated by MetroPCS following a US South Event of Default, ***", "*** following the effective date of termination; (iv) if this SA-1 expires without renewal, ***", "*** following the effective date of termination; (iv) if this SA-2 expires without renewal, ***", "*** following the first day of the Transition Period; (ii) if this SA-1 is terminated by MetroPCS following a US South Event of Default, ***", "*** following the first day of the Transition Period; (ii) if this SA-2 is terminated by MetroPCS following a US South Event of Default, ***", "*** following the occurrence thereof the non-performing party cures such failure to perform, in which event the portion of such ***", "*** for Alaska calls and ***", "*** for the International Long Distance Service. MetroPCS shall pay US South the invoiced amounts in accordance with, and subject to, the terms set forth in of the Terms and Conditions no later than ***", "*** if not otherwise specified in the applicable Service Addendum or Statement of Work) (such period, the “***", "*** in a manner that constitutes an Event of Default as expressly agreed to by the parties in an applicable Service Addendum or Statement of Work, which failure shall constitute a Supplier Event of Default ***", "*** incurred in connection with such audit if the audit reveals that US South failed to: (i) properly charge MetroPCS the cost of International Long Distance Service under this SA-2, but only if ***", "*** is greater than ***", "*** month ***", "*** of all Domestic Long Distance Service calls, the SIP G.729 protocol, and for not more than ***", "*** of all International Long Distance Service calls, the SIP G.729 protocol, and for not more than ***", "*** of the beneficial ownership (as defined in Rule 13(d) of the Securities Exchange Act of 1934) of the voting power of Supplier, or of the assets of Supplier that constitute a substantial or material business segment of Supplier, other than a merger in which the holders of the common stock of Supplier immediately prior to the merger have substantially the same proportionate ownership of common stock or membership interest or other equity of the surviving entity immediately after the merger; provided that a Change in Control shall not include any consolidation or merger effected exclusively to change the domicile of Supplier; or (c) all or substantially all of the assets or the business of the unit, division, operating group or Affiliate of Supplier that is responsible for providing the Services is sold, transferred or otherwise experiences a change in ownership or control, excluding a change in ownership or control after which InComm is the ultimate or indirect majority owner of, or otherwise in control of, the affected InComm Affiliate. Notwithstanding the foregoing a Change of Control shall not have occurred to the extent control of Supplier remains with: (i) an entity that directly or indirectly controls Supplier as of the Effective Date; (ii) any controlling stockholder, ***", "*** of the domestic long distance service minutes generated by Customers from the MetroPCS Markets during the applicable month (subject to adjustment as provided in **", "*** of the occurrence of the events or circumstances that may constitute a Force Majeure Event), notify the party to which performance is due by telephone (to be confirmed in writing within ***", "*** or more of the voting power to elect the directors thereof or, for purposes of foreign corporations, if less than ***", "*** or more; and (b) such delay ***", "*** per occurrence and ***", "*** period following US South’s implementation of the Additional Destination (which implementation US South shall complete within ***", "*** period, the Transition Period automatically shall end at the end of the ***", "*** prior to the date by which a response, protest, contest, or other appeal of such Tax Assessment must be filed. In the first instance, Supplier shall have the exclusive right to contest any Tax Assessment at its own expense. If all or any portion of a Tax Assessment must be paid in order to contest the imposition of any such Tax Assessment in connection with a contest that Supplier elects to pursue, or to avoid the existence of a lien on the assets of Supplier during the pendency of such contest, Supplier shall be responsible for such payment and shall be entitled to the benefit of any refund or recovery. MetroPCS shall pay all valid final and non-appealable Tax Assessments (or reimburse Supplier in the event Supplier pays any or all valid final and non-appealable Tax Assessments) upon presentation by Supplier of proof of a valid final and non-appealable Tax Assessment. MetroPCS’ liability for valid final and non-appealable Tax Assessments will be limited to the actual tax that was originally due without respect to any sampling projection that may occur during a tax audit. A “***", "*** prior written notice of: (i) any proposed cancellation, (ii) an expiration without renewal, or (iii) any proposed change in carriers or material terms of coverage. Excluding Third Party carriers providing long-distance services to Supplier, Supplier shall require, obtain or otherwise arrange for levels of insurance coverage for all subcontractors that, at a minimum, satisfies the Supplier’s minimum requirements under this Agreement including, without limitation, with respect to limits, terms and conditions of such coverage. Supplier shall use commercially reasonable efforts to have MetroPCS added as an additional insured on its subcontractors’ insurance policies. Supplier shall maintain, in its files, evidence of all subcontractors’ insurance coverage and shall provide proof of such coverage to MetroPCS. If coverage is denied or reimbursement of a properly presented claim is disputed by the carrier for insurance provided as described above, upon written request, Supplier shall provide MetroPCS with a copy of the involved insurance policy or policies within ***", "*** prior written notice to MetroPCS if US South receives ***", "*** prior written notice to US South, MetroPCS, its Affiliates and Designated Entities shall have the right to transfer Domestic Long Distance Service minutes to any such Bill and Keep Traffic provider. In respect of new Bill and Keep Traffic relationships contemplated by MetroPCS, its Affiliates or Designated Entities following the SA-1 Effective Date which include a nominal cost to MetroPCS, US South shall have ***", "*** prior written notice to the applicable US South Account Representative (the date on which any such deletion becomes effective, the “***", "*** reflect the parties’ best estimate of the diminished value of the Services as a result of any failure to provide the Services in accordance with the applicable SLAs, and accordingly do not constitute nor shall be construed or interpreted as penalties. All ***", "*** shall provide to Supplier a written explanation of the reasons for doing so. Subject to the exception described below in this Section 3.2.3 relating to financial audits, MetroPCS may not, and MetroPCS waives its right to, dispute an invoice more than ***", "*** shall remain in effect during the Transition Period unless US South terminates this SA-1 following a MetroPCS Event of Default, in which case the SLAs and ***", "*** shall remain in effect during the Transition Period unless US South terminates this SA-2 following a MetroPCS Event of Default, in which case the SLAs ***", "*** that accrue in accordance with the terms of this Agreement shall ***", "*** that may be included in a Service Addendum or Statement of Work and fails to cure such breach within ***", "*** the International Fees payable hereunder to account for ***", "*** to MetroPCS by ***", "*** to MetroPCS unless US South ***", "*** to US South for termination following expiration of the applicable time period specified above in this paragraph, then MetroPCS shall pay US South for such Domestic Long Distance Service minutes at the DLD Rates. ***", "*** upon providing to MetroPCS with written notice, which notice shall include ***", "*** who or that have a reasonable need to know, provided that disclosures to its auditors must be made pursuant to written confidentiality obligations that are no less stringent than those set forth in this Section 6.2 and that cover the portions of the Supplier Confidential Information that will be disclosed, and subject to the terms of the foregoing **", "*** will be equal to ***", "*** within the applicable time period specified above in this paragraph, US South will either ***", "*****Where this marking appears throughout this Exhibit 10.1,**", "***, 5.5, 5.9, 5.10, 5.11, 5.12, 5.13, 7.1, 7.2, 7.3, 7.4**", "***, CONTRACT, TORT, NEGLIGENCE, OR OTHERWISE), EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.**", "***,” and collectively, the “***", "***2.1.1 Service Addenda as of the Effective Date***", "***2.1.2 Future Service Addenda***", "***3.1.1 Invoicing***", "***3.1.2 Payments***", "***3.1.3 Credits Owed by Supplier to MetroPCS***", "***3.2.1 Disputed Amounts***", "***3.2.2 Timely Invoicing***", "***3.2.3 Timely Disputes***", "***3.3.1 General.***", "***3.3.2 Exemptions.***", "***3.3.3 Special Provision Relating to State Sales and Use Taxes***", "***3.3.4 Protested Taxes***", "***5.4.1 General***", "***5.4.2 Right to Set Off***", "***5.5.1 Disclaimer of Non-Direct Damages***", "***5.5.2 Exclusions from Liability Limitations***", "***5.5.3 Lost Profits***", "***6.2.1 Duty of Care***", "***6.2.2 Disclosures of Confidential Information***", "***6.2.3 Uses of Confidential Information***", "***6.2.4 Return or Destruction of Confidential Information***", "***6.2.5 Notification Obligation***", "***6.2.6 Injunctive Relief***", "***6.2.7 Ownership***", "***6.2.8 Survival***", "***7.2.1 General***", "***7.2.2 Remedies***", "***7.2.3 Additional Indemnification Obligations***", "***7.3.1 General***", "***7.3.2 Defense Assumed***", "***7.3.3 Defense Declined***", "***7.3.4 Settlement of Claims***", "***7.3.5 Contributory Negligence; Right of Contribution***", "***9.16.1 General***", "***9.16.2 Prior Agreement***", "***9.16.3 Modifications***", "***9.3.1 Records Retention***", "***9.3.2 Procedures***", "***9.3.3 Audit Discrepancies***", "***Audited Financial Statements***", "***CONFIDENTIAL***", "***InComm Holdings, Inc.***", "***MASTER SERVICES AGREEMENT***", "***MetroPCS Wireless, Inc.***", "***Taxes****", "***[[Date 1: Date]]***", "***and***", "***by and between***", "***“SLA”***", "***“Service Level Agreement”***", "***”", "***” means: ***", "***” shall mean one that is issued by a state or local taxing authority in accordance with the applicable Law and which is not subject to any further administrative or judicial review and all times for appeal, reconsideration, or requests for reassessment have run without an appeal, reconsideration, or request for reassessment having been taken. If Supplier elects not to contest a Tax Assessment, Supplier must either: (c) waive its right to reimbursement from MetroPCS for that Tax Assessment in which event MetroPCS shall have no right to contest the Tax Assessment and MetroPCS shall have no liability for such Tax Assessment; or (d) promptly notify MetroPCS in writing that it is: (1) not responding, protesting, contesting, or appealing the Tax Assessment; and (2) seeking reimbursement for the Tax Assessment as if it were a valid final and non-appealable Tax Assessment which notice shall set forth the legal and/or factual basis for not contesting the Tax Assessment along with a copy of the Tax Assessment; provided, however, that Supplier shall in all instances give MetroPCS written notice of such decision to not protest, contest or appeal such Tax Assessment no later than ***", "***”) (the services described in the foregoing **", "***”) to receive the Services and all other Services reasonably necessary and appropriate to allow MetroPCS to effectuate an orderly transition to other replacement services; provided, however, that if Supplier completely or partially terminates this Agreement (including any Service Addendum or Statement of Work) following a Section 5.2(c) Event of Default, as conditions to such rights, MetroPCS must: (a) cure any payment default(s); (b) pay ***", "***”). After expiration of such ***", "***”). Domestic Long Distance Service includes four (4) categories (each, a “***", "***”). If Supplier agrees with the Set-Off Notice, then MetroPCS may exercise its set-off rights. If Supplier objects to the Set-Off Notice, then promptly following MetroPCS’ receipt of the Set-Off Response, the parties shall meet in an effort to resolve the issues relating to the Set-Off Notice. If the parties have not resolved such issues within ***", "***”). The Carrier Notice must set forth: (1) ***", "**, 3.1**", "**, MetroPCS may disclose Supplier Confidential Information to ***", "**2.02(c)**", "**4.8, 5.3,**", "**5.4.2**", "**7.2,**", "**ACCOUNT REPRESENTATIVES**", "**ADDENDA AND STATEMENTS OF WORK**", "**Additional Fees.**", "**Additional Reports.**", "**Additional Service Fees.**", "**Additional Service**", "**Additional Transition Period Terms**", "**Article 6**", "**Audit Rights.**", "**Billing Increments.**", "**CALL DETAIL RECORDS FOR DOMESTIC LONG DISTANCE TRAFFIC.**", "**CALL DETAIL RECORDS; NETWORK INTERCONNECTION.**", "**CHECKLIST FOR DEVELOPING SERVICE**", "**CONFIDENTIALITY AND SECURITY**", "**Commercial Automobile Liability**", "**Commercial General Liability**", "**Competitiveness of DLD Rates.**", "**DEFINED TERMS**", "**DLD RATES**", "**DLD Rates.**", "**DOMESTIC LONG DISTANCE SERVICE**", "**DOMESTIC LONG DISTANCE SERVICE.**", "**DOMESTIC LONG DISTANCE SERVICES**", "**Defined Terms.**", "**Description of**", "**Description**", "**Domestic Long Distance Service Routing Requirements.**", "**EXCEPT AS PROVIDED BELOW IN THIS SECTION, ANY ACTION, SUIT OR PROCEEDING BROUGHT BY A PARTY THAT IN ANY WAY ARISES OUT OF OR RELATES TO THIS AGREEMENT SHALL BE BROUGHT SOLELY AND EXCLUSIVELY IN THE STATE OR FEDERAL COURTS LOCATED IN DALLAS, TEXAS, AND EACH PARTY IRREVOCABLY ACCEPTS AND SUBMITS TO THE SOLE AND EXCLUSIVE PERSONAL JURISDICTION OF SUCH COURTS IN PERSONUM, GENERALLY AND UNCONDITIONALLY WITH RESPECT TO ANY ACTION, SUIT OR PROCEEDING BROUGHT BY OR AGAINST IT BY THE OTHER PARTY**", "**EXCEPT AS PROVIDED BELOW IN THIS SECTION, NEITHER PARTY SHALL BRING ANY ACTION, SUIT OR PROCEEDING IN ANY WAY ARISING OUT OF OR RELATING TO THE AGREEMENT IN ANY OTHER COURT OR IN ANY OTHER JURISDICTION AND SHALL NOT ASSERT ANY CLAIM, WHETHER AS AN ORIGINAL ACTION OR AS A COUNTERCLAIM OR OTHERWISE, AGAINST THE OTHER IN ANY OTHER COURT OR JURISDICTION**", "**EXCLUSIVITY; AUDIT RIGHTS; REPORTING.**", "**EXCLUSIVITY; PARTIES’ AUDIT RIGHTS.**", "**EXHIBIT 1**", "**EXHIBIT A TO EXHIBIT 1 \u0096 SERVICE ADDENDUM ONE**", "**EXHIBIT A TO EXHIBIT 1 \u0096 SERVICE ADDENDUM TWO**", "**EXHIBIT B TO EXHIBIT 1 \u0096 SERVICE ADDENDUM ONE**", "**EXHIBIT C TO EXHIBIT 1 \u0096 SERVICE ADDENDUM ONE**", "**Excess/Umbrella Insurance**", "**Exhibit 1**", "**Exhibit A**", "**Exhibit B**", "**Exhibit C**", "**FEES; ***", "**FORM OF DAILY REPORT**", "**Fee**", "**Fees; ***", "**General.**", "**IN WITNESS WHEREOF**", "**INCOMM HOLDINGS, INC.**", "**INSURANCE REQUIREMENTS**", "**INTERACTIVE COMMUNICATIONS INTERNATIONAL, INC.**", "**INTERNATIONAL LONG DISTANCE SERVICE**", "**INTERNATIONAL LONG DISTANCE SERVICE.**", "**INTERNATIONAL LONG DISTANCE SERVICES**", "**International Long Distance Service Rates; ***", "**Length of the Transition Period**", "**MASTER SERVICES AGREEMENT**", "**METROPCS MARKETS, FEE SCHEDULE AND PAYMENT TERMS.**", "**METROPCS WIRELESS, INC.**", "**MetroPCS Destination Schedule.**", "**MetroPCS International Long Distance Traffic Routing Requirements.**", "**MetroPCS Markets.**", "**Modification to ***", "**NETWORK INTERCONNECTION.**", "**NOW, THEREFORE**", "**PAGE**", "**PROCEDURES FOR MODIFYING DESTINATION DIAL CODES**", "**Parties’ Audit Rights.**", "**Payment Terms.**", "**Percentage Change Calculations.**", "**Please note that the representations and warranties of each party set forth in the Master Services Agreement have been made solely for the benefit of the other party. You should not rely on such representations and warranties, which (i) have been qualified in some circumstances by confidential disclosures to the other party in connection with the agreement, (ii) were made only as of the date of the Master Services Agreement or such other date as is specified in the agreement, and (iii) may have been included in the agreement for the purpose of allocating risk between the parties rather than establishing matters as facts.**", "**Pricing During the Transition Period**", "**RECITALS****", "**REPORTING.**", "**SCHEDULE 1.03 TO EXHIBIT 1 \u0096 SERVICE ADDENDUM TWO**", "**SCHEDULE 1.5**", "**SCHEDULE 2**", "**SCHEDULE 2.02 TO EXHIBIT 1 \u0096 SERVICE ADDENDUM TWO**", "**SCHEDULE 2.5**", "**SCHEDULE 5.01 TO EXHIBIT 1 \u0096 SERVICE ADDENDUM TWO**", "**SCHEDULE 7.4**", "**SCHEDULES, ATTACHMENTS AND EXHIBITS**", "**SERVICE ADDENDA ATTACHED**", "**SERVICE ADDENDUM ONE**", "**SERVICE ADDENDUM TWO**", "**SERVICE LEVEL AGREEMENTS.**", "**SLAs During the Transition Period**", "**Schedule 1.03**", "**Schedule 1.5**", "**Schedule 2**", "**Schedule 2.02**", "**Schedule 2.5**", "**Schedule 5.01**", "**Schedule 7.4**", "**Section D(2)**", "**Section of the Agreement**", "**Sections 1.4**", "**Sections 2.02(b) or 2.02(c)**", "**Sections 2.02(b)**", "**Sections 2.02**", "**Sections 2.06**", "**Sections 3.2.1, 3.2.3**", "**Sections 5.2(d)**", "**Sections 5.9(a)**", "**Sections 5.9**", "**Sections 5.9, 5.10**", "**Sections 6.2.2(b)**", "**Sections 7.1**", "**Service Level Agreements.**", "**TABLE OF CONTENTS**", "**TERM AND TERMINATION OF SA-1; TRANSITION RIGHTS.**", "**TERM AND TERMINATION OF SA-2; TRANSITION RIGHTS.**", "**THE WARRANTIES SET FORTH IN THIS AGREEMENT (INCLUDING IN ANY SERVICE ADDENDUM OR STATEMENT OF WORK) ARE THE ONLY WARRANTIES MADE BY A PARTY, AND NO OTHER WARRANTY, EXPRESS OR IMPLIED, WILL APPLY INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT.**", "**TROUBLE REPORTING AND ESCALATION MECHANISMS**", "**TROUBLE RESOLUTION AND REPORTING PROCEDURES.**", "**Technical Support.**", "**Technology Errors and Omissions**", "**Termination for Convenience.**", "**Transition Rights**", "**Transition Rights.**", "**U.S. SOUTH COMMUNICATIONS, INC.**", "**US South ***", "**VENDOR ETHICS POLICY**", "**WHEREAS**", "**Workers’ Compensation**", "**confidential treatment and such information has been filed**", "**information has been omitted pursuant to a request for**", "**subsection (a)**", "**subsection (c)**", "**subsection (d)**", "**subsection (e)**", "**subsection (i)**", "**subsections (a)**", "**subsections (c)**", "**with the Securities and Exchange Commission separately.**", "**“WIRELESS DIRECT” DIRECT PEERING RELATIONSHIPS**", "*.*", "*ab initio*", "*e.g.*", "*i.e.*", "“***Additional Carrier***”", "“***Additional Destination***”", "“***Additional ILD Services***”", "“***Additional Services***”", "“***Affiliate(s)***”", "“***Agreement***”", "“***Authorized User***”", "“***Available***”", "“***Bankruptcy Code***”", "“***CDRs***”", "“***Carrier Notice***”", "“***Change in Control***”", "“***Comparable Services***”", "“***Confidential Information***”", "“***Customers***”", "“***DLD Rates***”", "“***Deleted Destination***”", "“***Designated Entity***”", "“***Discloser***”", "“***Effective Date***”", "“***Event of Default***”", "“***Events of Default***”", "“***Existing Bill and Keep Providers***”", "“***Extended Service***”", "“***FCC***”", "“***Force Majeure Event***”", "“***ILD CDRs***”", "“***InComm***”", "“***Indemnified Parties***”", "“***Indemnifying Party***”", "“***Infringement Claim***”", "“***Initial Period***”", "“***Intellectual Property Rights***”", "“***International Fees***”", "“***International Long Distance Service***”", "“***Law(s)***”", "“***Local Meet-Point***”", "“***Losses***”", "“***MetroPCS Account Representative***”", "“***MetroPCS Competitor***”", "“***MetroPCS Destination Schedule***”", "“***MetroPCS Destination***”", "“***MetroPCS Entities***”", "“***MetroPCS Market***”", "“***MetroPCS Personnel***”", "“***MetroPCS***”", "“***MetroPCS-to-MetroPCS***”", "“***Other***”", "“***Particular Destination***”", "“***Percentage Change***”", "“***Percentage of Delivered ILD Calls***”", "“***Person***”", "“***Personal Information Statute***”", "“***Personnel***”", "“***Pre-Existing Agreement***”", "“***Pre-Existing Materials***”", "“***Prior Agreement***”", "“***Recipient***”", "“***Records***”", "“***Routing Choice***”", "“***SA-1 Effective Date***”", "“***SA-1 Term***”", "“***SA-1***”", "“***SA-2 Effective Date***”", "“***SA-2 Term***”", "“***SA-2***”", "“***Service Addendum***”", "“***Services***”", "“***Set-Off Notice***”", "“***Set-Off Response***”", "“***Statement of Work***”", "“***Supplier Entities***”", "“***Supplier Personnel***”", "“***Supplier***”", "“***Tax Assessment***”", "“***Term***”", "“***Termination Date***”", "“***Terms and Conditions***”", "“***Third Party Action***”", "“***Third Party IP Right***”", "“***Third Party***”", "“***Toll Free Services***”", "“***Traffic Routing Commitment***”", "“***Transition Period***”", "“***Travel Talk Services***”", "“***Trial Period***”", "“***US South Account Representative***”", "“***US South***", "“***US South”***", "“***Wireless Direct***”", "“***Wireless***”", "“***valid final and non-appealable Tax Assessment***”", "“***” ***"]}}