{"metadata": {"organization_names": [], "person_names_verified": ["kevin finnegan"], "organization_names_verified": [], "topics": [], "entities_rejected": [], "person_names": [], "agreement_id": "77883945a999fd0d9fd6b1fc4e348f28d75dfb6c11e289604ae88477e3bce83b", "vars": {}, "terms": ["** Except as set forth in Section 11, any dispute, claim or difference arising out of or in relation to your employment will be settled exclusively by binding arbitration administered by the American Arbitration Association under its National Rules for the Resolution of Employment Disputes before a single arbitrator. The Executive expressly understands and agrees that claims subject to arbitration under this section include asserted violations of the Employee Retirement and Income Security Act of 1974; the Age Discrimination in Employment Act; the Older Worker’s Benefit Protection Act; the Americans with Disabilities Act; Title VII of the Civil Rights Act of 1964 (as amended); the Family and Medical Leave Act; and any law prohibiting discrimination, harassment or retaliation in employment, whether based on federal, state or local law; any claim of breach of contract, tort, promissory estoppel or detrimental reliance, defamation, intentional infliction of emotional distress; or the public policy of any state, or any other federal, state or local law. The arbitration will be held in [[Address 5: Address]] unless you and the Company (each a “Party,” and jointly, the “Parties”) mutually agree otherwise. To the extent permitted by law, each Party will bear its own costs and fees of the arbitration, and other fees and expenses of the arbitrator will be borne equally by the Parties; *", "**Acknowledgment of Reasonableness****", "**Arbitration of Disputes****", "**Bonus****", "**Company Property****", "**Confidential Information, Intellectual Property****", "**Employee Benefits****", "**Entire Agreement****", "**Governing Law****", "**Job Title and Duties****", "**Nature of Agreement and Relationship****", "**Non-Competition****", "**Non-Solicitation****", "**Post-Termination Cooperation****", "**Re: Letter Agreement of Employment**", "**Remedies****", "**Salary****", "**Severance Pay****", "**Stock Options and Other Long-Term Incentives****", "**Survival of Provisions****", "**Understandings and Representations****", "**[ii]**", "**[iii]**", "*, *", "“Agreement”", "“Base Salary”", "“Benefits Plans”", "“Company”", "“Party,” and jointly, the “Parties”", "“Severance Pay”"]}}