{"metadata": {"organization_names": ["prudential affiliate"], "person_names_verified": ["cheryl k. beebe", "kimberly a. hunter", "mary ann hynes", "wiley s. adams"], "organization_names_verified": ["coöperatieve centrale raiffeisen boerenleenbank b.a.", "corn products international inc", "international, inc.", "america investment operations group", "the prudential insurance company", "pim inc.", "jpmorgan chase bank\n\nnew york", "prudential investment management inc", "prudential investment management inc.", "jpmorgan chase bank, national association", "suntrust capital markets", "agfirst farm credit bank as co", "ing capital llc", "rabobank international", "harris n.a.", "bank of montreal", "suntrust bank", "canada starch operating company, inc.", "prudential and prudential affiliates", "prudential financial, inc.", "kpmg llp", "sidley austin llp", "bloomberg l.p.", "bloomberg financial markets", "prudential investment management, inc.", "corn products international, inc.", "pi x pa", "prudential capital group"], "vars": {}, "entities_rejected": [], "person_names": [], "agreement_id": "453a8708929b874598c1e095dce34f97420a578e13b056cd7d8507464af29eca", "topics": [], "terms": ["** At least one of the following statements is an accurate representation as to each source of funds (a “Source”**", "** At the time of the execution of this Agreement by the Company and Prudential, the Company will pay to each Purchaser by wire transfer of immediately available funds, such Purchaser’s ratable portion (in proportion to the aggregate principal amount of the Notes to be purchased by such Purchaser) of a structuring fee (herein called the “Structuring Fee”**", "** If the Company at any time notifies Prudential in writing that the Company is canceling the closing of the purchase and sale of any Accepted Note, or if Prudential notifies the Company in writing under the circumstances set forth in the last sentence of paragraph 2E or the penultimate sentence of paragraph 2G that the closing of the purchase and sale of such Accepted Note is to be canceled, or if the closing of the purchase and sale of such Accepted Note is not consummated on or prior to the last day of the Issuance Period (the date of any such notification or the last day of the Issuance Period, as the case may be, being herein called the “**", "** If the closing of the purchase and sale of any Accepted Note is delayed for any reason beyond the 42nd day following the Acceptance Day for such Accepted Note, the Company will pay to the Purchaser which shall have agreed to purchase such Accepted Note (a) on the Cancellation Date or actual closing date of such purchase and sale and (b) if earlier, the next Business Day following 90 days after the Acceptance Day for such Accepted Note and on each Business Day following 90 days after the prior payment hereunder, a fee (herein called the “Delayed Delivery Fee”**", "** Not later than 11:30 A.M. (New York City local time) on the Closing Day for any Accepted Notes, the Company will deliver to each Purchaser listed in the Confirmation of Acceptance relating thereto at the offices of Prudential Capital Group, [[Address 2: Address]], Attention: Law Department, or at such other place as Prudential may have directed, the Accepted Notes to be purchased by such Purchaser in the form of one or more Notes in authorized denominations as such Purchaser may request for each Series of Accepted Notes to be purchased on the Closing Day, dated the Closing Day and registered in such Purchaser’s name (or in the name of its nominee), against payment of the purchase price thereof by transfer of immediately available funds for credit to the Company’s account specified in the Request for Purchase of such Notes. If the Company fails to tender to any Purchaser the Accepted Notes to be purchased by such Purchaser on the scheduled Closing Day for such Accepted Notes as provided above in this paragraph 2G, or any of the conditions specified in paragraph 3 shall not have been fulfilled by the time required on such scheduled Closing Day, the Company shall, prior to 1:00 P.M., New York City local time, on such scheduled Closing Day notify Prudential (which notification shall be deemed received by each Purchaser) in writing whether (i) such closing is to be rescheduled (such rescheduled date to be a Business Day during the Issuance Period not less than one Business Day and not more than 10 Business Days after such scheduled Closing Day (the “Rescheduled Closing Day”**", "** Prudential is willing to consider, in its sole discretion and within limits which may be authorized for purchase by Prudential Affiliates from time to time, the purchase of Shelf Notes pursuant to this Agreement. The willingness of Prudential to consider such purchase of Shelf Notes is herein called the “**", "** Shelf Notes may be issued and sold pursuant to this Agreement until the earlier of (i) the third anniversary of the date of this Agreement (or if the date of such anniversary is not a Business Day, the Business Day next preceding such anniversary), (ii) the 30th day after Prudential shall have given to the Company, or the Company shall have given to Prudential, a written notice stating that it elects to terminate the issuance and sale of Shelf Notes pursuant to this Agreement (or if such 30th day is not a Business Day, the Business Day next preceding such 30th day), (iii) the last Closing Day after which there is no Available Facility Amount, (iv) the termination of the Facility under paragraph 7A of this Agreement, and (v) the acceleration of any Note under paragraph 7A of this Agreement. The period during which Shelf Notes may be issued and sold pursuant to this Agreement is herein called the “Issuance Period”**", "** The Company may from time to time during the Issuance Period make requests for purchases of Shelf Notes (each such request being herein called a “Request for Purchase”**", "** The Company will pay to each Purchaser in immediately available funds a fee (herein called the “Issuance Fee”**", "** The proceeds of any Series of Shelf Notes will be used as specified in the Request for Purchase with respect to such Series. None of the proceeds of the sale of any Notes will be used, directly or indirectly, for the purpose, whether immediate, incidental or ultimate, of purchasing or carrying any “margin stock” as defined in Regulation U (12 CFR Part 221) of the Board of Governors of the Federal Reserve System (herein called “margin stock”**", "** Within the Acceptance Window with respect to any interest rate quotes provided pursuant to paragraph 2D, the Company may, subject to paragraph 2F, elect to accept such interest rate quotes as to not less than $[[USD Value 4: Number]] aggregate principal amount of the Shelf Notes specified in the related Request for Purchase. Such election shall be made by an Authorized Officer of the Company notifying Prudential by telephone or facsimile transmission within the Acceptance Window that the Company elects to accept such interest rate quotes, specifying the Shelf Notes (each such Shelf Note being herein called an “**", "**$[[USD Value 1: Number]]**", "**.**", "**10A.****", "**10B.****", "**10C. Accounting and Legal Principles, Terms and Determinations.**", "**11A. Note Payments.**", "**11B. Expenses.**", "**11C. Confidentiality.**", "**11D. Consent to Amendments.**", "**11E. Form, Registration, Transfer and Exchange of Notes; Lost Notes.**", "**11F. Persons Deemed Owners; Participations.**", "**11G. Survival of Representations and Warranties; Entire Agreement.**", "**11H. Successors and Assigns.**", "**11I. Independence of Covenants.**", "**11J. Notices.**", "**11K. Payments Due on Non-Business Days.**", "**11L. Satisfaction Requirement.**", "**11M. GOVERNING LAW. THIS AGREEMENT SHALL BE CONSTRUED AND ENFORCED IN ACCORDANCE WITH, AND THE RIGHTS OF THE PARTIES SHALL BE GOVERNED BY, THE LAW OF THE STATE OF ILLINOIS (EXCLUDING ANY CONFLICTS OF LAW RULES WHICH WOULD OTHERWISE CAUSE THIS AGREEMENT TO BE CONSTRUED OR ENFORCED IN ACCORDANCE WITH, OR THE RIGHTS OF THE PARTIES TO BE GOVERNED BY, THE LAWS OF ANY OTHER JURISDICTION).**", "**11N. SUBMISSION TO JURISDICTION; WAIVER OF JURY TRIAL. ANY LEGAL ACTION OR PROCEEDING WITH RESPECT TO THIS AGREEMENT OR THE NOTES MAY BE BROUGHT IN THE COURTS OF THE STATE OF ILLINOIS IN COOK COUNTY, ILLINOIS, OR OF THE UNITED STATES FOR THE NORTHERN DISTRICT OF ILLINOIS AND, BY EXECUTION AND DELIVERY OF THIS AGREEMENT, THE COMPANY HEREBY IRREVOCABLY ACCEPTS, UNCONDITIONALLY, THE JURISDICTION OF THE AFORESAID COURTS WITH RESPECT TO ANY SUCH ACTION OR PROCEEDING. THE COMPANY FURTHER IRREVOCABLY CONSENTS TO THE SERVICE OF PROCESS OUT OF ANY OF THE**", "**11O.****", "**11P.****", "**11Q.****", "**11R.****", "**11S.****", "**11T.****", "**11U.****", "**2A.**", "**2B.**", "**2C.**", "**2D.****", "**2E.**", "**2F.****", "**2G.**", "**2H(i).**", "**2H(ii).**", "**2H(iii).**", "**2H(iv).**", "**2H.****", "**3A.****", "**3B.****", "**3C.****", "**3D.****", "**3E.****", "**3F.****", "**3G.****", "**3H.****", "**4A.****", "**4B.****", "**4C.****", "**4D.****", "**4E(1).****", "**4E(2).****", "**4E(3).****", "**4E(4).****", "**4E(5).****", "**4E(6).****", "**4E.****", "**4F.****", "**5A.****", "**5B.****", "**5C.****", "**5D.****", "**5E.****", "**5F.****", "**5G.****", "**5H.****", "**5I.****", "**5J.****", "**6A(1).****", "**6A(2).****", "**6A.****", "**6B.****", "**6C.****", "**6D.****", "**6E.****", "**6F.****", "**6G.**", "**7A.****", "**7B.****", "**7C.****", "**8A(1).****", "**8A(2).****", "**8B.****", "**8C.****", "**8D.****", "**8E.****", "**8F.****", "**8G.****", "**8H.****", "**8I.**", "**8J.****", "**8K.****", "**8L.****", "**8M.****", "**8N.****", "**8O.****", "**8P.**", "**8Q.****", "**8R.****", "**9A.****", "**9B.**", "**AFFIRMATIVE COVENANTS.**", "**AFOREMENTIONED COURTS IN ANY SUCH ACTION OR PROCEEDING BY THE MAILING OF COPIES THEREOF BY REGISTERED OR CERTIFIED MAIL, POSTAGE PREPAID, TO IT AT ITS ADDRESS PROVIDED IN PARAGRAPH 11J, SUCH SERVICE TO BECOME EFFECTIVE UPON RECEIPT. THE COMPANY AGREES THAT A FINAL JUDGMENT IN ANY SUCH ACTION OR PROCEEDING SHALL BE CONCLUSIVE AND MAY BE ENFORCED IN ANY OTHER JURISDICTION BY SUIT ON SUCH JUDGMENT OR IN ANY OTHER MANNER PROVIDED BY LAW. NOTHING HEREIN SHALL AFFECT THE RIGHT OF ANY HOLDER OF A NOTE TO SERVE PROCESS IN ANY OTHER MANNER PERMITTED BY LAW OR TO COMMENCE LEGAL PROCEEDINGS OR OTHERWISE PROCEED AGAINST THE COMPANY IN ANY OTHER JURISDICTION IN WHICH, UNDER APPLICABLE LAW, IN EACH CASE TO THE EXTENT SUCH RIGHT WOULD EXIST WITHOUT THE BENEFIT OF THIS PARAGRAPH, A LEGAL PROCEEDING MAY BE COMMENCED AGAINST THE COMPANY. THE COMPANY HEREBY IRREVOCABLY WAIVES ANY OBJECTION WHICH IT MAY NOW OR HEREAFTER HAVE TO THE LAYING OF VENUE OF ANY OF THE AFORESAID ACTIONS OR PROCEEDINGS ARISING OUT OF OR IN CONNECTION WITH THIS AGREEMENT OR THE NOTES BROUGHT IN ANY OF THE AFORESAID COURTS AND HEREBY FURTHER IRREVOCABLY WAIVES AND AGREES NOT TO PLEAD OR CLAIM IN ANY SUCH COURT THAT ANY SUCH ACTION OR PROCEEDING BROUGHT IN ANY SUCH COURT HAS BEEN BROUGHT IN AN INCONVENIENT FORUM. TO THE EXTENT THAT THE COMPANY HAS OR MAY HEREAFTER ACQUIRE IMMUNITY FROM JURISDICTION OF ANY OF THE AFORESAID COURTS OR FROM ANY LEGAL PROCESS (WHETHER THROUGH SERVICE OF NOTICE, ATTACHMENT PRIOR TO JUDGMENT, ATTACHMENT IN AID OF EXECUTION, EXECUTION OR OTHERWISE WITH RESPECT TO ITSELF OR ITS PROPERTY), THE COMPANY HEREBY IRREVOCABLY WAIVES SUCH IMMUNITY IN RESPECT OF ITS OBLIGATIONS UNDER THIS AGREEMENT OR THE NOTES. THE COMPANY, PRUDENTIAL AND EACH PURCHASER HEREBY IRREVOCABLY WAIVES ANY AND ALL RIGHT TO TRIAL BY JURY IN ANY LEGAL PROCEEDING ARISING OUT OF OR RELATING TO THIS AGREEMENT, THE NOTES OR THE TRANSACTIONS CONTEMPLATED THEREBY.**", "**AUTHORIZATION OF ISSUE OF SHELF NOTES.**", "**Account**", "**Address**", "**Amount**", "**Amounts**", "**CONDITIONS OF CLOSING.**", "**CORN PRODUCTS INTERNATIONAL, INC. [[Address 1: Address]]**", "**CORN PRODUCTS INTERNATIONAL, INC.**", "**DEFINITIONS; ACCOUNTING MATTERS.**", "**Date**", "**Dated as of [[Date 1: Date]]**", "**Dates and**", "**EVENTS OF DEFAULT.**", "**EXHIBITS AND SCHEDULES**", "**Final**", "**Interest**", "**Maturity**", "**NEGATIVE COVENANTS.**", "**Name,**", "**Number of Bank**", "**Number of**", "**PREPAYMENTS.**", "**PRIVATE SHELF AGREEMENT**", "**PRIVATE SHELF FACILITY**", "**PRUDENTIAL INVESTMENT MANAGEMENT, INC.**", "**PURCHASE AND SALE OF SHELF NOTES.**", "**PURCHASER SCHEDULE**", "**Page**", "**Payment**", "**Period(2)**", "**Prepayment**", "**Principal**", "**REPRESENTATIONS OF EACH PURCHASER.**", "**REPRESENTATIONS, COVENANTS AND WARRANTIES.**", "**TABLE OF CONTENTS**", "**THIS NOTE IS INTENDED TO BE PERFORMED IN THE STATE OF ILLINOIS AND SHALL BE CONSTRUED AND ENFORCED IN ACCORDANCE WITH THE LAW OF SUCH STATE (EXCLUDING ANY CONFLICTS OF LAW RULES WHICH WOULD OTHERWISE CAUSE THIS NOTE TO BE CONSTRUED OR ENFORCED IN ACCORDANCE WITH THE LAWS OF ANY OTHER JURISDICTION).**", "**[**", "**[PRUDENTIAL AFFILIATE]**", "**]**", "**and ABA Routing**", "**“Acceptance Day”**", "**“Acceptance Window”**", "**“Acceptance”**", "**“Accepted Note”**", "**“Acquisition”**", "**“Affiliate”**", "**“Anti-Terrorism Order”**", "**“Authorized Officer”**", "**“Available Facility Amount”**", "**“BEY”**", "**“Bankruptcy Law”**", "**“Borrowed Debt”**", "**“Business Day”**", "**“Called Principal”**", "**“Canada Starch”**", "**“Cancellation Date”**", "**“Cancellation Fee”**", "**“Capitalized Lease Obligation”**", "**“Capitalized Lease”**", "**“Change of Control”**", "**“Closing Day”**", "**“Code”**", "**“Confirmation of Acceptance”**", "**“Consolidated”**", "**“Credit Agreement”**", "**“Creditors’ Guarantee”**", "**“DTS”**", "**“Debt”**", "**“Default Rate”**", "**“Default”**", "**“Delayed Delivery Fee”**", "**“Discounted Value”**", "**“EBITDA”**", "**“ERISA Affiliate”**", "**“ERISA”**", "**“Electronic Delivery”**", "**“Event of Default”**", "**“Exchange Act”**", "**“Facility”**", "**“Guarantee”**", "**“Hedge Agreements”**", "**“Hedge Treasury Note(s)”**", "**“Hostile Tender Offer”**", "**“INHAM Exemption”**", "**“Institutional Investor”**", "**“Interest Coverage Ratio”**", "**“Invested Amounts”**", "**“Issuance Fee”**", "**“Issuance Period”**", "**“Leverage Ratio”**", "**“Lien”**", "**“MMY”**", "**“Material Adverse Effect”**", "**“Measurement Period”**", "**“Multiemployer Plan”**", "**“NAIC Annual Statement”**", "**“Net Borrowed Debt”**", "**“Notes”**", "**“Officer’s Certificate”**", "**“PA”**", "**“PBGC”**", "**“PI”**", "**“PTE”**", "**“Person”**", "**“Plan”**", "**“Primary Debt Obligations”**", "**“Prudential Affiliate”**", "**“Prudential”**", "**“Purchasers”**", "**“QPAM Exemption”**", "**“Reinvestment Yield”**", "**“Remaining Average Life”**", "**“Remaining Scheduled Payments”**", "**“Request for Purchase”**", "**“Required Holder(s)”**", "**“Rescheduled Closing Day”**", "**“Responsible Officer”**", "**“Securities Act”**", "**“Series”**", "**“Settlement Date”**", "**“Shelf Notes”**", "**“Significant Holder”**", "**“Significant Subsidiary**”", "**“Structuring Fee”**", "**“Subsidiary”**", "**“Synthetic Lease Obligations”**", "**“Transaction Documents”**", "**“Transferee”**", "**“USA Patriot Act”**", "**“Voting Stock”**", "**“Wholly-Owned Subsidiary”**", "**“Yield-Maintenance Amount”**", "**“employee benefit plan”, “governmental plan”**", "**“including”**", "**“knowledge”**", "**“margin stock”**", "**“separate account”**", "*Signature Page Follows*", "*further*", "*provided*", "“**Bankruptcy Law”**", "“**Company”**", "“**Prudential”**", "“**Series”**", "“**Shelf Notes”**", "“**Shelf Note”, “Note”**", "“Agreement”", "“Company”", "“Creditors’ Guarantee”", "“Notes”", "“Prudential”", "”** at such time. NOTWITHSTANDING THE WILLINGNESS OF PRUDENTIAL TO CONSIDER PURCHASES OF SHELF NOTES BY PRUDENTIAL AFFILIATES, THIS AGREEMENT IS ENTERED INTO ON THE EXPRESS UNDERSTANDING THAT NEITHER PRUDENTIAL NOR ANY PRUDENTIAL AFFILIATE SHALL BE OBLIGATED TO MAKE OR ACCEPT OFFERS TO PURCHASE SHELF NOTES, OR TO QUOTE RATES, SPREADS OR OTHER TERMS WITH RESPECT TO SPECIFIC PURCHASES OF SHELF NOTES, AND THE FACILITY SHALL IN NO WAY BE CONSTRUED AS A COMMITMENT BY PRUDENTIAL OR ANY PRUDENTIAL AFFILIATE.**", "”** for such Accepted Notes. Any interest rate quotes as to which Prudential does not receive an Acceptance within the Acceptance Window shall expire, and no purchase or sale of Shelf Notes hereunder shall be made based on such expired interest rate quotes. Subject to paragraph 2F and the other terms and conditions hereof, the Company agrees to sell to a Prudential Affiliate or Affiliates, and Prudential agrees to cause the purchase by a Prudential Affiliate or Affiliates of, the Accepted Notes at [[Percentage 1]]% of the principal amount of such Notes. As soon as practicable following the Acceptance Day, the Company and each Prudential Affiliate which is to purchase any such Accepted Notes will execute a confirmation of such Acceptance substantially in the form of Exhibit C attached hereto (herein called a “Confirmation of Acceptance”**", "”**) as to which such acceptance (herein called an “**", "”**) relates. The day the Company notifies Prudential of an Acceptance with respect to any Accepted Notes is herein called the “**", "”**), the Company will pay to the Purchaser which shall have agreed to purchase such Accepted Note in immediately available funds an amount (the “Cancellation Fee”**", "”**. At any time, the aggregate principal amount of Shelf Notes stated in paragraph 1, minus the aggregate principal amount of Shelf Notes purchased and sold pursuant to this Agreement prior to such time, minus the aggregate principal amount of Accepted Notes (as hereinafter defined) which have not yet been purchased and sold hereunder prior to such time, is herein called the “**"]}}