{"metadata":{"topics":[],"person_names":[],"vars":{},"organization_names":[],"agreement_id":"c07dd5a3a0e0d9508cc54f53552b0118cf389f9b0c75c6634fb562250ad68b0b","terms":["**   \\centered Amendment Date***","**. [*","**Additional Compensation for Broker**","**Agreement to Sell Securities**","**Agreement**","**Annual**","**Arbitration**","**Attorney’s Fee**","**Broker Commission**","**Broker Dealer Name (as listed w/ FINRA**","**Brokers**","**Construction.**","**Counterparts**","**Date**","**Governing Law**","**Headings**","**Income Tax**","**Indemnity Clause**","**Indulgences, Not Waivers**","**Integration**","**Intent**","**Limitation of Authority**","**Litigation and Arbitration Expenses and Awards**","**Non-Circumvent**","**Non-Solicit**","**Provisions Severable**","**Relationship of Parties**","**SELLING AGREEMENT**","**Sale of Securities**","**Successors.**","**Suitability**","**Termination**","**Timing of Commission Payment**","**Trail**","**[*","*]   \\centered [*","*] [*","*] a commission equal to two percent ([[Percentage 1: Number]]%) of the total dollar amount invested in the Units and sold by [*","*] and Brokers with a copy of the Memorandum and warrants that all information set forth in such Memorandum is true and accurate and that [*","*] and IMH shall indemnify each company including its respective officers, directors, employees and agents, from and against all liability, loss, cost or expense (including attorney’s fees) by reason of liability arising out of or related to this agreement, whether caused by or contributed to by IMH or [*","*], Brokers and IMH acknowledge that the purpose and intent of this Agreement is to establish a selling agreement between [*","*], and Investors Mortgage Holdings, Inc. (“IMH”) whereby Registered Representatives (“Brokers”) through [*","*], can sell the Units offered in the Memorandum in accordance with applicable securities laws. Accordingly, Brokers remain independent contractors of [*","*]/Broker by paying [*","*]/Brokers agree that they have no authority to negotiate, commit, bind and/or appear in any manner to negotiate for, commit or bind IMH in any way. Any payments made by IMH to [*","*]/Brokers as selling agent of IMH and nothing herein shall be deemed to constitute [*","*]/Brokers by contacting their clients without [*","*]/Brokers by reason of any alleged act, omission, misrepresentation, violation of any state or federal securities laws, on the part of IMH, IMH agrees to indemnify, defend and hold [*","*]/Brokers for a future fund, IMH agrees to pay a commission to [*","*]/Brokers for any and all costs associated with their employees, their equipment and any other expense they incur in connection with performance of [*","*]/Brokers or IMH at any time and for any reason immediately upon receipt of written notice of such termination to the other party. In the event of termination, [*","*]/Brokers shall be solely liable for payment of their income tax, self-employment tax and any other applicable taxes. [*","*]/Brokers shall comply with all rules and regulations of the SEC, NASD, and any states in which offers or sales are conducted. The activity of the Brokers shall be supervised by [*","*]/Brokers shall not sell securities in any state unless [*","*]/Brokers shall offer and sell securities only to accredited investors with whom [*","*]/Brokers will not be compensated a second time. If client subsequently reinvests with a greater amount than that which was liquidated prior, [*","*]/Brokers’ clients after the initial purchase but shall exclude any dividends received and reinvested by said clients. If [*","“Act”","“Agreement”","“Brokers”","“IMH”","“LLC”","“Memorandum”","“Units”"]}}