{"metadata": {"organization_names": [], "person_names_verified": ["stephen t. burdumy", "charles deskins", "dennis harkins", "bruno guazzoni", "claudio guazzoni"], "organization_names_verified": ["rockport investments ltd", "bank of america", "drinker biddle & reath", "rockport investments ltd.", "zanett commercial solutions"], "vars": {"Party": {"Zanett, Inc.": "[[Party 1]]"}}, "entities_rejected": [], "person_names": [], "agreement_id": "cbd53e843bcb25a38431fcf6f56e94ad15a22422037cad06642cfca3356e143a", "topics": [], "terms": ["\"**Agreement**\"", "\"**Closing Date**\"", "\"**Closing**\"", "\"**Company Convertible Debt**\"", "\"**Company**\"", "\"**Convertible Note**\"", "\"**Investor**\"", "\"**Line of Credit**\"", "\"**Maturity Date**\"", "\"**Mr. Guazzoni**\"", "\"**Promissory Notes**\"", "\"**Transaction Approval Agreement**\"", "\"**Voting Agreement**\"", "\"Material Adverse Effect**\"", "\"Maturity Date\"", "\"Securities Act**\"", "** Assuming the accuracy of the representations and warranties of the Investor contained in Article III hereof, the offer, sale and issuance of the Company Convertible Debt and the common stock issuable upon conversion of the Company Convertible Debt will be exempt from the registration requirements of the Securities Act of 1933, as amended (the \"Securities Act**\"", "** The Company is a corporation duly organized, validly existing and in good standing under the laws of the State of Delaware. The Company has all requisite corporate power and authority (a) to own and lease its properties and assets and to carry on its business as now conducted and as presently proposed to be conducted, (b) to execute and deliver this Agreement, the promissory note evidencing the Company Convertible Debt (the \"**", "** The Company is not in violation of or default (with or without the passage of time or giving of notice) under (a) any term of its Certificate of Incorporation or Bylaws, (b) any provision of any mortgage, indenture, agreement, instrument, arrangement or oral or written contract to which the Company is a party or by which it is bound or (c) any judgment, decree, order, writ, injunction, law, statute, rule, regulation or restriction of any domestic or foreign government (whether federal, state or local, including any political subdivision, department, instrumentality, commission, board, bureau or agency thereof, and any other regulatory or administrative body, a \"Governmental Entity**\"", "** The execution, delivery and performance of, and compliance with, this Agreement, the Convertible Note and the issuance of the Company Convertible Debt and the common stock issuable upon conversion of the Company Convertible Debt will not, with or without the passage of time or giving of notice, (a) violate, be in conflict with or constitute a default under (i) any term of the Company’s Certificate of Incorporation or Bylaws, (ii) any provision of any mortgage, indenture, contract, agreement, instrument or contract to which the Company is party or by which it is bound, or (iii) any judgment, decree, order, writ, injunction, law, statute, rule, regulation or restriction of any Governmental Entity applicable to the Company, or (b) result in (i) the creation of any mortgage, pledge, lien, claim, encumbrance or charge (each, an \"Encumbrance**\"", "**\") and any other agreements, documents and instruments to be delivered by the Company that are contemplated in, or delivered pursuant to, this Agreement or the Convertible Note, (c) to issue the Company Convertible Debt and (d) to carry out the provisions of this Agreement and the Convertible Note. The Company is duly qualified and is authorized to do business and is in good standing as a foreign corporation in all jurisdictions in which the nature of its activities and of its properties makes such qualification necessary, except for those jurisdictions in which a failure to be so qualified or authorized would not have a material adverse effect on the properties, assets, liabilities, financial condition, business, operations of the Company (a \"Material Adverse Effect**\"", "**.**", "**2010 Annual Meeting of Stockholders****", "**AMENDMENT OF PROMISSORY NOTES AND LINE OF CREDIT; FORBEARANCE**", "**Amendment and Waiver**", "**Amendment of Promissory Notes**", "**Assignment; Binding Effect****", "**Authorization****", "**Authorization; Binding Obligations****", "**COMPANY:**", "**CONDITIONS TO CLOSING**", "**COVENANTS**", "**Capitalization****", "**Closing**", "**Compliance with Laws and Other Instruments**", "**Conditions to Closing**", "**Conditions to Company’s Closing Obligations**", "**Conditions to Investor’s Closing Obligations**", "**Construction****", "**Costs and Expenses****", "**Counterparts****", "**Cumulative Remedies; Failure to Pursue Remedies****", "**EXCHANGE OF PROMISSORY NOTES AND LINE OF CREDIT**", "**EXHIBIT A**", "**EXHIBIT B**", "**Entire Agreement****", "**Equitable Remedies****", "**Exhibit A**", "**Exhibit B**", "**FOR COMPANY CONVERTIBLE DEBT**", "**Finders’ Fees****", "**Forbearance**", "**Further Assurances****", "**Governing Law****", "**Headings****", "**Hedging Transactions**", "**IN WITNESS WHEREOF,**", "**INVESTOR:**", "**Investment Representations****", "**Issuance of Convertible Debt and Delivery of Promissory Note and Line of Credit****", "**Litigation****", "**MISCELLANEOUS**", "**Maturity Date**", "**NOW, THEREFORE,**", "**No Conflicts**", "**No Material Adverse Effect**", "**Notices****", "**Offering Valid**", "**Organization; Requisite Power**", "**Organization; Requisite Power****", "**Prevailing Party’s Costs and Expenses****", "**Publicity****", "**RECITALS**", "**REPRESENTATIONS AND WARRANTIES OF THE COMPANY**", "**REPRESENTATIONS AND WARRANTIES OF THE INVESTOR**", "**ROCKPORT INVESTMENTS LTD.**", "**Severability****", "**Subordination**", "**Survival****", "**TERM DEBT - CONVERTIBLE DEBT EXCHANGE AGREEMENT**", "**Transaction Approval Agreement**", "**Transfer Restrictions****", "**Voting Agreement**", "**WHEREAS,**", "**Waiver of Jury Trial****", "“**Forbearance Covenant**”", "“Subordination Agreement”"]}}