{"metadata": {"organization_names": ["morgan stanley smithbarney"], "person_names_verified": [], "organization_names_verified": ["willis group", "willis group holdings"], "vars": {}, "entities_rejected": [], "person_names": [], "agreement_id": "6638a7bb0f7b8e2dd32165a8634ee57c399d72b63820a09818ba650ca1e48584", "topics": [], "terms": ["**(AS AMENDED AND RESTATED ON DECEMBER 30, 2009 BY WILLIS GROUP HOLDINGS LIMITED AND AS AMENDED AND RESTATED AND ASSUMED BY WILLIS GROUP HOLDINGS PUBLIC LIMITED COMPANY ON DECEMBER 31, 2009)**", "**(AS AMENDED AND RESTATED ON DECEMBER 30, 2009 BY WILLIS GROUP HOLDINGS LIMITED AND AS AMENDED AND RESTATED AND ASSUMED BY WILLIS GROUP HOLDINGS PUBLIC LIMITED COMPANY**", "***Notifications***", "***Terms and Conditions***", "***may have different data privacy laws and protections from the Director’s country. The Director understands that he may request a list with the names and addresses of any potential recipients of the Data by contacting his local human resources representative. The Director authorizes the Company, Morgan Stanley SmithBarney and any other recipients of Data which may assist the Company (presently or in the future) with implementing, administering and managing the Plan to receive, possess, use, retain and transfer the Data, in electronic or other form, for the sole purpose of implementing, administering and managing his participation in the Plan. The Director understands that Data will be held only as long as is necessary to implement, administer and manage the Director’s participation in the Plan. The Director understands that he may, at any time, view Data, request additional information about the storage and processing of Data, require any necessary amendments to Data or refuse or withdraw the consents herein, in any case without cost, by contacting in writing his local human resources representative. The Director understands, however, that refusing or withdrawing his consent may affect the Director’s ability to participate in the Plan. For more information on the consequences of the Director’s refusal to consent or withdrawal of consent, the Director understands that he may contact his local human resources representative.***", "**APPENDIX TO**", "**Address:**", "**Director Costs**", "**Exchange Control Information**", "**FORM OF RESTRICTED SHARE UNITS AWARD AGREEMENT FOR NON-EMPLOYEE DIRECTORS**", "**Grant Date**", "**IRELAND**", "**Name**", "**Number of RSUs Granted**", "**ON DECEMBER 31, 2009)**", "**RESTRICTED SHARE UNITS AWARD AGREEMENT- ACCEPTANCE FORM FOR NON-EMPLOYEE DIRECTORS**", "**RESTRICTED SHARES UNITS AWARD AGREEMENT FOR NON-EMPLOYEE DIRECTORS**", "**SCHEDULE A**", "**SCHEDULE B**", "**Signature:**", "**UNITED KINGDOM**", "**UNITED STATES OF AMERICA**", "**WILLIS GROUP HOLDINGS [[Shares 1: Number]] SHARE PURCHASE AND OPTION PLAN**", "**WILLIS GROUP HOLDINGS [[Shares 1]] SHARE PURCHASE AND OPTION PLAN**", "*Accordingly, the Director is strongly advised to seek appropriate professional advice as to how the tax or other laws in the Director’s country apply to the Director’s situation.*", "*i.e*", "“Data”", "“Director”", "“FBAR”", "“NICs”", "“Ordinary Shares” or “Shares”", "“RSUs”", "“Shortfall”", "“Tax-Related Items”", "“Taxable Event”", "“Tax”"]}}