{"metadata": {"organization_names": ["kbsii pierre laclede center", "alley"], "person_names_verified": ["azucena dela cruz", "charles j. schreiber, jr.", "ford nelson", "jeri gehrer", "rodney richerson", "irie dadabhoy"], "organization_names_verified": ["kbsii pierre laclede center", "real estate group", "kbs capital advisors llc", "wells fargo bank"], "topics": [], "entities_rejected": [], "person_names": ["kbsii pierre"], "agreement_id": "46d1a4ce30d7ae119f317a2093021f45a94aaf3d4693a21e43c319a8bb302d64", "vars": {}, "terms": ["**ACCEPTANCE OF TRUST; POWERS AND DUTIES OF TRUSTEE**", "**ADDITIONAL PROVISIONS**", "**ADDRESS**", "**AND WHEN RECORDED MAIL TO:**", "**APPLICATION OF FORECLOSURE SALE PROCEEDS**", "**APPLICATION OF OTHER SUMS**", "**ASSIGNMENT**", "**BORROWER INFORMATION**", "**COMPENSATION; EXCULPATION; INDEMNIFICATION**", "**CONDITIONS TO EXERCISE OF RIGHTS**", "**CONTRACTS**", "**COVENANTS**", "**DAMAGES; INSURANCE AND CONDEMNATION PROCEEDS**", "**DEED OF TRUST**", "**DEFAULT**", "**DEFENSE AND NOTICE OF LOSSES, CLAIMS AND ACTIONS**", "**DEFENSES**", "**DESCRIPTION OF SUBJECT PROPERTY**", "**DUE ON SALE OR ENCUMBRANCE**", "**Date of Document**", "**EFFECT OF ASSIGNMENT**", "**ENFORCEABILITY**", "**ESTOPPEL CERTIFICATES**", "**EXECUTION IN COUNTERPARTS**", "**GRANT OF LICENSE**", "**GRANT**", "**GRANTOR INDEMNIFIES TRUSTEE AND BENEFICIARY AGAINST, AND HOLDS TRUSTEE AND BENEFICIARY HARMLESS FROM, ALL LOSSES, DAMAGES, LIABILITIES, CLAIMS, CAUSES OF ACTION, JUDGMENTS, COURT COSTS, ATTORNEYS’ FEES AND OTHER LEGAL EXPENSES, COST OF EVIDENCE OF TITLE, COST OF EVIDENCE OF VALUE, AND OTHER EXPENSES WHICH EITHER MAY SUFFER OR INCUR: (i) BY REASON OF THIS DEED OF TRUST; (ii) BY REASON OF THE EXECUTION OF THIS DEED OF TRUST OR IN PERFORMANCE OF ANY ACT REQUIRED OR PERMITTED HEREUNDER OR BY LAW; (iii) AS A RESULT OF ANY FAILURE OF GRANTOR TO PERFORM GRANTOR’S OBLIGATIONS; OR (iv) BY REASON OF ANY ALLEGED OBLIGATION OR UNDERTAKING ON BENEFICIARY’S PART TO PERFORM OR DISCHARGE ANY OF THE REPRESENTATIONS, WARRANTIES, CONDITIONS, COVENANTS OR OTHER OBLIGATIONS CONTAINED IN ANY OTHER DOCUMENT RELATED TO THE SUBJECT PROPERTY. THE ABOVE OBLIGATION OF GRANTOR TO INDEMNIFY AND HOLD HARMLESS TRUSTEE AND BENEFICIARY SHALL SURVIVE THE RELEASE AND CANCELLATION OF THE SECURED OBLIGATIONS AND THE RELEASE AND RECONVEYANCE OR PARTIAL RELEASE AND RECONVEYANCE OF THIS DEED OF TRUST.**", "**GRANTOR WILL, FROM TIME TO TIME, PAY THE COMPENSATION DUE TO TRUSTEE HEREUNDER AND REIMBURSE TRUSTEE FOR, AND INDEMNIFY AND HOLD HARMLESS TRUSTEE AGAINST, ANY AND ALL LIABILITY AND EXPENSES WHICH MAY BE INCURRED BY TRUSTEE IN THE PERFORMANCE OF TRUSTEE’S DUTIES.**", "**Grantee:**", "**Grantor****", "**Grantor:**", "**INCIDENTAL TO THE DEALINGS OF THE PARTIES HERETO OR ANY OF THEM WITH RESPECT TO THE LOAN DOCUMENTS (AS NOW OR HEREAFTER MODIFIED) OR ANY OTHER INSTRUMENT, DOCUMENT OR AGREEMENT EXECUTED OR DELIVERED IN CONNECTION HEREWITH, OR THE TRANSACTIONS RELATED HERETO OR THERETO, IN EACH CASE WHETHER NOW EXISTING OR HEREAFTER ARISING, AND WHETHER SOUNDING IN CONTRACT OR TORT OR OTHERWISE; AND EACH PARTY AND BENEFICIARY HEREBY AGREES AND CONSENTS THAT ANY PARTY TO THIS DEED OF TRUST AND BENEFICIARY MAY FILE AN ORIGINAL COUNTERPART OR A COPY OF THIS SECTION WITH ANY COURT AS WRITTEN EVIDENCE OF THE CONSENT OF THE PARTIES HERETO AND BENEFICIARY TO THE WAIVER OF THEIR RIGHT TO TRIAL BY JURY.**", "**INCORPORATION**", "**INTEGRATION; INTERPRETATION**", "**LAWFULNESS AND REASONABLENESS**", "**LIENS, ENCUMBRANCES AND CHARGES**", "**LIMITATIONS ON RECOURSE**", "**Legal description:**", "**MAINTENANCE AND PRESERVATION OF THE SUBJECT PROPERTY**", "**MERGER**", "**MISSOURI COLLATERAL PROTECTION ACT NOTICE**", "**MISSOURI LAW**", "**MISSOURI PENNY LEASE**", "**NO CURE OR WAIVER**", "**NON-BORROWER GRANTOR RIDER**", "**NOTICES**", "**OBLIGATIONS OF GRANTOR, JOINT AND SEVERAL**", "**OBLIGATIONS SECURED**", "**OBLIGATIONS**", "**PAYMENT OF COSTS, EXPENSES AND ATTORNEYS’ FEES**", "**PERFORMANCE OF SECURED OBLIGATIONS**", "**POSSESSION AND USE OF COLLATERAL**", "**POWER OF ATTORNEY**", "**POWER TO FILE NOTICES AND CURE DEFAULTS**", "**POWERS OF BENEFICIARY**", "**Parcel 1:**", "**Parcel 2**", "**Parcel 3:**", "**Parcel 4**", "**RECONVEYANCE**", "**RECORDING REQUESTED BY**", "**RECOURSE TO SEPARATE PROPERTY**", "**REINSTATEMENT OF LIEN**", "**RELEASES, EXTENSIONS, MODIFICATIONS AND ADDITIONAL SECURITY**", "**REPRESENTATIONS AND WARRANTIES**", "**RIGHT OF INSPECTION**", "**RIGHTS AND REMEDIES**", "**RIGHTS OF BENEFICIARY ON DEFAULT**", "**RIGHTS OF BENEFICIARY**", "**RULES OF CONSTRUCTION**", "**Reference(s) to Book(s) and Page(s):**", "**SECURITY AGREEMENT AND FIXTURE FILING**", "**SECURITY INTEREST**", "**SUBORDINATION**", "**SUBROGATION**", "**SUBSTITUTION OF TRUSTEES**", "**SUCCESSORS IN INTEREST**", "**Statutory Mailing Addresses:**", "**TAX AND INSURANCE IMPOUNDS**", "**TAXES AND ASSESSMENTS**", "**THIS DEED OF TRUST SECURES A NOTE WHICH PROVIDES FOR A VARIABLE INTEREST RATE AND THE RIGHT TO REPAY AND REBORROW ON A REVOLVING BASIS**", "**THIS DEED OF TRUST SECURES FUTURE ADVANCES AND FUTURE OBLIGATIONS AS PERMITTED BY §443.055 OF THE REVISED STATUTES OF MISSOURI, AS IT MAY BE AMENDED FROM TIME TO TIME. THIS DEED OF TRUST IS GOVERNED BY SAID §443.055. THE FACE AMOUNT SECURED BY THIS DEED OF TRUST IS $[[USD Value 1: Number]] PLUS INTEREST AND OTHER OBLIGATIONS AS PROVIDED HEREIN AND PERMITTED BY RSMO. §443.055.**", "**TITLE**", "**Title of Document:**", "**WAIVER OF MARSHALLING RIGHTS**", "**WAIVER OF RIGHT OF REDEMPTION**", "**WAIVER OF RIGHT TO TRIAL BY JURY. TO THE EXTENT PERMITTED BY THEN APPLICABLE LAW, EACH PARTY TO THIS DEED OF TRUST, AND BY ITS ACCEPTANCE HEREOF, BENEFICIARY, HEREBY EXPRESSLY WAIVES ANY RIGHT TO TRIAL BY JURY OF ANY CLAIM, DEMAND, ACTION OR CAUSE OF ACTION (a) ARISING UNDER THE LOAN DOCUMENTS, INCLUDING, WITHOUT LIMITATION, ANY PRESENT OR FUTURE MODIFICATION THEREOF OR (b) IN ANY WAY CONNECTED WITH OR RELATED OR**", "**WITH ABSOLUTE ASSIGNMENT OF LEASES AND RENTS,**", "**[Remainder of Page Intentionally Blank]**", "*Space Above Line Reserved for Recorder’s Use*", "“Beneficiary”", "“Borrowers”", "“Borrower”", "“Deed of Trust”", "“Grantor”", "“Improvements”", "“Interested Parties”", "“Leases”", "“License”", "“Loan Agreement”", "“Loan Documents”", "“Other Property”", "“Payments”", "“Secured Obligations”", "“Trustee”", "“UCC”"]}}