{"metadata": {"organization_names": [], "person_names_verified": ["chet hebert", "harold h. montgomery", "laird q. cagan", "harold h. montgomergy"], "organization_names_verified": ["cfsc", "calpian inc", "toyzap.com, inc.", "colorado financial service corp.", "calpian, inc."], "topics": [], "entities_rejected": [], "person_names": ["stevens creek blvd"], "agreement_id": "ef37e579269de786fa711c1b45fcdb64b57cde5907920b3d3fa7d9308cc66d7c", "vars": {}, "terms": ["*(“CFSC”), its affiliates, the partners, directors, officers, agents and employees of CFSC and its affiliates, and each other person or entity, if any, controlling CFSC or any of its affiliates (each, an “Indemnified Person”), from and against any third-party losses, claims, damages, liabilities or expenses (including actions, claims or proceedings in respect thereof (collectively, “Proceedings”) brought by or against any person, including stockholders of the Company, and the cost of any investigation and preparation therefor and defense thereof) (collectively, “Losses”) arising out of or in connection with (i) advice or services rendered or to be rendered by any Indemnified Person pursuant to the letter agreement, (ii) the transactions contemplated by the letter agreement or (iii) any Indemnified Person’s actions or inactions in connection with any such advice, services or transactions; provided, however, that the Company will not be obligated to indemnify for any Losses of any Indemnified Person that are determined by a court of competent jurisdiction in a final judgment not subject to appeal to have resulted solely from the bad faith or gross negligence of such Indemnified Person. The Company also agrees that no Indemnified Person shall have any liability (whether direct or indirect, in contract or tort or otherwise) to the Company in connection with (i) advice or services rendered or to be rendered by any Indemnified Person pursuant to the letter agreement, (ii) the transactions contemplated by the letter agreement or (iii) any Indemnified Person’s actions or inactions in connection with any such advice, services or transactions, except to the extent such liabilities are determined by a court of competent jurisdiction in a final judgment not subject to appeal to have resulted from the bad faith or gross negligence of such Indemnified Person. The Company agrees that in no event will CFSC be liable or obligated in any manner for any consequential, exemplary or punitive damages or lost profits arising out of the letter agreement or the services provided thereunder, and the Company agrees not to seek or claim any such damages or profits in any circumstance.*", "***Colorado Financial Service Corp.***", "***Colorado***", "***Financial Service Corporation***", "**Annex A**", "**CALPIAN, INC.**", "**CFSC:**", "**COLORADO FINANCIAL SERVICE CORP.**", "**Calpian, Inc**", "*Annex A*", "*Chet Hebert*", "*Chief Executive Officer*", "*Compensation*", "*Confidentiality.*", "*Harold H. Montgomergy*", "*If for any reason the foregoing indemnification is unavailable to any Indemnified Person or insufficient to hold it harmless, then the Company shall contribute to the amount paid or payable by such Indemnified Person as a result of such Losses in such proportion as is appropriate to reflect the relative economic interests of the Company, its affiliates and its stockholders on the one hand and the Indemnified Person on the other in the matters contemplated by the letter agreement as well as the relative fault of the Company, its affiliates or its stockholders, on the one hand, and such Indemnified Person, on the other; provided, however, that in no event shall the Indemnified Persons as a whole be required to contribute an amount greater than the amount of all fees actually received by CFSC from the Company under the letter agreement.*", "*Indemnification*", "*Laird Q. Cagan*", "*Managing Director*", "*Miscellaneous*", "*President and Chief Executive Officer*", "*Services.*", "*Term*", "*The Company also agrees to reimburse each Indemnified Person for all expenses (including fees and expenses of counsel) as they are incurred by such Indemnified Person in connection with investigating, preparing for or defending any Proceeding (or enforcing the letter agreement or any related engagement or commitment agreement), whether or not in connection with pending or threatened litigation in which any Indemnified Person is a party.*", "*The Company will indemnify and hold harmless*", "*The Company’s reimbursement, indemnity and contribution obligations hereunder shall be in addition to any liability that it may otherwise have, and shall inure to the benefit of any successors, assigns, heirs and representatives of any Indemnified Person. Solely for the purpose of enforcing the letter agreement, the Company hereby consents to personal jurisdiction and venue in any court in which any Proceeding is brought. The provisions of this Annex A shall survive any termination or other expiration of the letter agreement, the consummation of any transaction contemplated thereby or the other completion of CFSC’s services with respect thereto.*", "“*Company*”", "“*you*”", "“*you*” or the “*Company*”", "“CFSC”", "“Offering”", "“Securities”", "“Term”"]}}