{"metadata": {"organization_names": [], "person_names_verified": [], "organization_names_verified": ["churchill financial cayman ltd.", "churchill financial cayman ltd**.", "body central acquisition corp.", "catalogue ventures", "body shop of america"], "topics": [], "entities_rejected": [], "person_names": [], "agreement_id": "886baa830dd58f9b5b0de40610a2c0fc3f0f348a61ff7dc16a87b2b2b9b7b7fc", "vars": {"Party": {"Borrowers, each Person listed as a “Guarantor” on the signature pages thereto, Dymas Funding Company, LLC": "[[Party 1]]", "Churchill Financial Cayman Ltd., as Syndication Agent, NewStar Financial, Inc.": "[[Party 2]]"}}, "terms": ["**$[[USD Value 1: Number]]**", "**$[[USD Value 2: Number]]**", "**$[[USD Value 3: Number]]**", "**, BODY SHOP OF AMERICA, INC**", "**AMENDED AND SUBSTITUTE REVOLVING NOTE**", "**AMENDED AND SUBSTITUTE TERM LOAN A NOTE**", "**AMENDED AND SUBSTITUTE TERM LOAN B NOTE**", "**BODY SHOP OF AMERICA, INC**", "**BODY SHOP OF AMERICA, INC.**", "**CATALOGUE VENTURES, INC**", "**CHURCHILL FINANCIAL CAYMAN LTD**", "**CHURCHILL FINANCIAL CAYMAN LTD.**", "**FOR VALUE RECEIVED**", "**FOUR MILLION NINE HUNDRED SIXTY-TWO THOUSAND FOUR HUNDRED SIX AND 01/100 DOLLARS ($[[USD Value 2]])**", "**FOUR MILLION THREE HUNDRED THIRTY THOUSAND EIGHT HUNDRED TWENTY-SEVEN AND 07/100 DOLLARS ($[[USD Value 3]])**", "**IN WITNESS WHEREOF**", "**THIS REVOLVING NOTE HAS BEEN DELIVERED AT AND SHALL BE DEEMED TO HAVE BEEN MADE AT NEW YORK CITY, NEW YORK AND SHALL BE INTERPRETED AND THE RIGHTS AND LIABILITIES OF THE PARTIES HERETO SHALL BE DETERMINED IN ACCORDANCE WITH THE INTERNAL LAWS AND DECISIONS OF THE STATE OF NEW YORK WITHOUT REGARD TO CONFLICTS OF LAW PROVISIONS.**", "**THIS TERM NOTE HAS BEEN DELIVERED AT AND SHALL BE DEEMED TO HAVE BEEN MADE AT NEW YORK CITY, NEW YORK AND SHALL BE INTERPRETED AND THE RIGHTS AND LIABILITIES OF THE PARTIES HERETO SHALL BE DETERMINED IN ACCORDANCE WITH THE INTERNAL LAWS AND DECISIONS OF THE STATE OF NEW YORK WITHOUT REGARD TO CONFLICTS OF LAW PROVISIONS.**", "**TWO MILLION SEVEN HUNDRED SIX THOUSAND SEVEN HUNDRED SIXTY-SIX AND 92/100 DOLLARS ($[[USD Value 1]])**", "**[[Date 1: Date]]**", "**[[Date 1]]**", "*[Remainder of Page Intentionally Left Blank; Signature Page Follows]*", "“Administrative Agent”", "“BSOA”", "“CV”; CV and BSOA are hereinafter sometimes referred to individually as a “Borrower” and collectively as “Borrowers”", "“Existing Note”", "“Lenders”", "“Lender”", "“Revolving Note”", "“Term Note”"]}}