{"metadata": {"organization_names": [], "person_names_verified": ["edward e. whitacre", "christopher liddell", "greg lau", "christopher p. liddell"], "organization_names_verified": ["general motors company"], "topics": [], "entities_rejected": [], "person_names": [], "agreement_id": "a41d52b43471c17a89fe661aa192cd7f404b40bea5e7375900fc4f02bf0e5458", "vars": {}, "terms": ["***   Compensation is subject to determination by the Executive Compensation Committee of the Board of Directors. Compensation plans may be amended, changed or terminated at any time by the Committee. Also as a TARP recipient, approval of the U.S. Treasury’s Special Master must be obtained for all compensation payments and structures for SEOs and other most highly compensated employees.**", "**/s/ Christopher P. Liddell**", "**/s/ Edward E. Whitacre, Jr.**", "**3645 Evergreen Point Road**", "**AMOUNT**", "**As a GM executive in the United States, you will be entitled to GM’s standard package of benefits and perquisites available to executives at your level as set forth in the Overview. Your participation in these plans, as well as any compensation plans, will be controlled by the terms of those plans and they can be amended, changed or terminated at any time as applicable to similarly situated participants.**", "**Attachment**", "**COMMENTS**", "**Chief Financial Officer**", "**Christopher Liddell**", "**Christopher P. Liddell**", "**DIRECT COMPENSATION***", "**Date**", "**Dear Chris:**", "**If you are unable to start on [[Date 2]], a portion of the RSU grant will be moved to salary stock to maintain the RSU value of / of total annual compensation for calendar year 2010.**", "**Medina, WA 98030**", "**Mr. Christopher P. Liddell**", "**On behalf of General Motors, I am pleased to extend to you an offer of employment as Vice Chairman and Chief Financial Officer of General Motors. This position reports directly to me in my capacity as Chairman and CEO. The tentative start date is [[Date 2: Date]]. You will be located at our headquarters office in [[Address 1: Address]]. The terms of the offer are set forth on the attached “Overview of Total Compensation and Benefits” (the “Overview”) as modified in discussions with Greg Lau today.**", "**Please note that you will need to satisfactorily complete a drug screening, as well as a background and security screening, as a condition of your employment.**", "**Sincerely,**", "**TOTAL COMPENSATION AND BENEFITS OVERVIEW**", "**We look forward to welcoming you to General Motors.**", "**[[Date 1: Date]]**", "**[[Date 3: Date]]**", "**not forfeitable**", "“Overview”"]}}