{"metadata": {"organization_names": [], "person_names_verified": [], "organization_names_verified": ["cede & co", "the depository trust company", "a new york corporation"], "topics": [], "entities_rejected": [], "person_names": [], "agreement_id": "9f3a063a3f0645ba407d8629ea536f16d8e543651454d4b7ee966963c9846e80", "vars": {"Party": {"OGE ENERGY CORP.": "[[Party 1]]", "UMB BANK": "[[Party 2]]"}}, "terms": ["**   \\centered **", "**   \\centered _______________________   \\centered **", "**ABBREVIATIONS**", "**Authorized Denominations**", "**CUSIP:**", "**DATED AS OF [[Date 1: Date]]**", "**Definitions; References to Articles and Sections; Terms referring to this Supplemental Indenture**", "**Designation and Principal Amount**", "**EXHIBIT A**", "**FORM OF SECURITY**", "**FORM OF**", "**FROM**", "**Form of­­­­**", "**INTEREST RATE:**", "**Integral Part of Indenture**", "**Interest Payment Dates**", "**MATURITY DATE:**", "**MISCELLANEOUS**", "**NUMBER: R-**", "**ORIGINAL ISSUE DATE(S):**", "**Office for Payment**", "**PRINCIPAL AMOUNT(S):**", "**Provision for execution in counterparts; Table of Contents and descriptive headings of Articles not to affect meaning**", "**RELATION TO INDENTURE; DEFINITIONS**", "**Recitals of fact, except as stated, are statements of the Company**", "**Redemption Provisions**", "**References to either party in Supplemental Indenture include successors or assigns**", "**Reopening of Series**", "**SECURITIES**", "**SECURITY**", "**SUPPLEMENTAL INDENTURE NO.**", "**Stated Maturity Date**", "**Supplemental Indenture to be construed as a part of the Indenture**", "**TABLE OF CONTENTS**", "**TO**", "**Trust Indenture Act to control; Severability of provisions contained in Supplemental Indenture and Securities**", "**[Repayment of Securities**", "“Company”", "“DTC”", "“Indenture”", "“Option to Elect Repayment” on the Security duly completed) will be received at the Trustee’s corporate trust office, no later than five Business Days after the date of such telegram, telex, facsimile transmission or letter and such Security and form duly completed are received at the Trustee’s office, by such fifth Business Day. Effective exercise of the repayment option by the holder of any Security shall be irrevocable. No transfer or exchange of any Security (or, in the event that any Security is to be repaid in part, such portion of the Security to be repaid) will be permitted after exercise of the repayment option. The repayment option may be exercised by the Holder of a Security for less than the entire principal amount of the Security, provided the principal amount which is to be repaid is set forth on the form entitled “Option to Elect Repayment” on the Security and is equal to $[[USD Value 1: Number]] or any integral multiple thereof. All questions as to the validity, eligibility (including time of receipt) and acceptance of any Security for repayment will be determined by the Company, whose determination will be final, binding and non-appealable. Upon timely delivery of a Security to the Trustee with the “Option to Elect Repayment” form completed in accordance with the foregoing, the outstanding principal amount of such Security (or portion thereof indicated on the “Option to Elect Repayment”", "“Option to Elect Repayment” on this Global Security duly completed) will be received at the Trustee’s corporate trust office, no later than five Business Days after the date of such telegram, telex, facsimile transmission or letter and this Global Security and form duly completed are received at the Trustee’s office, by such fifth Business Day. Effective exercise of the repayment option by the Holder of any Security of this Series shall be irrevocable. No transfer or exchange of any Security of this Series (or, in the event that any Security of this Series is to be repaid in part, such portion of the Security of this Series to be repaid) will be permitted after exercise of the repayment option. The repayment option may be exercised by the Holder of a Security of this Series for less than the entire principal amount of the Security of this Series, provided the principal amount which is to be repaid is set forth on the form entitled “Option to Elect Repayment” on the Security of this Series and is equal to $[[USD Value 1]] or any integral multiple thereof. All questions as to the validity, eligibility (including time of receipt) and acceptance of any Security of this Series for repayment will be determined by the Company, whose determination will be final, binding and non-appealable. Upon timely delivery of a Security of this Series to the Trustee with the “Option to Elect Repayment” form completed in accordance with the foregoing, the outstanding principal amount of such Security of this Series (or portion thereof indicated in the “Option to Elect Repayment”", "“Securities of this Series”, which term includes any Global Securities representing such Securities) of the Company issued and to be issued under an Indenture dated as of November 1, 2004 between the Company and [[Trustee]], N.A. as trustee (the “Trustee”, which term includes any successor Trustee under the Indenture) (the “Indenture”", "“Securities”", "“Trustee”"]}}