{"metadata": {"organization_names": [], "person_names_verified": ["curtis c. hunter"], "organization_names_verified": ["matthews international", "two mellon bank center", "citizens bank"], "vars": {"Party": {"the Banks and Citizens Bank of Pennsylvania, as agent for the Banks": "[[Party 2]]", "Matthews International Corporation": "[[Party 1]]"}}, "entities_rejected": [], "person_names": [], "agreement_id": "48bf0ad2a66735aee4a1063a96a69fd5007a50ce21b18483e4e7a81cb5e3823f", "topics": [], "terms": ["\"Agreement\"", "\"Bank\" and collectively, the \"Banks\"", "\"Citizens\"", "\"Company\"", "\"Debtor Liabilities\"", "\"Debtor\"", "\"Event of Default\"", "\"Guarantor\"", "\"Loan Agreement\"", "\"Obligor\"", "**ACCELERATION OF THE GUARANTOR'S LIABILITIES**", "**ACKNOWLEDGMENT**", "**BANKRUPTCY OF THE DEBTOR**", "**Bankruptcy of the Debtor**", "**CONTINUING GUARANTOR**", "**EXTENT OF GUARANTOR'S LIABILITY**", "**FINANCIAL STATEMENTS OF THE GUARANTOR**", "**GUARANTY AND SURETYSHIP AGREEMENT**", "**MISCELLANEOUS**", "**NOTICE TO THE AGENT AND THE BANKS BY THE GUARANTOR**", "**PAYMENT OF COSTS**", "**PRIMARY LIABILITY OF THE GUARANTOR**", "**RIGHT OF SET-OFF**", "**RIGHTS OF THE GUARANTOR**", "**UNCONDITIONAL LIABILITY**", "**WAIVER OF TRIAL BY JURY. THE UNDERSIGNED HEREBY EXPRESSLY, KNOWINGLY AND VOLUNTARILY WAIVES ALL BENEFIT AND ADVANTAGE OF ANY RIGHT TO A TRIAL BY JURY, AND IT WILL NOT AT ANY TIME INSIST UPON, OR PLEAD OR IN ANY MANNER WHATSOEVER CLAIM OR TAKE THE BENEFIT OR ADVANTAGE OF A TRIAL BY JURY IN ANY ACTION ARISING IN CONNECTION WITH THIS AGREEMENT OR ANY OF THE OTHER LOAN DOCUMENTS.**", "**WAIVER**", "**WARRANT OF ATTORNEY TO CONFESS JUDGMENT. THE GUARANTOR HEREBY IRREVOCABLY AUTHORIZES AND EMPOWERS THE PROTHONOTARY, ANY ATTORNEY OR ANY CLERK OF ANY COURT OF RECORD, WITH OR WITHOUT THE OCCURRENCE OF AN EVENT OF DEFAULT, TO APPEAR FOR AND CONFESS JUDGMENT AGAINST THE GUARANTOR FOR SUCH SUMS AS ARE DUE AND/OR MAY BECOME DUE UNDER THIS AGREEMENT, WITH OR WITHOUT DECLARATION, WITH COSTS OF SUIT, WITHOUT STAY OF EXECUTION AND WITH AN AMOUNT EQUAL TO FIFTEEN PERCENT ([[Percentage 2: Number]]%) OF THE AMOUNT OF SUCH JUDGMENT BUT NOT LESS THAN TEN THOUSAND AND 00/100 DOLLARS ($[[USD Value 1: Number]]) ADDED FOR ATTORNEYS' COLLECTION FEES. TO THE EXTENT PERMITTED BY LAW, OTHER THAN MANIFEST ERROR, THE GUARANTOR RELEASES ALL ERRORS IN SUCH PROCEEDINGS. IF A COPY O F THIS AGREEMENT, VERIFIED BY AFFIDAVIT BY OR ON BEHALF OF THE HOLDER OF THIS AGREEMENT SHALL HAVE BEEN FILED IN SUCH ACTION, IT SHALL NOT BE NECESSARY TO FILE THE ORIGINAL AGREEMENT AS A WARRANT OF ATTORNEY. THE AUTHORITY AND POWER TO APPEAR FOR AND CONFESS JUDGMENT AGAINST THE GUARANTOR SHALL NOT BE EXHAUSTED BY THE INITIAL EXERCISE THEREOF AND MAY BE EXERCISED AS OFTEN AS THE HOLDER SHALL FIND IT NECESSARY AND DESIRABLE AND THIS AGREEMENT OR A COPY THEREOF SHALL BE A SUFFICIENT WARRANT THEREFOR. THE HOLDER HEREOF MAY CONFESS ONE OR MORE JUDGMENTS IN THE SAME OR DIFFERENT JURISDICTIONS FOR ALL OR ANY PART OF THE AMOUNT OWING HEREUNDER, WITHOUT REGARD TO WHETHER JUDGMENT HAS THERETOFORE BEEN CONFESSED ON MORE THAN ONE OCCASION FOR THE SAME AMOUNT. IN THE EVENT ANY JUDGMENT CONFESSED AGAINST THE GUARANTOR HEREUNDER IS STRICKEN OR OPENED UPON APPLICATION BY OR ON THE GUARANTOR’S BEHALF FOR ANY REASON, THE HOLDER IS HEREBY AUTHORIZED AND EMPOWERED TO AGAIN APPEAR FOR AND CONFESS JUDGMENT AGAINST THE GUARANTOR FOR ANY PART OR ALL OF THE AMOUNTS OWING HEREUNDER, AS PROVIDED FOR HEREIN, IF DOING SO WILL CURE ANY ERRORS OR DEFECTS IN SUCH PRIOR PROCEEDINGS.**"]}}