{"metadata": {"organization_names": [], "person_names_verified": ["doran n. schwartz"], "organization_names_verified": ["cascade natural gas company", "cascade natural gas corporation", "plains natural gas co.", "williston basin interstate pipeline company", "whc, ltd.", "wbi holdings", "wagner industrial electric, inc.", "montana-dakota utilities co.", "knife river corporation", "great plains natural gas co.", "young contractors, inc.", "frebco, inc.", "fairbanks materials, inc.", "bell electrical contractors, inc.", "connolly-pacific co.", "concrete, inc.", "baldwin contracting company", "anchorage sand & gravel company", "the mdu resources group", "mdu resources group"], "topics": [], "entities_rejected": [], "person_names": ["wagner smith"], "agreement_id": "3fa47807c0888185beba0d8a42ae90e79ca46dbf9d7aede74d650f9c57c55b6b", "vars": {}, "terms": ["**(Original Effective Date)**", "**(Original Effective Date**", "**30th**", "**401(k) RETIREMENT PLAN**", "**Benefit Claims Procedure; Review Procedure**", "**Current Effective Date**", "**Eligibility to Share in the Profit Sharing Feature**", "**Eligibility to Share in the Retirement Contribution, Special Transition Contribution, and Profit Sharing Feature**", "**Explanation: This amendment adds Great Plains Natural Gas Co. (“GPNG”), a sister entity to Montana-Dakota Utilities Co.; clarifies GPNG became a Participating Affiliate of Supplement D-1 of the Plan as of [[Date 3]] with GPNG only receiving a profit sharing contribution when Montana-Dakota Utilities Co. meets its combined profitability targets; clarifies that employees of the Total Corrosion Solutions division of Bitter Creek are excluded from this feature as of [[Date 2]]; clarifies that service hours are**", "**Explanation: This amendment aligns administrative practice with the document by clarifying that hours are determined based on hours compensated during the Plan Year rather than hours worked during the Plan Year.**", "**Explanation: This amendment clarifies that the last day requirement is met for employees of any Utility Group Participating Affiliate as long as they are employed with any one of the Utility Group Participating Affiliates on the last day of the Plan Year.**", "**Explanation: This amendment reduces the statute of limitations to file a lawsuit against the Plan or its fiduciaries from 180 days to 60 days, as allowed under recently passed legislation.**", "**Explanation: This amendment removes the variable match feature from the Plan as it is not being utilized or offered to any Participating Affiliate.**", "**INSTRUMENT OF AMENDMENT TO THE**", "**MDU RESOURCES GROUP, INC.**", "**Matching Contributions**", "**Participating Affiliate**", "**Provisions Relating to the Cascade Natural Gas Corporation Retirement Contribution, Special Transition Contribution, and Profit Sharing Feature**", "**Provisions Relating to the Profit Sharing Feature for Certain Participating Affiliates**", "**Variable Match**", "**determined based on hours compensated during the Plan Year rather than hours worked; and clarifies that the last day requirement is met for employees of any Utility Group Participating Affiliate as long as they are employed with any one of the Utility Group Participating Affiliates on the last day of the Plan Year.**", "“EBC”", "“GPNG”", "“Plan”", "“Utility Group Participating Affiliate”"]}}