{"metadata": {"organization_names": [], "person_names_verified": [], "organization_names_verified": ["nexx systems"], "topics": [], "entities_rejected": [], "person_names": [], "agreement_id": "d7d2890e0f320a855666194f443a6dc0000ca537f885df96bc9915b08d4040ff", "vars": {"Party": {"NEXX SYSTEMS, INC.": "[[Party 2]]", "DAKOTA SYSTEMS, INC.": "[[Party 1]]"}}, "terms": ["**Confidentiality; Improvements.**", "**Indemnification.**", "**Independent Contractor Status.**", "**Insurance.**", "**Inventory; Risk of Loss.**", "**Miscellaneous.**", "**Notice of Claims; Information.**", "**Pricing; Terms and Conditions of Purchase.**", "**Purchase of Requirements.**", "**Requirement Forecasts by Buyer.**", "**Settlement of Claims.**", "**Term.**", "**Termination.**", "**Warranty; Seller Facilities and Manufacturing.**", "**[ *", "**provided, however,**", "*] Rolling Forecasts or has acquired other inventory for such purpose which may not be returned by Seller and is not capable of being used by Seller in the normal course of Seller's business operations, upon the expiration or any earlier termination of this Agreement, Buyer shall purchase all of such custom and other inventory as aforesaid from Seller and all finished Products being held in inventory by Seller at an amount equal to [*", "*] after the cause of action has accrued, except in an action for non-payment may be brought within [*", "*] basis of Buyer's good faith estimate of the types, numbers and delivery dates of the Products which Buyer in good faith estimates it will order from Seller during the subsequent [*", "*] but must be submitted at least every [*", "*] days after receipt of written notice of such default or such longer period of time as shall be reasonable necessary to cure such default, provided that the defaulting party commences to cure such default within such [*", "*] days after the date of the closing of any such transaction by giving written notice to the non-Transferring Party within [*", "*] days after the date of the closing of the transaction pursuant to which the Transferring Party disposed of its business to such third party. Notwithstanding the foregoing, such third party, as successor to the Transferring Party hereunder, shall remain bound to perform all of the Transferring Party's obligations as set forth herein. Notwithstanding the foregoing, Buyer, at its option, may terminate its obligation to continue to use the Seller for such [*", "*] from the date of shipment. Seller agrees to use its reasonable efforts to have its vendors provide warranties for products sold to the Seller consistent with the terms of Buyer's then standard warranty. In the event that the Products, or any assembly or sub-assembly included within the Products, shall fail to conform to such written specifications during such [*", "*] of receipt of a Purchase Order, with standard terms and conditions and which has appeared in the rolling forecast for at least [*", "*] shall bear the risk of loss for all Products, and for any Buyer-owned inventory, tools and/or fixtures, [*", "*] shall bear the risk of loss thereof and shall be responsible for maintaining appropriate casualty insurance to cover any loss with respect thereto. Delivery of finished Products shall be made [*", "*] without the prior written consent of the Chief Financial Officer of the Buyer. In the event any such inventory held by Seller may be returned, but such return requires a restocking or similar charge to be paid by Seller, Buyer shall reimburse Seller for such charges within [*", "“Agreement”", "“Breaching Party”", "“Buyer”", "“Confidential Information”", "“Jointly Developed Improvements”", "“Non-Breaching Party”", "“Products”", "“Purchase Order”", "“Seller”", "“Term”", "“Transferring Party”"]}}