{"metadata": {"organization_names": [], "person_names_verified": ["xinjiang jiuzhoutong"], "organization_names_verified": ["xinjiang jiuzhoutong pharmaceutical medicine"], "vars": {"Party": {"Zhao Jine": "[[Party 5]]", "Cirald Daphne": "[[Party 4]]", "Yao Lun": "[[Party 6]]", "Tokay Tablet": "[[Party 3]]", "Chu JIingchao": "[[Party 2]]", "Yangling Dongke Maidisen Pharmaceuticial": "[[Party 1]]"}}, "entities_rejected": [], "person_names": ["bark paining"], "agreement_id": "7e4fca6733ffad2243a1ad600696eda43c0526e0d0fa6952d8935bee46e50589", "topics": [], "terms": ["\"the products\"", "**        **", "**     \\centered 葛丹兰胶囊   \\centered Gedanlan **", "**    **", "**   \\centered **", "**   \\centered 0.90   \\centered 仙蟾片   \\centered [[Party 3]]   \\centered 63.80   秦川通痹片板   \\centered **", "**   \\centered 1.80   \\centered 小儿止泻贴5×7×2贴   \\centered **", "**   \\centered 1.80   心欣舒胶囊板   \\centered **", "**   \\centered 10.00   金前感冒胶囊粒×3板   \\centered **", "**   \\centered 10.50   \\centered 血溶通脉颗粒   \\centered **", "**   \\centered 10.50   黄龙胶囊板   \\centered **", "**   \\centered 10.60   黄龙咳喘胶囊板   \\centered **", "**   \\centered 10.70   妇炎舒胶囊板   \\centered **", "**   \\centered 11.70   麝香壮骨膏帖袋   \\centered **", "**   \\centered 20.00   \\centered 伤湿止痛膏5×10×80贴   \\centered **", "**   \\centered 21.10   益肝乐颗粒袋   \\centered **", "**   \\centered 4.40   \\centered 复方祖师麻7×10×8贴   \\centered **", "**   \\centered 5.80   乙肝舒胶囊板   \\centered **", "**   \\centered 6.00   甘海胃康胶囊板   \\centered **", "**   \\centered 6.20   通脉颗粒袋   \\centered **", "**   \\centered 6.60   \\centered 伤湿止痛膏7×10×80贴   \\centered **", "**   \\centered 6.60   精制狗皮膏帖袋   \\centered **", "**   \\centered 7.40   妇炎舒胶囊板   \\centered **", "**   \\centered 7.60   胃复宁板   \\centered **", "**   \\centered 7.80   胃复宁胶囊板   \\centered **", "**   \\centered 8.00   秦川通痹片板   \\centered **", "**   \\centered 9.60   参归养血片板   \\centered **", "**   \\centered 9.70   乙肝舒胶囊板   \\centered **", "**   \\centered 9.80           咳喘膏贴×2袋   \\centered **", "**   黄龙止咳颗粒袋   \\centered **", "** ,Delicate Plaster.    5. The responsibilities and obligations of the three parties:    5.1 Party A shall provide access to marketing and management related to the required formalities for party B. Party A also needs to provide necessary product knowledge training and technical advice. Party A provides the collection of deposit of the market in the escrow services for the salesmen employed by Party B        5.2 If the managing staffs of the five division departments of Party A go to inspect and guide the sales of the agent market of party B, the travel expense, conference fees, office expenses, entertainment expenses is to be borne by Party A itself. When Party B and Party C participate in various business meetings, training sessions and other activities of Party A, the direct costs will be reimbursed by Party A.    5.3 Party B shall abide by the state drug laws and regulations. For it’s irregular operation, if ad approval is revoked, the patient complaints or any excuse extortion, media exposure which is caused by Party B but result in any adverse effects to Party A, party B will be fully responsible for all the costs.    5.4 Party B has the sole agency for the products of the company upon execution of this agreement in the designated area, to promote the products in the market.    5.5 If Party B needs a larger quantity of goods, 15 working dates after receiving the shipment notice of Party B, Party A will organize production and supply Party B with the demanded products.    5.6 The loss of party B caused by quality problems of goods, Party A will be in fully responsible for it. If the two sides have any dispute on the quality of the goods, the inspection report given by the statutory inspection department shall prevail. If party B finds quality problems when selling the goods, Party B should notify Party A to determine the quality information in details and offer help in the investigation and evidence collection, and deal with the follow-up matters together with Party A    5.7 Party B shall be very careful in the management of products in the valid time, and may not ask for return or replacement for non-quality problems. If there are any special circumstances, the replacement will be carried out according to the company Executive Returns system.    5.8 Party B and Party C both have the duty of confidentiality, compliance with industry ethics, and shall not disclose to a third party about the agreement during the expiration date and two years after the termination of contract.        6. The Commencement, Termination and Renewal:    6.1 The agreement will be valid from [[Date 1: Date]] to [[Date 2: Date]] only.    6.2 After the expiration of the cooperation, through the consultation of party A,B and C, the agreement can be re-signed. Party B which has completed more than [[Percentage 4: Number]]% of sales tasks will have the priority renewal rights.    6.3 The contract has been written in triplicate. Party A, Party B and Party C each has one copy and all the copied have the same legal effect.    6.4 Annexes of this agreement have the same legal effect as this agreement. In the event of dispute, the tripartite negotiate settlement, if the negotiations fail, venue for any action shall be in the Yangling District People's Court.    6.5 This Agreement has two annexes: the copy of Party C’s ID card and supply prices of the products    Party A: [[the products]] Co.,Ltd (seal)   For and on behalf the party A: [[Party 5]]   Party B: Xinjiang Jiuzhoutong pharmaceutical medicine co.,ltd (seal)   For and on behalf the party B: [[Party 6]]  **", "** [[Party 2]]     **", "**; the 5th Division is responsible for **", "**Capsule, Channels-soothing Granules, Qinchuan Rheumatism Relieving Tablet**", "**Channels-soothing Capsule, Heart Disease Relieving Capsule**", "**Gynecologic Inflammation Relieving Capsule, Jinqian Cold Capsule,**", "**Huanglong Cough Granules, Huanglong Cough & Dyspnea Capsules, Hepatopathy Relieving Granules, Hepatitis B Relieving and Curing Capsule, Stomach Recovery Capsule, Ganhai Stomach Recovery Capsule**", "**Number of the agreement:**", "**Party C:**", "**The Regional Sales Agency Agreement for Products in Xinjiang. Uygur Autonomous Region**", "**goods trafficking**", "**goods trafficking,**", "**×10×20 plasters   \\centered 5.70   小儿止泻贴贴   \\centered **", "**×10×8 plasters   \\centered 4.30          \\centered 复方祖师麻7×10×20   \\centered **"]}}