{"metadata": {"organization_names": ["the physical and environmental"], "person_names_verified": ["dale dossey", "charles mccord", "roger andres", "bob harvey", "dale a. dossey", "chris cook"], "organization_names_verified": ["number]]% cailey", "gaither petroleum corp.", "bp america production company", "gaither asset management", "harvest asset management", "mccord investments", "discovery data, inc.", "cailey victoria andres inc.", "ctm 2005 ltd.", "discovery data inc", "discovery data", "pearl states inc", "pearl states inc.", "pearl states, inc.", "cailey victoria andres inc", "blacksands petroleum texas"], "vars": {}, "entities_rejected": [], "person_names": [], "agreement_id": "e80a19bb417d09feacab669d3b71d2b6171f6f73b93e4c42e76eb10d58089711", "topics": [], "terms": ["** (i**", "**\"Excluded Assets\"**", "****", "**. **", "**A-3**", "**ACKNOWLEDGMENTS**", "**ASSIGNEE**", "**ASSIGNEE, ITS SUCCESSORS AND ASSIGNS, SHALL, TO THE MAXIMUM EXTENT PERMITTED BY LAW (BUT NO FURTHER), INDEMNIFY, DEFEND AND HOLD**", "**ASSIGNOR**", "**Address**", "**Assets**", "**Assignee releases and discharges Assignor and Assignor’s Representatives (defined below) and their respective successors and assigns from all Claims relating to the Assets, the Property or this transaction, regardless of when or how the Claim arose or arises or whether the Claim was foreseeable or unforeseeable.**", "**Assignee’s Release of Assignor**", "**Assumption of Assets in Present Condition**", "**Beech Creek #1 Interest to the 8/8ths**", "**Beech Creek #2 Interest to the 8/8ths**", "**Benefit of Indemnities**", "**Blacksands Petroleum Texas**", "**Captions**", "**Claims Defined**", "**Compliance with Laws.**", "**Counterparts**", "**DTPA Waiver**", "**Disclaimer of Warranties**", "**EXHIBIT “A-1”**", "**EXHIBIT “A-2”**", "**EXHIBIT “A-3”**", "**EXHIBIT “A”**", "**Excluded**", "**Exhibit “A”,**", "**Express Negligence Rule; Conspicuousness**", "**Generis**", "**Governing Law**", "**HARMLESS ASSIGNOR, ITS REPRESENTATIVES**", "**INABILITY OR FAILURE TO OBTAIN THE TRANSFER OF A PERMIT OR AUTHORIZATION OR THE INABILITY TO OBTAIN A PERMIT OR AUTHORIZATION RELATING TO THE ASSETS.**", "**If any provision in Article IV is found to be void, invalid or otherwise unenforceable by a court of competent jurisdiction it is deemed modified to the limited and minimum extent to conform to applicable law to provide Assignor, and Assignor's Representatives and their r espective successors and assigns the greatest possible protection and benefit allowed by applicable law.**", "**Inducement to Assignor and Intent**", "**Inurement**", "**It is the intent of Assignee and Assignor that, to the maximum extent allowed by law or regulation, Assignor, Assignor's Representatives and their respective successors and assigns be indemnified, defended and held harmless by Assignee, its successors and assigns at all times upon and after the Effective Time in a manner so that Assignor and its Representatives and their respective successors and assigns, will be protected as if Assignor has never at any time owned, used or operated the Assets, Lands, Subject Properties or the Property or any interest therein or pertaining thereto, in whole or in part.**", "**LEASES:**", "**MISCELLANEOUS**", "**No Ratification.**", "**No Sale of Fractional Undivided Interests. Assignee is Accredited Investor**", "**Not to be Construed Against Drafter**", "**OBLIGATIONS TO PLUG, RE-PLUG, ABANDON OR RE-ABANDON WELLS, REMOVE FACILITIES, EQUIPMENT, PIPELINES AND FLOWLINES, DREDGE, CLOSE PITS AND REMOVE SUMPS, AND RESTORE, CLEAN UP AND/OR REMEDIATE THE ASSETS OR PROPERTY;**", "**PARTIAL ASSIGNMENT AND BILL OF SALE**", "**PAYMENTS, ROYALTIES OR DISBURSEMENTS PAYABLE BY ASSIGNEE TO THIRD PARTIES WITH REGARD TO THE ASSETS;**", "**PREFERENTIAL RIGHTS TO PURCHASE OR THE FAILURE BY THIRD PARTIES TO APPROVE OR CONSENT TO ANY ASPECT OF THIS TRANSACTION OR THE SALE OR TRANSFER OF THE ASSETS OR ANY PORTION THEREOF;**", "**Participation**", "**Post-Closing**", "**Prior Use of Assets**", "**Procedures**", "**REMEDIATION ACTIVITIES, INCLUDING DAMAGES INCURRED BY ASSIGNEE DURING OR ARISING FROM REMEDIATION ACTIVITIES RELATING TO THE ASSETS OR PROPERTY; AND**", "**RIGHTS AND OBLIGATIONS OF THE PARTIES OR THIRD PARTIES UNDER RELATED AGREEMENTS;**", "**Recognition.**", "**Related Agreements**", "**Retroactive Effect**", "**Severability**", "**Special Warranty of Title and**", "**THE ACTS OR OMISSIONS OF THIRD PARTIES RELATING TO AN ERROR IN DESCRIBING THE ASSETS;**", "**THE OWNERSHIP OR OPERATION OF THE ASSETS OR PROPERTY BY OR ON BEHALF OF ASSIGNEE OR ITS SUCCESSORS IN TITLE OR THE ACTS OR OMISSIONS BY OR ON BEHALF OF ASSIGNEE OR ITS SUCCESSORS IN TITLE IN CONNECTION WITH OR PERTAINING TO THE ASSETS OR PROPERTY;**", "**THE OWNERSHIP OR OPERATION OF THE ASSETS OR PROPERTY BY OR ON BEHALF OF ASSIGNOR OR ITS PREDECESSORS IN TITLE OR ACTS OR OMISSIONS BY OR ON BEHALF OF ASSIGNOR OR ITS PREDECESSORS IN TITLE IN CONNECTION WITH OR PERTAINING TO THE ASSETS OR PROPERTY;**", "**THE PRESENCE OF NORM OR MMMF OR THE PHYSICAL OR ENVIRONMENTAL CONDITION OF OR RELATING TO THE ASSETS OR PROPERTY OR ANY DISPOSAL SITE (WHETHER ON THE ASSETS OR PROPERTY OR OFFSITE) CONTAINING MATERIALS OR WASTES FROM THE OPERATIONS OR ACTIVITIES ON THE PROPERTY OR ASSETS INCLUDING CLAIMS UNDER ANY LAW OR ENVIRONMENTAL LAW;**", "**THE REVIEW, INSPECTION AND ASSESSMENT OF THE ASSETS OR THE PROPERTY BY ASSIGNEE;**", "**This Assignment and Bill of Sale contains provisions requiring one party to be responsible for the negligence, strict liability or other fault of the other party.**", "**Totals**", "**WITH NO WARRANTY AS TO MERCHANTABILITY, FITNESS OR SUITABILITY FOR ANY PARTICULAR PURPOSE**", "**Waiver of Jury Trial**", "**Well Numbers**", "**Working Interest Owner**", "**[[Percentage 7: Number]]%**", "**[[Percentage 8: Number]]%**", "**ejusdem generis**", "**time in connection with the Assets, including, without limitation, claims for personal or property injury or damage, restoration, environmental cleanup, remediation, or compliance, or for any other relief, arising directly or indirectly from or incident to, the use, ownership, occupation, operation, maintenance or abandonment of or production from the Assets, or condition of the Assets or Property, whether latent or patent, including, without limitation, contamination of property or premises with NORM and MMMF, and whether or not arising solely from or contributed to by the negligence in any form, whether active or passive, or of any kind or nature, of Assignor or its predecessors in title or their respective affiliates agents, employees or contractors; and (3) SHALL, TO THE MAXIMUM EXTENT PERMITTED BY LAW (BUT NO FURTHER), DEFEND, INDEMNIFY AND HOLD ASSIGNOR, ITS REPRESENTATIVES (defined below) AND THEIR RESPECTIVE SUCCESSORS AND ASSIGNS HARMLESS FROM ANY AND ALL CLAIMS ARISING, ASSERTED OR DUE AT ANY TIME, WHETHER BEFORE, ON OR AFTER THE EFFECTIVE TIME, IN CONNECTION WITH OR RELATED TO THE FOREGOING.**", "**“AS IS, WHERE IS”**", "**“Act”**", "**“Assets”**", "**“Assignee”**", "**“Assignment”**", "**“Effective Time”**", "**“Equipment”**", "**“Lands”**", "**“MMMF”**", "**“NORM”**", "**“Notice Period”**", "**“PROPERTIES”**", "**“Property”, “Properties”, “PROPERTY”**", "**“Records”**", "**“Related Agreements”**", "**“Subject Properties”**", "**“Wells”**", "“**A-1**”", "“**A-2**”", "“**Assignor**”", "“Representative” and collectively “Representatives”"]}}