{"metadata": {"organization_names": ["ngen ii", "bear the financial risks"], "person_names_verified": ["john a. eckstein", "sheppard mullin richter", "staffan akerstrom", "jay zoellner", "george botich", "iyad darcazallie", "peter ludlum", "stephanie brecher", "charles allured"], "organization_names_verified": ["altira technology fund", "altira technology fund v l.p.", "sheppard mullin richter & hampton", "ngen ii l.p."], "topics": [], "entities_rejected": [], "person_names": ["woods p.c."], "agreement_id": "3b74e87760e5caee1c68bb935de94c9a249fc09478a80d39c0ca54e1ed76565e", "vars": {"Party": {"Energy and Power Solutions, Inc.": "[[Party 1]]"}}, "terms": ["** Each employee, consultant, officer and contractor of the Company has entered into and executed Proprietary Information and Inventions Assignment Agreement in the form attached to this Agreement as **", "** Investor shall have received an opinion from Sheppard Mullin Richter & Hampton, LLP, counsel for the Company, dated as of the date of the First Closing, in the form satisfactory to the Investors and their counsel substantially in the form attached hereto as Exhibit H**", "** No consent, approval, order or authorization of, or registration, qualification, designation, declaration or filing with, any federal, state or local governmental authority is required on the part of the Company in order to enable the Company to execute, deliver and perform its obligations under this Agreement and the Related Agreements, **", "** Persons or entities which purchase from the Company in the future Series B Stock may, at the discretion of the Board, become parties to this Agreement (as amended from time to time) by executing a counterpart signature page to this Agreement. By execution of such counterpart signature page, this Agreement shall be automatically amended and such person or entity shall be an “Investor” for all purposes of this Agreement, and as such shall be entitled to the rights and benefits, and be bound by the obligations, of this Agreement. Immediately after each such Closing, Exhibit A**", "** Pursuant to the terms set forth herein, including but not limited to the satisfaction by the Company of all applicable closing conditions set forth in Section 4 below, and in reliance on the representations and warranties set forth herein, each Investor agrees, severally and not jointly, to purchase, and the Company agrees to sell and issue to such Investor at one or more Closings (as defined below) the number of shares of Series B Stock set forth opposite such Investor’s name on **", "** The Company has delivered to the Investors its consolidated unaudited balance sheet and statements of operations and cash flows for the year ended [[Date 3: Date]] and the three months ended [[Date 4: Date]] (the “***", "** The Company hereby represents and warrants to each Investor as of the Closing that, except as set forth in the Schedule of Exceptions (“***", "** The Company is not in violation of any applicable statute, law or regulation relating to the environment or occupational health and safety, and to its knowledge, no material expenditures are or will be required in order to comply with any such existing statute, law or regulation. No action, proceeding, permit revocation, writ, injunction or claim is pending or, to the Company’s knowledge, threatened concerning the Company’s or its subsidiaries’ facilities and the Company is not aware of any fact or circumstance which could involve the Company or any of its subsidiaries in any environmental litigation or impose any material environmental liability upon the Company. As of the Closing, to the Company’s knowledge, no Hazardous Material (as defined below) is present on any Company or subsidiary facility and, to the Company’s knowledge, no reasonable likelihood exists that any Hazardous Material present on other property will come to be present on a Company or subsidiary facility. The Company has obtained all indemnification agreements from all prior owners, lessors and/or operators of any property on which a Company or a subsidiary facility is located required to be obtained under any written agreements between the Company (or any of its subsidiaries) and any current owner of such property, indemnifying the Company with respect to any liability relating to or arising from the presence of or migration of any Hazardous Material at such facilities with respect to periods prior to the Company or subsidiaries’ use of such facilities. There are no underground storage tanks, asbestos or PCBs present on any Company facility. For the purposes of this Section 2.26, the term “*", "** The Company is not now and never has been a “United States real property holding corporation” as defined in §897(c)(2) of the Code and Treasury Regulation §1.897-2(b), and has filed with the Internal Revenue Service all statements, if any, with its United States income tax returns, which are required under Treasury Regulation §1.897-2(h). The Company shall provide prompt notice to the Investors following any “determination date” (as defined in Treasury Regulation Section 1.897-2(c)(1)) on which the Company becomes a United States real property holding corporation. In addition, upon a written request by an Investor, the Company shall provide such Investor with a written statement informing such Investor whether such Investor’s interest in the Company constitutes a United States real property interest. The Company’s determination shall comply with the requirements of Treasury Regulation Section 1.897-2(h)(1) or any successor regulation, and the Company shall provide timely notice to the Internal Revenue Service, in accordance with and to the extent required by Treasury Regulation Section 1.897-2(h)(2) or any successor regulation, that such statement has been made. The Investors will reasonably cooperate with the Company’s efforts to make the determination as to whether the Company qualifies as a real property holding corporation by furnishing the Company with any information reasonably necessary for the Company to make the determination described in this Section 2.23. The Company’s written statement to an Investor shall be delivered to such Investor within 10 days of the Investor’s written request therefor, provided, however**", "** The Company shall have entered into an indemnification agreement with the designee of Altira to the Board substantially in the form attached hereto as Exhibit K**", "** The Company shall use the proceeds from the sale of the Series B Stock for working capital and general corporate purposes as set forth in the Company’s 2009 business plan and annual budget, substantially in the form of **", "** The Investor shall have delivered to the Company the cash purchase price specified on Exhibit A**", "** The Investor understands that the purchase of the Purchased Shares involves substantial risk. The Investor: (a) has experience as an investor in securities of companies in the development stage and acknowledges that the Investor is able to fend for itself, can bear the economic risk of such Investor’s investment in the Purchased Shares and has such knowledge and experience in financial or business matters that such Investor is capable of evaluating the merits and risks of this investment in the Purchased Shares and protecting its own interests in connection with this investment and/or (b) has a preexisting personal or business relationship with the Company and certain of its officers, directors or controlling persons of a nature and duration that enables such Investor to be aware of the character, business acumen and financial circumstances of such persons. The Investor represents that (i) if the Investor is an individual, he or she resides in the state identified on **", "** The purchase and sale of the Series B Stock and Note Conversion (a “***", "** There is no action, suit, proceeding, claim, arbitration or investigation (“*", "** To the extent not already in place, the Company shall use its reasonable best efforts to obtain as promptly as practicable after the date hereof from financially sound and reputable insurers (a) Directors and Officers insurance in an amount and with coverage satisfactory to the Board and the Investors, and (b) if requested by at least sixty-six and two-thirds percent (66 2/[[Percentage 2: Number]]%) of the Preferred Stock (voting together as a single class), key man life insurance for those of the Company’s executives and in the amounts as directed by the Board, and will use reasonable best efforts to cause such insurance policies to be maintained in full force and effect until such time as the Board determines that such insurance should be discontinued. The Company agrees to use commercially reasonable efforts to maintain in full force and effect, general business and liability insurance policies, with extended coverage, from reputable insurers, with coverage customary for entities engaged in similar lines of business and sufficient in amount (subject to reasonable deductibles) to allow it to replace any of its assets or properties that might be damaged or destroyed; provided that**", "** attached hereto at a purchase price of $[[USD Value 6: Number]] per share (the “***", "** attached hereto, which will be approved by the Investors prior to the First Closing (the “*", "** for**", "** hereto shall be amended to include such Subsequent Purchaser), the Investor Rights Agreement, the Right of First Refusal and Co-Sale Agreement and the Voting Agreement and shall have the rights and obligations, and be treated as, an Investor hereunder and thereunder. Each closing of a sale of Series B Stock to one or more Subsequent Purchasers during the Subsequent Sale Period shall be a Closing for purposes of this Agreement. Each Investor hereby agrees to waive any rights of first refusal it may have in connection with the sale of Shares to Subsequent Purchasers during the Subsequent Sale Period. At each Closing, subject to the terms and conditions hereof, the Company will deliver to each Investor a certificate representing the number of Purchased Shares that such Investor is purchasing as shown on Exhibit A**", "** or an employment or consulting agreement containing substantially similar terms (such agreement, the “*", "***Material Adverse Effect***", "***“Altira”***", "***“Board”***", "***“Code”***", "***“Employment Agreements”***", "***“Executives”***", "***“First Refusal and Co-Sale Agreement”***", "***“Founders”***", "***“Investors’ Rights Agreement”***", "***“NGEN”***", "***“Related Agreements”***", "***“Robeco”***", "***“Securities Act”***", "***“Voting Agreement”***", "***”", "***”) at the Price Per Share; provided, however, that any such sale may only occur during that certain period beginning on the Closing Date and ending on the 60th day thereafter (the “***", "***”) attached to this Agreement as Exhibit C**", "***”) will take place at the offices of Sheppard Mullin Richter & Hampton LLP, [[Address 1: Address]], at 12:00 p.m. Pacific Time on [[Date 1]] or at such other time and place as the Company and the Investors mutually agree upon in one or more closings (the “***", "***”). Any such sale shall be made during the Subsequent Sale Period and upon the same terms and conditions as those set forth herein, and each Subsequent Purchaser shall become a party to this Agreement (and **", "***”). Subject to the terms and conditions set forth in this Agreement, the Company may sell up to an additional [[Shares 3: Number]] shares of Series B Stock in the aggregate to purchasers acceptable to the Company, Altira, NGEN and Robeco (each a “***", "***”). The Financial Statements together with any notes thereto, are correct in all material respects and present fairly the financial condition and operating results of the Company as of the date(s) and during the period(s) indicated therein. The Financial Statements have been prepared in accordance with accounting principles that are generally accepted in the United States (“*", "***”). The shares of Series B Stock purchased, sold and issued pursuant to this Agreement are sometimes hereinafter referred to as the “*", "***”, and the first of such Closings, the “***", "**, and (ii) if the Investor is an entity, then the office in which its investment decision was made is located at the address on Exhibit A**", "**ALTIRA TECHNOLOGY FUND V L.P.**", "**AND INVENTIONS ASSIGNMENT AGREEMENT**", "**Absence of Changes**", "**Accredited Investor Status****", "**Addition of Other Parties to This Agreement**", "**Adjustments for Stock Splits, Etc****", "**Aggregation of Stock****", "**Agreement to Purchase and Sell**", "**Amendments and Waivers****", "**Annual Budget**", "**Arbitration****", "**Attorneys’ Fees**", "**Authorization**", "**Authorization****", "**Board of Directors; Observer Seats****", "**Business Opportunities.**", "**Business Practices****", "**CLEAN TECH II (EUR)**", "**CLEAN TECH II (USD)**", "**COMPANY:**", "**CONDITIONS TO INVESTORS’ OBLIGATIONS AT CLOSING****", "**CONDITIONS TO THE COMPANY’S OBLIGATIONS AT CLOSING****", "**Cancellation of Notes**", "**Capitalization****", "**Closing Deliverables****", "**Common Stock**", "**Compliance Certificate****", "**Compliance with Law and Documents****", "**Confidentiality.**", "**Consents, Permits and Waivers****", "**Contracts and Other Commitments**", "**Controlling Law**", "**Corporate Securities Law****", "**Costs and Expenses****", "**Counterparts**", "**Counterparts****", "**Covenant Not to Solicit or Hire.**", "**Defined Terms Used in this Agreement****", "**Definitions.**", "**Delaware Reincorporation**", "**Delays and Omissions****", "**Disclosure Requirements.**", "**Disclosure of Information****", "**Disclosure****", "**Due Authorization****", "**EMPLOYEE:**", "**EXHIBIT A**", "**EXHIBIT B**", "**EXHIBIT G**", "**Employee Matters**", "**Employment Agreements****", "**Entire Agreement**", "**Entire Agreement****", "**Environmental and Safety Laws**", "**Exhibit A**", "**Exhibit B**", "**Exhibit D**", "**Exhibit E**", "**Exhibit F**", "**Exhibit I**", "**Exhibit J**", "**Exhibit “A**”", "**Exhibit “B**”", "**FORM OF PROPRIETARY INFORMATION**", "**Financial Statements**", "**First Refusal and Co-Sale Agreement****", "**Further Assurances****", "**Further Limitations on Disposition****", "**Governing Law****", "**Government Funding**", "**Governmental Consents**", "**Headings****", "**IN WITNESS WHEREOF,**", "**INVESTORS:**", "**In Witness Whereof**", "**Indemnification Agreements**", "**Injunctive Relief**", "**Inspection of Files**", "**Insurance**", "**Insurance****", "**Investment Company Act****", "**Investment Experience**", "**Investors’ Rights Agreement****", "**Legends****", "**Licenses; Other Agreements**", "**Litigation**", "**Management Rights Letter.**", "**Minute Books****", "**Miscellaneous Provisions.**", "**NGEN II, L.P.**", "**NOTICE OF INVENTIONS AND WORKS**", "**NOTICE OF PATENT/COPYRIGHT REGISTRATION**", "**NOW, THEREFORE**", "**No Finder’s Fees****", "**No Infringement**", "**Note Conversion**", "**Notices****", "**Notices.**", "**Notification of Subsequent Employer**", "**Open Source Software.**", "**Opinion of Company Counsel**", "**Options; Reserved Shares for Option Issuances; Warrants**", "**Organization, Good Standing and Qualification****", "**Outstanding Shares Table**", "**Outstanding Shares Validly Issued; Compliance with Securities Laws**", "**Ownership of Inventions and Works.**", "**PENSION FUND**", "**POST-CLOSING COVENANTS**", "**PROPRIETARY INFORMATION AND INVENTIONS ASSIGNMENT AGREEMENT**", "**PURCHASE AND SALE OF SERIES B STOCK**", "**Payment of Purchase Price; Cancellation of Bridge Notes**", "**Performance****", "**Permits****", "**Preferred Stock**", "**Prior Employment**", "**Proceedings and Documents****", "**Proprietary Information Agreements****", "**Proprietary Information and Inventions Assignment Agreement**", "**Protection of Proprietary Assets**", "**Purchase for Own Account****", "**REPRESENTATIONS AND WARRANTIES OF THE COMPANY**", "**REPRESENTATIONS, WARRANTIES AND CERTAIN AGREEMENTS OF THE INVESTORS****", "**Real Property Holding Corporation**", "**Registration Rights****", "**Related Transactions****", "**Representations and Warranties True****", "**Representations and Warranties****", "**Restated Articles Effective****", "**Restated Articles Effective; Secretary’s Certificate****", "**Restricted Securities****", "**SERIES B PREFERRED STOCK PURCHASE AGREEMENT**", "**STICHTING CUSTODY ROBECO MASTER**", "**Sections 2, 3, 4, 5 and 8 hereof**", "**Sections 2, 3, 4, 5 and 8**", "**Securities Exemptions****", "**Securities Issued at Fair Market Value**", "**Series A Dividend**", "**Severability**", "**Severability****", "**Status of Proprietary Assets**", "**Status**", "**Status.**", "**Subsidiaries****", "**Successors and Assigns**", "**Survival of Warranties****", "**Survival of Your Obligations**", "**THE ENVIRONMENT AGENCY ACTIVE**", "**Tax Matters****", "**The Closing**", "**Third Parties****", "**Third Party Consents****", "**Title to Property and Assets****", "**Transfer; Successors and Assigns****", "**Use of Proceeds; Budgeting; Reporting**", "**Valid Issuance of Stock**", "**Voting Agreement**", "**WHEREAS**", "**Waiver of Anti-dilution Rights****", "**Waiver of Right of First Refusal**", "**Waiver**", "**provided**", "**provided, however**", "“***Agreement***”", "“***Bridge Notes***”", "“***Closing Date***”", "“***Closing***”, and the first of such Closings, the “***First Closing***”", "“***Company Intellectual Property***”", "“***Company***", "“***Company***”", "“***Confidential Information***”", "“***Conversion Shares***”", "“***Employed***”", "“***Employment***”", "“***Financial Statements***”", "“***Inventions and Works***”", "“***Investor***”", "“***Investor***” and collectively referred to as the “***Investors***”", "“***Investors***”", "“***Material Contracts***”", "“***Materials***”", "“***Moral Rights***”", "“***Note Conversion***”", "“***Noteholders***”", "“***Patents***”", "“***Person***”", "“***Plan***”", "“***Preferred Stock***”", "“***Price Per Share***”", "“***Proprietary Assets***”", "“***Proprietary Right***”", "“***Restated Articles***”", "“***Schedule of Exceptions***”", "“***Series A Stock***”", "“***Series B Stock***”", "“***Subsequent Purchaser***”", "“***Subsequent Sale Period***”", "“***you***", "“**Copyright Registration**”", "“*Action***”", "“*Annual Budget***”", "“*GAAP***”", "“ACT”", "“your Employment Agreement”"]}}