{"metadata": {"organization_names": [], "person_names_verified": [], "organization_names_verified": ["citizens bank", "two mellon bank center", "matthews international corporation"], "topics": [], "entities_rejected": [], "person_names": [], "agreement_id": "1120fc4da4bd90968707ec2eb20b5e958bee15c1eecf1a2c2a458c8d73db0f4f", "vars": {"Party": {"and Citizens Bank of Pennsylvania": "[[Party 1]]", "with such amounts being payable on the dates set forth in Article II of, or as otherwise provided in": "[[Party 2]]"}}, "terms": ["\"Bank\" and collectively, the \"Banks\"", "\"Borrower\"", "\"Citizens\"", "\"Swing Line Note\"", "**SWING LINE NOTE**", "**THE BORROWER HEREBY IRREVOCABLY AUTHORIZES AND EMPOWERS THE PROTHONOTARY, ANY ATTORNEY OR ANY CLERK OF ANY COURT OF RECORD, WITH OR WITHOUT DEFAULT, TO APPEAR FOR AND CONFESS JUDGMENT AGAINST THE BORROWER FOR SUCH SUMS AS ARE DUE AND/OR MAY BECOME DUE UNDER THIS SWING LINE NOTE, WITH OR WITHOUT DECLARATION, WITH COSTS OF SUIT, WITHOUT STAY OF EXECUTION AND WITH AN AMOUNT EQUAL TO FIFTEEN PERCENT ([[Percentage 1: Number]]%) OF THE AMOUNT OF SUCH JUDGMENT, BUT NOT LESS THAN TEN THOUSAND AND 00/100 DOLLARS ($[[USD Value 2: Number]]) ADDED FOR ATTORNEYS' COLLECTION FEES. TO THE EXTENT PERMITTED BY LAW, THE BORROWER RELEASES ALL ERRORS IN SUCH PROCEEDINGS. IF A COPY OF TH IS SWING LINE NOTE, VERIFIED BY AFFIDAVIT BY OR ON BEHALF OF THE HOLDER OF THIS SWING LINE NOTE SHALL HAVE BEEN FILED IN SUCH ACTION, IT SHALL NOT BE NECESSARY TO FILE THE ORIGINAL SWING LINE NOTE AS A WARRANT OF ATTORNEY. THE AUTHORITY AND POWER TO APPEAR FOR AND CONFESS JUDGMENT AGAINST THE BORROWER SHALL NOT BE EXHAUSTED BY THE INITIAL EXERCISE THEREOF AND MAY BE EXERCISED AS OFTEN AS THE HOLDER SHALL FIND IT NECESSARY AND DESIRABLE AND THIS SWING LINE NOTE SHALL BE A SUFFICIENT WARRANT THEREFOR. THE HOLDER HEREOF MAY CONFESS ONE OR MORE JUDGMENTS IN THE SAME OR DIFFERENT JURISDICTIONS FOR ALL OR ANY PART OF THE AMOUNT OWING HEREUNDER, WITHOUT REGARD TO WHETHER JUDGMENT HAS THERETOFORE BEEN CONFESSED ON MORE THAN ONE OCCASION FOR THE SAME AMOUNT. IN THE EVENT ANY JUDGMENT CONFESSED AGAINST THE BORROWER HEREUNDER IS STRICKEN OR OPENED UPON APPLICATION BY OR ON THE BORROWER'S BEHALF FOR ANY REASON, THE HOLDER IS HEREBY AUTHORIZED AND EMPOWERED TO AGAIN APPEAR FOR AND CONFESS JUDGMENT AGAINST THE BORROWER FOR ANY PART OR ALL OF THE AMOUNTS OWING HEREUNDER, AS PROVIDED FOR HEREIN, IF DOING SO WILL CURE ANY ERRORS OR DEFECTS IN SUCH PRIOR PROCEEDINGS.**", "**WARRANT OF ATTORNEY TO CONFESS JUDGMENT**"]}}