{"metadata": {"organization_names": [], "person_names_verified": [], "organization_names_verified": ["occulogix corporation", "the tearlab corporation", "vascular sciences corporation", "occulogix, inc.", "tearlab corporation", "occulogix"], "vars": {}, "entities_rejected": [], "person_names": [], "agreement_id": "3743c8f6c3532ad0f9ba0f93d2a6ef71490ffec9b3e327d31600e37eb74166d2", "topics": [], "terms": ["**    7.1 The Committee may, from time to time, grant Stock Appreciation Rights to any Employee, Consultant or Director in connection with the grant of any Option. Any such grant of Stock Appreciation Rights shall be included in the Option Agreement.    7.2 Stock Appreciation Rights shall be exerciseable only at the same time, by the same person and to the same extent, that the Option related thereto is exerciseable. Upon exercise of any Stock Appreciation Right, the corresponding portion of the related Option shall be surrendered to the Company.    7.3 The Company has the absolute right, at any time and from time to time, to require an Optionee to exercise an Option in lieu of the related Stock Appreciation Right.     \\centered - 9 -         8. **", "**    Options shall be evidenced by Option Agreements specifying the number of shares of Stock covered thereby, in such form as the Board shall from time to time establish. No Option or purported Option shall be a valid and binding obligation of the Company unless evidenced by a fully executed Option Agreement. Option Agreements may incorporate all or any of the terms of the Plan by reference and shall comply with and be subject to the following terms and conditions:    6.1 **", "**   (a) ***", "**   4.1 **", "**   8.1 **", "** During the lifetime of the Optionee, an Option shall be exercisable only by the Optionee or the Optionee’s guardian or legal representative. No Option shall be assignable or transferable by the Optionee, except by will or by the laws of descent and distribution. Notwithstanding the foregoing, to the extent permitted by the Board, in its discretion, and set forth in the Option Agreement evidencing such Option, a Nonstatutory Stock Option shall be assignable or transferable subject to the applicable limitations, if any, described in Section 260.140.41 of Title 10 of the California Code of Regulations, Rule 701 under the Secu rities Act, and the General Instructions to Form S-8 Registration Statement under the Securities Act.    7. **", "** In addition to such other rights of indemnification as they may have as members of the Board or officers or employees of the Participating Company Group, members of the Board and any officers or employees of the Participating Company Group to whom authority to act for the Board or the Company is delegated shall be indemnified by the Company against all reasonable expenses, including attorneys’ fees, actually and necessarily incurred in connection with the defense of any action, suit or proceeding, or in connection with any appeal therein, to which they or any of them may be a party by reason of any action taken or failure to act under or in connection wit h the Plan, or any right granted hereunder, and against all amounts paid by them in settlement thereof (provided such settlement is approved by independent legal counsel selected by the Company) or paid by them in satisfaction of a judgment in any such action, suit or proceeding, except in relation to matters as to which it shall be adjudged in such action, suit or proceeding that such person is liable for gross negligence, bad faith or intentional misconduct in duties; provided, however, that within sixty (60) days after the institution of such action, suit or proceeding, such person shall offer to the Company, in writing, the opportunity at its own expense to handle and defend the same.    4. **", "** No promissory note shall be permitted if the exercise of an Option using a promissory note would be a violation of any law. Any permitted promissory note shall be on such terms as the Board shall determine. The Board shall have the authority to permit or require the Optionee to secure any promissory note used to exercise an Option with the shares of Stock acquired upon the exercise of the Option or with other collateral acceptable to the Company. Unless otherwise provided by the Board, if the Company at any time is subject to the regulations promulgated by the Board of Governors of the Federal Reserve System or any other governmental entity affecting the extension of credit in connection with the Company’s securities, any promissory note shall comply with such applicable regulations, and the Optionee shall pay the unpaid principal and accrued interest, if any, to the extent necessary to comply with such applicable regulations.    6.4 **", "** Notwithstanding the foregoing, an Option may not be exercised by tender to the Company, or attestation to the ownership, of shares of Stock to the extent such tender or attestation would constitute a violation of the provisions of any law, regulation or agreement restricting the redemption of the Company’s stock. Unless otherwise provided by the Board, an Option may not be exercised by tender to the Company, or attestation to the ownership, of shares of Stock unless such shares either have been owned by the Optionee for more than six (6) months (and not used for another Option exercise by attestation during such p eriod) or were not acquired, directly or indirectly, from the Company.     \\centered - 7 -         (ii) **", "** Notwithstanding the foregoing, if the exercise of an Option within the applicable time periods set forth in Section 6.6(a) is prevented by the provisions of Section 10 below, the Option shall remain exercisable until three (3) months (or such longer period of time as determined by the Board, in its discretion) after the date the Optionee is notified by the Company that the Option is exercisable, but in any event no later than the Option Expiration Date.    (c) ***", "** Notwithstanding the foregoing, if there is in effect during the applicable time periods set forth in Section 6.6(a) a Company-imposed trading blackout to which the Optionee is subject (including an Optionee that is an Insider) and provided that neither Section 6.6(b) nor Section 6.6(c) is applicable to the circumstances at hand, the Option shall remain exercisable until the end of the tenth business day following the end of the trading blackout.    6.7 **", "** Subject to adjustment as provided in Section 4.2, the maximum aggregate number of shares of Stock that may be issued under the Plan shall be [[Shares 1: Number]]. This share reserve shall consist of authorized but unissued or reacquired shares of Stock or any combination thereof. However, the share reserve, determined at any time, shall be reduced by the number of shares subject to Prior Plan Options. If an outstanding Option, including any Prior Plan Option, for any reason expires or is terminated or canceled or if shares of Stock are acquired upon the exercise of an Option, including any Prior Plan Option, subject to a Company repurchase option and are repurchased by the Company at the Optionee’s exercise price, the shares of Stock allocable to the unexercised portion of such Option or Prior Plan Option or such repurchased shares of Stock shall again be available for issuance under the Plan. However, except as adjusted pursuant to Section 4.2, in no event shall more than 3,200,000 shares of Stock be available for issuance pursuant to the exercise of Incentive Stock Options (the “***", "** The Company reserves, at any and all times, the right, in the Company’s sole and absolute discretion, to establish, decline to approve or terminate any program or procedures for the exercise of Options by means of a Cashless Exercise.    (iii) **", "** With respect to participation by Insiders in the Plan, at any time that any class of equity security of the Company is registered pursuant to Section 12 of the Exchange Act, the Plan shall be administered in compliance with the requirements, if any, of Rule 16b-3.    3.5 **", "**(formerly OCCULOGIX, INC. and formerly VASCULAR SCIENCES CORPORATION)**", "*** Except as otherwise provided below, payment of the exercise price for the number of shares of Stock being purchased pursuant to any Option shall be made (i) in cash, by check or cash equivalent, (ii) by tender to the Company, or attestation to the ownership, of shares of Stock owned by the Optionee having a Fair Market Value not less than the exercise price, (iii) by delivery of a properly executed notice together with irrevocable instructions to a broker providing for the assignment to the Company of the proceeds of a sale or loan with respect to some or all of the shares being acquired upon the exercise of the Optio n (including, without limitation, through an exercise complying with the provisions of Regulation T as promulgated from time to time by the Board of Governors of the Federal Reserve System) (a “***", "*** In addition to any other powers set forth in the Plan and subject to the provisions of the Plan, the Board shall have the full and final power and authority, in its discretion:    (a) to determine the persons to whom, and the time or times at which, Options and Stock Appreciation Rights shall be granted and the number of shares of Stock to be subject to each Option and Stock Appreciation Right;    (b) to designate Options as Incentive Stock Options or Nonstatutory Stock Options;    (c) to determine the Fair Market Value of shares of Stock or other property;    (d) to determine the terms, conditions and restrictions applicable to each Option and Stock Appreciation Right (which need not be identical) and any shares acquired upon the exercise thereof, including, without limitation, (i) the exercise price of the Option, (ii) the method of payment for shares purchased upon the exercise of the Option, (iii) the method for satisfaction of any tax withholding obligation arising in connection with the Option and Stock Appreciation Right or such shares, including by the withholding or delivery of shares of stock, (iv) the timing, terms and conditions of the exercisability of the Option and Stock Appreciation Right or the vesting of any shares acquired upon the exercise thereof, (v) the time of the expiration of the Option and Stock Appreciation Right, (vi) the effect of the Optionee’s termination of Service with the Participating Company Group on any of the foregoing, and (vii) all other terms, conditions and restrictions applicable to the Option or such shares not inconsistent with the terms of the Plan;    (e) to approve one or more forms of Option Agreement;     \\centered - 4 -         (f) to amend, modify, extend, cancel, renew, reduce the exercise price of or in any other manner re-price any outstanding Option and Stock Appreciation Right or to waive any restrictions or conditions applicable to any outstanding Option and Stock Appreciation Right or any shares acquired upon the exercise thereof;    (g) to accelerate, continue, extend or defer the exercisability of any Option and Stock Appreciation Right or the vesting of any shares acquired upon the exercise thereof, including with respect to the period following an Optionee’s termination of Service with the Participating Company Group;    (h) to prescribe, amend or rescind rules, guidelines and policies relating to the Plan, or to adopt supplements to, or alternative versions of, the Plan, including, without limitation, as the Board deems necessary or desirable to comply with the laws of, or to accommodate the tax policy or custom of, foreign jurisdictions whose citizens may be granted Options and Stock Appreciation Rights; and    (i) to correct any defect, supply any omission or reconcile any inconsistency in the Plan or any Option Agreement and to make all other determinations and take such other actions with respect to the Plan or any Option and Stock Appreciation Right as the Board may deem advisable to the extent not inconsistent with the provisions of the Plan or applicable law.    3.4 **", "*** Options may be granted only to Employees, Consultants, and Directors. For purposes of the foregoing sentence, “Employees,” “Consultants” and “Directors” shall include prospective Employees, prospective Consultants and prospective Directors to whom Options are granted in connection with written offers of an employment or other service relationship with the Participating Company Group. Eligible persons may be granted more than one (1) Option. However, eligibility in accordance with this Section shall not entitle any person to be granted an Option, or, having been granted an Option, to be granted an additional Option.    5.2 **", "*** Options shall be exercisable at such time or times, or upon such event or events, and subject to such terms, conditions, performance criteria and restrictions as shall be determined by the Board and set forth in the Option Agreement evidencing such Option; provided, however, that (a) no Option shall be exercisable after the expiration of ten (10) years after the effective date of grant of such Option, (b) no Incentive Stock Option granted to a Ten Percent Owner Optionee shall be exercisable after the expiration of five (5) years after the effective date of grant of su ch Option, (c) no Option granted to a prospective Employee, prospective Consultant or prospective Director may become exercisable prior to the date on which such person commences Service with a Participating Company, and (d) with the exception of an Option granted to an Officer, a Director or a Consultant, no Option shall become exercisable at a rate less than twenty percent ([[Percentage 6: Number]]%) per year over a period of five (5) years from the effective date of grant of such Option, subject to the Optionee’s continued Service. Subject to the foregoing, unless otherwise specified by the Board in the grant of an Option, any Option granted hereunder shall terminate ten (10) years after the effective date of grant of the Option, unless earlier terminated in accordance with its provisions.    6.3 **", "*** Shares issued under the Plan may be subject to a right of first refusal, one or more repurchase options, or other conditions and restrictions as determined by the Board in its discretion at the time the Option is granted. The Company shall have the right to assign at any time any repurchase right it may have, whether or not such right is then exercisable, to one or more persons as may be selected by the Company. Upon request by the Company, each Optionee shall execute any agreement evidencing such transfer restrictions prior to the receipt of shares of Stock here under and shall promptly present to the Company any and all certificates representing shares of Stock acquired hereunder for the placement on such certificates of appropriate legends evidencing any such transfer restrictions.    6.6 **", "*** The Board shall have the authority from time to time to vary the terms of any standard form of Option Agreement described in this Section 8 either in connection with the grant or amendment of an individual Option or in connection with the authorization of a new standard form or forms; provided, however, that the terms and conditions of any such new, revised or amended standard form or forms of Option Agreement are not inconsistent with the terms of the Plan.    9. **", "*** The TearLab Corporation 2002 Stock Option Plan (the “***", "*** To the extent that options designated as Incentive Stock Options (granted under all stock option plans of the Participating Company Group, including the Plan) become exercisable by an Optionee for the first time during any calendar year for stock having a Fair Market Value greater than One Hundred Thousand Dollars ($[[USD Value 1: Number]]), the portions of such options which exceed such amount shall be treated as Nonstatutory Stock Options. For purposes of this Section 5.3, options designated as Incentive Stock Options shall be taken into account in the order in which they were granted, and the Fair Market Value of stock shall be determined as of the time the option with respect to such stock is granted. If the Code is amended to provide for a different limitation from that set forth in this Section 5.3, such different limitation shall be deemed incorporated herein effective as of the date and with respect to such Options as required or permitted by such amendment to the Code. If an Option is treated as an Incentive Stock Option in part and as a Nonstatutory Stock Option in part by reason of the limitation set forth in this Section 5.3, the Optionee may designate which portion of such Option the Optionee is exercising. In the absence of such designation, the Optionee shall be deemed to have exercised the Incentive Stock Option portion of the Option first. Separate certificates representing each such portion shall be issued upon the exercise of the Option.     \\centered - 6 -         6. **", "*****).**", "*****.**", "*****.***", "****.**", "***.    (i) **", "***Extension during Blackout Period*****", "***Extension if Exercise Prevented by Law*****", "***”) was established effective as of the effective date of the [[State of Formation: State]] [[Organization: EntityType]] of OccuLogix Corporation (the predecessor corporation to the Company) (the “Effective Date”).    1.2 **", "***”), (iv) by such other consideration as may be approved by the Board from time to time to the extent permitted by applicable law, or (v) by any combination thereof. The Board may at any time or from time to time, by approval of or by amendment to the standard forms of Option Agreement described in Section 8, or by other means, grant Options which do not permit all of the foregoing forms of consideration to be used in payment of the exercise price or which otherwise restrict one or more forms of consideration.    (b) ***", "***”), the total number of shares of Stock issuable upon the exercise of all outstanding Options (together with options outstanding under any other stock option plan of the Company) and the total number of shares provided for under any stock bonus or similar plan of the Company shall not exceed thirty percent ([[Percentage 3: Number]]%) (or such other higher percentage limitation as may be approved by the stockholders of the Company pursuant to Section 260.140.45) of the then outstanding shares of the Company as calculated in accordance with the conditions and exclusions of Section 260.140.45.     \\centered - 5 -         4.2 **", "***”). Notwithstanding the foregoing, at any such time as the offer and sale of securities pursuant to the Plan is subject to compliance with Section 260.140.45 of Title 10 of the California Code of Regulations (“ ;***", "**.   (a) ***", "**2002 STOCK OPTION PLAN, AS AMENDED IN 2010**", "**Administration by the Board.**", "**Administration.**", "**Authority of Officers.**", "**Authority to Vary Terms*****", "**Compliance with Securities Law.**", "**Construction.**", "**Death.**", "**Definitions and Construction.**", "**Definitions**", "**Definitions.**", "**Disability.**", "**Eligibility and Option Limitations.**", "**Establishment***", "**Establishment, Purpose and Term of Plan.**", "**Exercisability and Term of Options*****", "**Fair Market Value Limitation*****", "**Other Termination of Service.**", "**PLAN HISTORY**", "**Persons Eligible for Options*****", "**Powers of the Board*****", "**Provision of Information.**", "**Repurchase Rights*****", "**Stockholder Approval**", "**TEARLAB CORPORATION**", "**Term of Plan.**", "**Termination or Amendment of Plan.**", "**The Wall Street Journal**", "’s guardian or legal representative) at any time prior to the expiration of twelve (12) months (or such longer period of time as determined by the Board, in its discretion) after the date on which the Optionee’s Service terminated, but in any event no later than the date of expiration of the Option’s term as set forth in the Option Agreement evidencing such Option (the “***Option Expiration Date***”", "“ ;***Section 260.140.45***”", "“***Acquiring Corporation***”", "“***Board***”", "“***Cashless Exercise***”", "“***Change in Control***”", "“***Code***”", "“***Committee***”", "“***Company***”", "“***Consultant***”", "“***Director***”", "“***Disability***”", "“***Employee***”", "“***Exchange Act***”", "“***Fair Market Value***”", "“***ISO Share Issuance Limit***”", "“***Incentive Stock Option***”", "“***Insider***”", "“***Involuntary Termination***”", "“***Misconduct***”", "“***New Shares***”", "“***Nonstatutory Stock Option***”", "“***Officer***”", "“***Option Agreement***”", "“***Option Expiration Date***”", "“***Option***”", "“***Optionee***”", "“***Ownership Change Event***”", "“***Parent Corporation***”", "“***Participating Company Group***”", "“***Participating Company***”", "“***Plan***”", "“***Prior Plan Options***”", "“***Rule 16b-3***”", "“***Securities Act***”", "“***Service***”", "“***Stock Appreciation Right***”", "“***Stock***”", "“***Subsidiary Corporation***”", "“***Ten Percent Owner Optionee***”", "“***Transaction***”", "“***[[State of Formation: State]] [[Organization: EntityType]]s or other business entities which own the Company or the [[State of Formation: State]] [[Organization: EntityType]]s or other business entities. The Board shall have the right to determine whether multiple sales or exchanges of the voting securities of the Company or multiple Ownership Change Events are related, and its determination shall be final, binding and conclusive.    9.2 **", "“***[[State of Formation: State]] [[Organization: EntityType]]s or other business entities which own the Company or the [[State of Formation: State]] [[Organization: EntityType]]s or other business entities. The Board shall have the right to determine whether multiple sales or exchanges of the voting securities of the Company or multiple Ownership Change Events are related, and its determination shall be final, binding and conclusive.    9.2 **Effect of Change in Control on Options*****.*** In the event of a Change in Control, the surviving, continuing, successor, or purchasing corporation or other business entity or parent thereof, as the case may be (the “***Acquiring Corporation***”", "“*Authorized Shares***”", "“Effective Date”", "“OccuLogix”"]}}