{"metadata": {"organization_names": ["aviso para el fiador"], "person_names_verified": ["ronald johnston", "ronald rossetti", "john guszak", "steven m. stewart"], "organization_names_verified": ["ubs bank", "ubs financial services inc", "ubs international inc.", "ubs financial services inc.", "ingles se requiere", "ubs bank usa"], "vars": {}, "entities_rejected": [], "person_names": ["hb load spedoc", "por la ley"], "agreement_id": "4bbf0f5ab2e70518442bea79e449ff2d5d074fc081481197c1fda9bd02c92f25", "topics": [], "terms": ["***", "**12/08/2009**", "**8th**", "**ADDENDUM TO CREDIT LINE AGREEMENT**", "**ANY SUIT, ACTION OR PROCEEDING ARISING OUT OF OR RELATED TO THIS AGREEMENT OR THE TRANSACTIONS CONTEMPLATED BY THIS AGREEMENT OR ANY JUDGMENT ENTERED BY ANY COURT REGARDING THIS AGREEMENT OR THE TRANSACTIONS CONTEMPLATED BY THIS AGREEMENT WILL BE BROUGHT AND MAINTAINED EXCLUSIVELY IN THE THIRD JUDICIAL DISTRICT COURT FOR THE STATE OF UTAH OR IN THE UNITED STATES DISTRICT COURT FOR THE STATE OF UTAH. EACH OF THE LOAN PARTIES IRREVOCABLY SUBMITS TO THE JURISDICTION OF THE COURTS OF THE THIRD JUDICIAL DISTRICT COURT FOR THE STATE OF UTAH AND OF THE UNITED STATES DISTRICT COURT FOR THE STATE OF UTAH FOR THE PURPOSE OF ANY SUCH ACTION OR PROCEEDING AS SET FORTH ABOVE AND IRREVOCABLY AGREES TO BE BOUND BY ANY JUDGMENT RENDERED THEREBY IN CONNECTION WITH SUCH ACTION OR PROCEEDING. EACH OF THE LOAN PARTIES IRREVOCABLY WAIVES, TO THE FULLEST EXTENT PERMITTED BY LAW, ANY OBJECTION WHICH IT MAY HAVE NOW OR IN THE FUTURE TO THE LAYING OF VENUE OF ANY SUCH ACTION OR PROCEEDING BROUGHT IN ANY SUCH COURT REFERRED TO ABOVE AND ANY CLAIM THAT ANY SUCH ACTION OR PROCEEDING HAS BEEN BROUGHT IN AN INCONVENIENT FORUM.**", "**AVISO PARA EL FIADOR (Spanish Translation Required By Law)**", "**Acceptance of Application and Agreement; Applicable Law**", "**Account Agreement**", "**Aggregate Approved Amount**", "**Amendment**", "**Any arbitration proceeding between the Borrower (or any other Loan Party) and the Securities Intermediary, regardless of whether or not based on circumstances related to any court proceedings between the Bank and the Borrower (or the other Loan Party), will not provide a basis for any stay of the court proceedings.**", "**Any person, whether married, unmarried, or separated, may apply for separate credit.**", "**As required by law, you are notified that a negative credit report reflecting on your credit record may be submitted to a credit reporting agency if you fail to fulfill the terms of your credit obligations.**", "**Assignment**", "**BORROWER’S LOAN AND/OR SELL THE BORROWER’S SECURITIES. ANY REQUIRED LIQUIDATIONS MAY INTERRUPT THE BORROWER’S LONG-TERM INVESTMENT STRATEGIES AND MAY RESULT IN ADVERSE TAX CONSEQUENCES.**", "**BY SIGNING BELOW, THE BORROWER UNDERSTANDS, ACKNOWLEDGES AND AGREES THAT:**", "**Borrower Agreement**", "**C/o UBS Financial Services Inc.**", "**COLLATERAL ENTAILS RISKS. SHOULD THE VALUE OF THE SECURITIES IN THE COLLATERAL ACCOUNT DECLINE BELOW THE REQUIRED COLLATERAL MAINTENANCE REQUIREMENTS, UBS BANK USA MAY REQUIRE THAT THE BORROWER POST ADDITIONAL COLLATERAL, REPAY PART OR ALL OF THE**", "**Choice of Forum; Waiver of Jury Trial**", "**Collateral; Grant of Security Interest; Set-off**", "**Control**", "**Credit Line Agreement - Demand Facility**", "**Credit Line Agreement**", "**Definitions**", "**EACH OF THE LOAN PARTIES (FOR ITSELF, ANYONE CLAIMING THROUGH IT OR IN ITS NAME, AND ON BEHALF OF ITS EQUITY HOLDERS) IRREVOCABLY WAIVES ANY RIGHT IT MAY HAVE TO A TRIAL BY JURY REGARDING ANY CLAIM BASED UPON OR ARISING OUT OF THIS AGREEMENT OR ANY OF THE TRANSACTIONS CONTEMPLATED BY THIS AGREEMENT.**", "**Each Fixed Rate Advance will be due and payable in full ON DEMAND or, if not earlier demanded by the Bank, on the last day of the applicable Interest Period.**", "**Each Loan Party acknowledges and agrees that this Agreement supplements their account agreement(s) with the Securities Intermediary relating to the Collateral Account and, if applicable, any related account management agreement(s) between the Loan Party and the Securities Intermediary. In the event of a conflict between the terms of this Agreement and any other agreement between the Loan Party and the Securities Intermediary, the terms of this Agreement will prevail.**", "**Each Variable Rate Advance will be due and payable ON DEMAND.**", "**Establishment of Credit Line; Termination**", "**For residents of California:**", "**For residents of Ohio:**", "**For residents of Oregon:**", "**For residents of Vermont:**", "**Indemnification; Limitation on Liability of the Bank and the Securities Intermediary**", "**Interest**", "**Joint Credit Line Account Agreement; Suspension and Cancellation**", "**LIMITATION, THE NEW YORK UNIFORM COMMERCIAL CODE, AND FOR PURPOSES OF THIS AGREEMENT, THE COLLATERAL ACCOUNT AND THE BANK’S SECURITY INTEREST THEREIN, THE JURISDICTION OF UBS FINANCIAL SERVICES INC. AND UBS-I SHALL BE DEEMED TO BE THE STATE OF NEW YORK.**", "**NOTICE TO BORROWER: DO NOT SIGN THIS AGREEMENT BEFORE YOU READ IT. THIS AGREEMENT PROVIDES FOR THE PAYMENT OF A PENALTY IF YOU WISH TO REPAY A FIXED RATE ADVANCE PRIOR TO THE DATE PROVIDED FOR REPAYMENT IN THE AGREEMENT.**", "**NOTICE TO BORROWER: THE ADVANCES MADE UNDER THIS AGREEMENT ARE DEMAND LOANS AND SO MAY BE COLLECTED BY THE LENDER AT ANY TIME. A NEW LOAN MUTUALLY AGREED UPON AND SUBSEQUENTLY ISSUED MAY CARRY A HIGHER OR LOWER RATE OF INTEREST.**", "**NOTICE TO CO-SIGNER (Traduccion en Ingles Se Requiere Por La Ley)**", "**NOTICE TO JOINT BORROWER: YOUR SIGNATURE ON THE AGREEMENT MEANS THAT YOU ARE EQUALLY LIABLE FOR REPAYMENT OF THIS LOAN. IF THE BORROWER DOES NOT PAY, THE LENDER HAS A LEGAL RIGHT TO COLLECT FROM YOU.**", "**Name of Borrower: Official Payments Corporation**", "**Neither UBS Bank USA nor UBS Financial Services Inc. provides legal or tax advice and nothing herein shall be construed as providing legal or tax advice.**", "**Nothing in this Section 17 will be deemed to alter any agreement to arbitrate any controversies which may arise between the Borrower (or any other Loan Party) and UBS Financial Services Inc. or its predecessors, and any claims between the Borrower or the Loan Party, as applicable, and UBS Financial Services Inc. or its employees (whether or not they have acted as agents of the Bank) will be arbitrated as provided in any agreement between the Borrower or the Loan Party, as applicable, and UBS Financial Services Inc.**", "**Notices**", "**Outstanding Amount under Credit Line**", "**Payments**", "**Prepayments; Breakage Charges**", "**Remedies**", "**Representations, Warranties and Covenants by the Loan Parties**", "**Schedule I to UBS Bank USA Credit Line Agreement**", "**Schedule II to UBS Bank USA Credit Line Agreement**", "**Severability**", "**Spread Over LIBOR/UBS Bank**", "**Spread Over Prime**", "**State Specific Provisions and Disclosures**", "**THE BORROWER AND EACH OTHER LOAN PARTY UNDERSTAND AND AGREE THAT THE BANK MAY DEMAND FULL OR PARTIAL PAYMENT OF THE CREDIT LINE OBLIGATIONS, AT ITS SOLE AND ABSOLUTE DISCRETION AND WITHOUT CAUSE, AT ANY TIME, AND THAT NEITHER FIXED RATE ADVANCES NOR VARIABLE RATE ADVANCES ARE EXTENDED FOR ANY SPECIFIC TERM OR DURATION.**", "**THE BORROWER UNDERSTANDS AND AGREES THAT UBS BANK USA MAY DEMAND FULL OR PARTIAL PAYMENT OF THE CREDIT LINE OBLIGATIONS, AT ITS SOLE OPTION AND WITHOUT CAUSE, AT ANY TIME, AND THAT NEITHER FIXED RATE ADVANCES NOR VARIABLE RATE ADVANCES ARE EXTENDED FOR ANY SPECIFIC TERM OR DURATION. THE BORROWER UNDERSTANDS AND AGREES THAT ALL ADVANCES ARE SUBJECT TO COLLATERAL MAINTENANCE REQUIREMENTS. THE BORROWER UNDERSTANDS THAT UBS BANK USA MAY, AT ANY TIME, IN ITS DISCRETION, TERMINATE AND CANCEL THE CREDIT LINE REGARDLESS OF WHETHER OR NOT AN EVENT HAS OCCURRED.**", "**THE BORROWER UNDERSTANDS THAT BORROWING USING SECURITIES AS**", "**THIS AGREEMENT WILL BE GOVERNED BY, AND CONSTRUED IN ACCORDANCE WITH, THE LAWS OF THE STATE OF UTAH APPLICABLE TO AGREEMENTS MADE AND TO BE PERFORMED ENTIRELY IN THE STATE OF UTAH AND, IN CONNECTION WITH THE CHOICE OF LAW GOVERNING INTEREST, THE FEDERAL LAWS OF THE UNITED STATES, EXCEPT THAT WITH RESPECT TO THE COLLATERAL ACCOUNT AND THE BANK’S SECURITY INTEREST THEREIN, THIS AGREEMENT SHALL BE GOVERNED BY AND CONSTRUED IN ACCORDANCE WITH THE LAWS OF THE STATE OF NEW YORK, INCLUDING, WITHOUT**", "**THIS APPLICATION AND AGREEMENT WILL BE RECEIVED AND ACCEPTED BY BANK IN THE STATE OF UTAH, OR IF THIS APPLICATION AND AGREEMENT IS DELIVERED TO BANK’S AGENT, UBS FINANCIAL SERVICES INC., IT WILL BE RECEIVED AND ACCEPTED WHEN RECEIVED BY UBS FINANCIAL SERVICES INC.’S UNDERWRITING DEPARTMENT. DELIVERY OF THE APPLICATION AND AGREEMENT TO THE BORROWER’S FINANCIAL ADVISOR AT UBS FINANCIAL SERVICES INC. WILL NOT BE CONSIDERED RECEIPT OR ACCEPTANCE BY BANK. ALL DECISIONS MADE BY BANK REGARDING THE CREDIT LINE WILL BE MADE IN UTAH.**", "**Terms of Advances**", "**The Borrower will not attempt to obtain any Advance if the Borrower knows that the Borrower’s credit privileges under the Credit Line have been terminated or suspended.**", "**The Borrower will notify the Bank by telephone, telegraph, letter, or any other reasonable means that an unauthorized use of the Credit Line has occurred or may occur as the result of the loss or theft of a credit card or other instrument identifying the Credit Line, within a reasonable time after the Borrower’s discovery of the loss or theft, and will reasonably assist the Bank in determining the facts and circumstances relating to any unauthorized use of the Credit Line.**", "**The Borrower will notify the Bank, within a reasonable time, of any change in the Borrower’s name, address, or employment.**", "**The Ohio laws against discrimination require that all creditors make credit equally available to all creditworthy customers, and that credit reporting agencies maintain separate credit histories on each individual upon request. The Ohio civil rights commission administers compliance with this law.**", "**The authorized signatory of the Borrower must be one of the Authorized Persons designated on the applicable UBS Bank USA supplemental form executed by the Borrower (e.g., the Supplemental Corporate Resolution Form (HP Form)).**", "**UBS Bank USA**", "**UNCOMMITTED, DEMAND**", "**UNLESS DISCLOSED IN WRITING TO THE BANK AT THE TIME OF THE APPLICATION, AND APPROVED BY THE BANK, THE BORROWER AGREES NOT TO USE THE PROCEEDS OF ANY ADVANCE EITHER TO PURCHASE, CARRY OR TRADE IN SECURITIES OR TO REPAY ANY DEBT (I) USED TO PURCHASE, CARRY OR TRADE IN SECURITIES OR (II) TO ANY AFFILIATE OF THE BANK. THE BORROWER WILL BE DEEMED TO REPEAT THE AGREEMENT IN THIS SECTION 2(C) EACH TIME IT REQUESTS AN ADVANCE.**", "**UNLESS DISCLOSED IN WRITING TO UBS BANK USA AT THE TIME OF THIS AGREEMENT, AND APPROVED BY UBS BANK USA, THE BORROWER AGREES NOT TO USE THE PROCEEDS OF ANY ADVANCE EITHER TO PURCHASE, CARRY OR TRADE IN SECURITIES OR TO REPAY ANY DEBT (I) USED TO PURCHASE, CARRY OR TRADE IN SECURITIES OR (II) TO ANY AFFILIATE OF UBS BANK USA. THE BORROWER WILL BE DEEMED TO REPEAT THIS AGREEMENT EACH TIME THE BORROWER REQUESTS AN ADVANCE.**", "**USA Fixed Funding Rate**", "**Unless otherwise required by law, all notices to a Loan Party may be oral or in writing, in the Bank’s discretion, and if in writing, delivered or mailed by the United States mail, or by overnight carrier or by telecopy to the address of the Loan Party shown on the records of the Bank. Each Loan Party agrees to send notices to the Bank, in writing, at such address as provided by the Bank from time to time.**", "**[[Date 2: Date]]**", "“Account Agreement”", "“Account”", "“Agreement”", "“Bank”", "“Borrower”", "“Breakage Costs”", "“Breakage Fee”", "“Client”", "“Credit Line”", "“Firm”", "“Initial Advance Requirement”", "“Joint Borrower”"]}}